{
  "isEngineActive": true,
  "autoPilot": true,
  "isPaperMode": true,
  "settings": {
    "confidenceThreshold": 80,
    "defaultTradeSize": 10
  },
  "thoughts": [
    {
      "side": "BUY",
      "tp": 57750,
      "sl": 57180,
      "entryPrice": 57242.94,
      "confidence": 75,
      "potentialRoi": 0.88,
      "analysis": "Detected Market Structure Shift (MSS) following a recovery from the 57132 level. A bullish Fair Value Gap (FVG) was identified between 57203.8 and 57241.15, suggesting strong buying pressure. Current price action shows consolidation near local highs, indicating a potential breakout. The Take Profit is set at 57750 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed below the recent structural low to maintain a disciplined risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "8d89c80e-9032-4bc8-9c1f-b0ca7f71554d",
      "timestamp": "2026-02-20T02:10:17.324Z"
    },
    {
      "side": "BUY",
      "tp": 0.1435,
      "sl": 0.139,
      "entryPrice": 0.1404,
      "confidence": 75,
      "potentialRoi": 1.6,
      "analysis": "Detected Market Structure Shift (MSS) above the 0.1392 consolidation zone. Strong bullish momentum confirmed by recent highs of 0.1404. Fair Value Gap (FVG) exists between 0.1394 and 0.1400. TP is set at 0.1435 to capture liquidity while accounting for 0.6% round-trip fees, targeting a net 1.6% ROI. SL is tight at 0.1390, just below the recent support level to maintain a high risk-reward ratio.",
      "symbol": "FET",
      "id": "3727bc63-ecb8-456b-af47-e8ae2bce872f",
      "timestamp": "2026-02-20T02:10:03.049Z"
    },
    {
      "side": "BUY",
      "tp": 0.878,
      "sl": 0.856,
      "entryPrice": 0.8617,
      "confidence": 75,
      "potentialRoi": 1.29,
      "analysis": "Detected a bullish Market Structure Shift (MSS) following the break of 0.8603. A significant displacement candle from 0.8591 to 0.8631 created a Fair Value Gap (FVG). Price is currently retracing into this discount zone. Entry at 0.8617 targets a continuation of the trend towards 0.8780. Stop loss is placed below the displacement origin at 0.8560. TP accounts for 0.6% round-trip fees while maintaining a positive risk-to-reward ratio.",
      "symbol": "NEAR",
      "id": "76cf2115-f91e-43c7-8763-dbab6f73c1d6",
      "timestamp": "2026-02-20T02:09:50.861Z"
    },
    {
      "side": "BUY",
      "tp": 7.72,
      "sl": 7.57,
      "entryPrice": 7.6,
      "confidence": 75,
      "potentialRoi": 1.58,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 7.598 resistance level. Price is currently retracing towards a 30m Fair Value Gap (FVG) identified between 7.585 and 7.596. The entry at 7.6 captures the pullback. Take Profit is set at 7.72 to account for the 0.6% round-trip exchange fees while securing a net gain. Stop Loss is positioned aggressively below the recent swing low of 7.583 to maintain a high risk-reward ratio.",
      "symbol": "AVAX",
      "id": "d2728f1a-a70f-4c35-86ce-08e1fdd5fdc8",
      "timestamp": "2026-02-20T02:09:40.330Z"
    },
    {
      "side": "BUY",
      "tp": 71.8,
      "sl": 70.55,
      "entryPrice": 70.73,
      "confidence": 75,
      "potentialRoi": 1.51,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking 70.66. Price created a bullish Fair Value Gap (FVG) between 70.61 and 70.71. Current retracement to 70.73 offers an entry within the premium of the FVG. TP set at 71.80 to account for 0.6% round-trip fees and target a 1.5:1 reward-to-risk ratio relative to the swing low at 70.55.",
      "symbol": "SOL",
      "id": "c38ac1ec-35ad-4801-b1d8-a493e5b501bf",
      "timestamp": "2026-02-20T02:09:27.502Z"
    },
    {
      "side": "BUY",
      "tp": 1685,
      "sl": 1655,
      "entryPrice": 1662.98,
      "confidence": 75,
      "potentialRoi": 1.32,
      "analysis": "Detected Market Structure Shift (MSS) after price hit 1658.82. Bullish momentum confirmed by the break of 1660.80. Price is currently consolidating above the FVG created during the impulse move. Targeting liquidity at 1685.00 while maintaining a tight SL below the recent swing low. TP accounts for 0.6% exchange fees.",
      "symbol": "ETH",
      "id": "0a4f4271-97d9-4d69-9cf2-005d4344c2bd",
      "timestamp": "2026-02-20T02:09:16.134Z"
    },
    {
      "side": "BUY",
      "tp": 57750,
      "sl": 57150,
      "entryPrice": 57244.8,
      "confidence": 75,
      "potentialRoi": 0.88,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking 57213. Bullish FVG identified between 57203 and 57241. Price is trending upwards with higher highs and higher lows in the short term. TP set at 57750 to cover 0.6% exchange fees and secure the 50 EUR daily goal. SL placed below the recent swing low at 57150 for risk management.",
      "symbol": "BTC",
      "id": "3743aa0e-aea9-4397-8015-a8003bb99024",
      "timestamp": "2026-02-20T02:09:03.250Z"
    },
    {
      "side": "BUY",
      "tp": 0.1437,
      "sl": 0.1388,
      "entryPrice": 0.1402,
      "confidence": 75,
      "potentialRoi": 2.5,
      "analysis": "Market Structure Shift (MSS) identified as price broke above the 0.1392-0.1394 resistance zone, reaching 0.1404. A Fair Value Gap (FVG) is present between 0.1392 and 0.1402. The entry at 0.1402 capitalizes on the bullish momentum. The TP of 0.1437 covers the 0.6% round-trip exchange fees (approx 0.00084 EUR) and targets a net profit. SL is placed at 0.1388, below the recent consolidation base, maintaining a calculated risk-to-reward ratio.",
      "symbol": "FET",
      "id": "8cfe0c24-e712-4d93-a7ae-151fd0f5078e",
      "timestamp": "2026-02-20T02:08:52.593Z"
    },
    {
      "side": "BUY",
      "tp": 0.878,
      "sl": 0.858,
      "entryPrice": 0.8614,
      "confidence": 75,
      "potentialRoi": 1.92,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 0.8603 resistance. Current price at 0.8614 represents a retracement into the Fair Value Gap (FVG) formed during the impulse move to 0.8631. The Take Profit is set at 0.8780 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed tightly below the 0.8583 consolidation base to maintain a high Risk/Reward ratio.",
      "symbol": "NEAR",
      "id": "ea58fa29-1cfc-4a5e-9a55-639b1cad1658",
      "timestamp": "2026-02-20T02:08:41.903Z"
    },
    {
      "side": "BUY",
      "tp": 7.72,
      "sl": 7.58,
      "entryPrice": 7.607,
      "confidence": 75,
      "potentialRoi": 1.48,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking the 7.596 resistance level. Bullish momentum is evident with a series of higher highs. A bullish Fair Value Gap (FVG) is identified between 7.596 and 7.602. The TP of 7.72 accounts for the 0.6% round-trip exchange fees and targets a logical extension of the current trend. SL is placed tightly below the recent swing low at 7.58 to maintain a high risk-reward ratio.",
      "symbol": "AVAX",
      "id": "9746e9cd-b1b5-44a5-b6b6-25e288ad5606",
      "timestamp": "2026-02-20T02:08:27.179Z"
    },
    {
      "side": "BUY",
      "tp": 71.8,
      "sl": 70.55,
      "entryPrice": 70.8,
      "confidence": 75,
      "potentialRoi": 0.82,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 70.66 resistance level. A Fair Value Gap (FVG) is present between 70.61 and 70.71, providing a liquidity cushion. The current momentum is strongly upward. Take Profit is set at 71.8 to account for the 0.6% round-trip exchange fees (approx 0.42 EUR) and ensure a net profit per unit. Stop Loss is placed tightly at 70.55, just below the FVG and recent consolidation zone, to maintain a high reward-to-risk ratio.",
      "symbol": "SOL",
      "id": "34cad3fd-f550-4dc3-bfa1-08509f9e5a38",
      "timestamp": "2026-02-20T02:08:15.939Z"
    },
    {
      "side": "BUY",
      "tp": 1682,
      "sl": 1658.5,
      "entryPrice": 1663.16,
      "confidence": 75,
      "potentialRoi": 1.13,
      "analysis": "Detected Market Structure Shift (MSS) on 30m timeframe after a sweep of the 1658.82 liquidity level. Price impulsive move from 1660.80 to 1663.21 indicates bullish intent. TP set at 1682.00 to clear 0.6% round-trip fees and capture previous high liquidity. SL placed below recent swing low for tight risk management.",
      "symbol": "ETH",
      "id": "6bb2e300-8b1a-493d-8477-1f83f0445969",
      "timestamp": "2026-02-20T02:08:05.014Z"
    },
    {
      "side": "BUY",
      "tp": 57650,
      "sl": 57150,
      "entryPrice": 57237.16,
      "confidence": 72,
      "potentialRoi": 0.72,
      "analysis": "Bullish Market Structure Shift (MSS) identified following the recovery from 57132.75. Price is currently retracing into a bullish Fair Value Gap (FVG) between 57203.8 and 57241.15. The Take Profit is set at 57650.0 to account for the 0.6% round-trip exchange fees (approx 343 EUR) and to secure the 50 EUR daily profit goal. Stop Loss is placed below the recent swing low to maintain a calculated risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "8234af93-e0b1-48f9-9037-d995ca74c892",
      "timestamp": "2026-02-20T02:07:57.106Z"
    },
    {
      "side": "BUY",
      "tp": 0.1445,
      "sl": 0.1385,
      "entryPrice": 0.1402,
      "confidence": 75,
      "potentialRoi": 2.46,
      "analysis": "Detected Market Structure Shift (MSS) at 0.1400 following a period of consolidation at 0.1392. Bullish momentum is confirmed by the recent price spike. A Fair Value Gap (FVG) exists between 0.1394 and 0.1400. The Take Profit is set at 0.1445 to account for the 0.6% round-trip exchange fees and target a net profit. Stop Loss is placed tightly below the recent consolidation base to manage risk aggressively.",
      "symbol": "FET",
      "id": "cfb64deb-d557-4a47-8321-04e248de1169",
      "timestamp": "2026-02-20T02:07:38.714Z"
    },
    {
      "side": "BUY",
      "tp": 0.875,
      "sl": 0.8585,
      "entryPrice": 0.8617,
      "confidence": 75,
      "potentialRoi": 1.54,
      "analysis": "Market Structure Shift (MSS) confirmed on the 30m timeframe with a break above 0.8604. Price created an impulsive move to 0.8631, leaving a Fair Value Gap (FVG) between 0.8591 and 0.8617. Current entry at 0.8617 targets the next liquidity pool at 0.8750. SL is placed below the 0.8591 support level to manage risk. TP accounts for 0.6% round-trip fees.",
      "symbol": "NEAR",
      "id": "e06646a6-6fad-4bad-98a4-4bb05b17f425",
      "timestamp": "2026-02-20T02:07:27.709Z"
    },
    {
      "side": "BUY",
      "tp": 7.78,
      "sl": 7.55,
      "entryPrice": 7.611,
      "confidence": 75,
      "potentialRoi": 2.22,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 7.598 resistance level. Strong upward momentum is evident with consecutive higher highs and higher lows in the 30m timeframe. A Fair Value Gap (FVG) was identified between 7.585 and 7.596, providing a base for the current move. The Take Profit (TP) is set at 7.78 to ensure the 0.6% round-trip exchange fees are covered while securing a net profit. Stop Loss (SL) is placed aggressively below the recent swing low at 7.55 to maintain a favorable risk-to-reward ratio.",
      "symbol": "AVAX",
      "id": "0302caaa-8387-453c-bfac-209a198bb7e6",
      "timestamp": "2026-02-20T02:07:17.596Z"
    },
    {
      "side": "BUY",
      "tp": 71.8,
      "sl": 70.55,
      "entryPrice": 70.82,
      "confidence": 85,
      "potentialRoi": 1.38,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 70.66 swing high. Strong upward momentum is evident with a Fair Value Gap (FVG) formed between 70.61 and 70.71. The entry at 70.82 targets 71.80 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop loss is placed tightly below the breakout consolidation zone at 70.55 to maintain a calculated risk-to-reward ratio while chasing the daily 50 EUR target.",
      "symbol": "SOL",
      "id": "5f5386c0-6f87-44e4-a57f-20e6ed1cfc97",
      "timestamp": "2026-02-20T02:07:03.902Z"
    },
    {
      "side": "BUY",
      "tp": 1685,
      "sl": 1658,
      "entryPrice": 1662.94,
      "confidence": 75,
      "potentialRoi": 1.32,
      "analysis": "Market Structure Shift (MSS) detected after price bounced from 1658.82. Bullish momentum confirmed by break of 1661.28. Fair Value Gap (FVG) present in the 1661-1663 range. Setting TP at 1685 to clear the 0.6% fee threshold and capture liquidity above previous highs. SL placed below recent swing low for tight risk management.",
      "symbol": "ETH",
      "id": "622e7bce-f96b-4805-9c32-1dcc43cb7be0",
      "timestamp": "2026-02-20T02:06:53.297Z"
    },
    {
      "side": "BUY",
      "tp": 57850,
      "sl": 57140,
      "entryPrice": 57247.07,
      "confidence": 78,
      "potentialRoi": 1.05,
      "analysis": "Detected bullish Market Structure Shift (MSS) following a liquidity sweep at 57132.75. A bullish Fair Value Gap (FVG) was formed between 57203.8 and 57241.15, indicating strong buying pressure. The Take Profit is set at 57850.0 to account for the 0.6% round-trip exchange fees (approx 343.48 EUR) and secure the 50 EUR daily profit goal. Stop Loss is positioned below the recent swing low to maintain a calculated risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "473ab42d-ce63-4074-a7c9-e4c44f4af37b",
      "timestamp": "2026-02-20T02:06:40.135Z"
    },
    {
      "side": "BUY",
      "tp": 0.1445,
      "sl": 0.1388,
      "entryPrice": 0.1406,
      "confidence": 75,
      "potentialRoi": 2.77,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke the 0.1392 resistance with high momentum. A Fair Value Gap (FVG) exists between 0.1392 and 0.1400. Current price action shows aggressive buying. TP set at 0.1445 to account for 0.6% round-trip fees and secure a net profit towards the 50 EUR daily goal. SL is placed tightly below the previous consolidation base to manage risk.",
      "symbol": "FET",
      "id": "5b076638-4875-4bf4-b9c2-3c96768dd1ce",
      "timestamp": "2026-02-20T02:06:26.278Z"
    },
    {
      "side": "BUY",
      "tp": 0.875,
      "sl": 0.8585,
      "entryPrice": 0.862,
      "confidence": 75,
      "potentialRoi": 1.51,
      "analysis": "Market Structure Shift (MSS) confirmed with a strong bullish breakout from the 0.859-0.860 consolidation zone. A Fair Value Gap (FVG) exists between 0.8591 and 0.862. Current price is testing the top of this FVG. Entry at 0.862 with a TP of 0.875 covers the 0.6% round-trip exchange fees and targets a net gain to progress toward the 50 EUR daily goal. SL is placed tightly below the breakout candle base at 0.8585.",
      "symbol": "NEAR",
      "id": "b7fe0da0-492d-4e9d-8aac-058a20c19c63",
      "timestamp": "2026-02-20T02:06:16.296Z"
    },
    {
      "side": "BUY",
      "tp": 7.73,
      "sl": 7.56,
      "entryPrice": 7.608,
      "confidence": 75,
      "potentialRoi": 1.6,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke the 7.598 resistance level with strong momentum. A Fair Value Gap (FVG) is present between 7.585 and 7.595, indicating a strong impulsive move. The current price of 7.608 shows continued upward pressure. The Take Profit is set at 7.73 to account for the 0.6% round-trip exchange fees and secure a net profit. Stop Loss is placed at 7.56, just below the recent consolidation zone to manage risk while chasing the 50 EUR daily target.",
      "symbol": "AVAX",
      "id": "fdb224f5-b0c0-4136-a307-03a1303165cd",
      "timestamp": "2026-02-20T02:06:03.836Z"
    },
    {
      "side": "BUY",
      "tp": 72.2,
      "sl": 70.4,
      "entryPrice": 70.78,
      "confidence": 75,
      "potentialRoi": 2.01,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking 70.66 resistance. Strong momentum with a Fair Value Gap (FVG) identified between 70.61 and 70.71. Price is trending upwards on the 30m timeframe. TP set at 72.20 to account for 0.6% round-trip fees and secure profit toward the 50 EUR daily goal. SL placed below the recent swing low at 70.40 for risk management.",
      "symbol": "SOL",
      "id": "60aa1583-c7e8-4a67-a53b-0fda26da617a",
      "timestamp": "2026-02-20T02:05:52.056Z"
    },
    {
      "side": "BUY",
      "tp": 1681.5,
      "sl": 1657.5,
      "entryPrice": 1663.03,
      "confidence": 72,
      "potentialRoi": 1.11,
      "analysis": "Detected a Bullish Market Structure Shift (MSS) following the bounce from 1658.82. A significant Bullish Fair Value Gap (FVG) was established between 1660.80 and 1662.63. Current price action shows momentum breaking above the 1661.16 local resistance. The Take Profit is set at 1681.50 to ensure the 0.6% round-trip exchange fees are covered while securing a net profit towards the 50 EUR daily goal. Stop Loss is placed tightly below the recent swing low to maintain a disciplined risk-to-reward ratio.",
      "symbol": "ETH",
      "id": "a11340f3-aab8-41fa-a3d4-f5353dd7bb01",
      "timestamp": "2026-02-20T02:05:44.327Z"
    },
    {
      "side": "BUY",
      "tp": 57780,
      "sl": 57120,
      "entryPrice": 57249.39,
      "confidence": 78,
      "potentialRoi": 0.92,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 57247.97 resistance. A clear Fair Value Gap (FVG) exists between 57203.8 and 57241.15, indicating strong buying pressure. The current momentum is aggressive. Take Profit is set at 57780.00 to account for the 0.6% exchange fees and secure the 50 EUR daily profit target. Stop Loss is positioned below the recent swing low and liquidity sweep at 57132.75 to maintain a calculated risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "0c2cb2a8-b735-4719-a3c6-b6550350031c",
      "timestamp": "2026-02-20T02:05:28.020Z"
    },
    {
      "side": "BUY",
      "tp": 0.1425,
      "sl": 0.1391,
      "entryPrice": 0.1401,
      "confidence": 75,
      "potentialRoi": 1.11,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed with a break above the 0.1400 resistance level. Price action shows strong upward momentum with a Fair Value Gap (FVG) formed between 0.1392 and 0.1400. Entry at 0.1401 targets 0.1425, which accounts for the 0.6% round-trip exchange fees and provides a net profit. Stop Loss is placed tightly at 0.1391, just below the recent consolidation zone, to maintain a high risk-to-reward ratio while pursuing the daily 50 EUR goal.",
      "symbol": "FET",
      "id": "6bdbd804-ef73-412e-bde5-94acebf30342",
      "timestamp": "2026-02-20T02:05:16.092Z"
    },
    {
      "side": "BUY",
      "tp": 0.8745,
      "sl": 0.8585,
      "entryPrice": 0.8616,
      "confidence": 75,
      "potentialRoi": 1.5,
      "analysis": "Detected Market Structure Shift (MSS) at 0.8604 followed by a strong bullish expansion to 0.8616. A Fair Value Gap (FVG) is present between 0.8592 and 0.8610. Price is showing aggressive buy-side liquidity hunting. TP is set at 0.8745 to cover the 0.6% round-trip exchange fees and secure a net profit. SL is placed below the 0.8588 support cluster to maintain a disciplined risk-reward ratio while pursuing the daily 50 EUR goal.",
      "symbol": "NEAR",
      "id": "c2b08d1c-d1e6-471b-be04-c052b01ba98c",
      "timestamp": "2026-02-20T02:05:03.416Z"
    },
    {
      "side": "BUY",
      "tp": 7.72,
      "sl": 7.585,
      "entryPrice": 7.61,
      "confidence": 75,
      "potentialRoi": 1.44,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke above the 7.598 resistance level. A bullish Fair Value Gap (FVG) is present between 7.596 and 7.602. Strong upward momentum suggests a continuation. Take Profit is set at 7.72 to account for the 0.6% round-trip exchange fees and secure a net profit. Stop Loss is placed tightly below the recent swing low at 7.585 to manage risk aggressively.",
      "symbol": "AVAX",
      "id": "598f2156-b069-4a2d-a027-2c0163c22513",
      "timestamp": "2026-02-20T02:04:50.924Z"
    },
    {
      "side": "BUY",
      "tp": 72,
      "sl": 70.35,
      "entryPrice": 70.72,
      "confidence": 75,
      "potentialRoi": 1.21,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 70.66 resistance level. Strong upward momentum observed in the last 30 minutes with a Fair Value Gap (FVG) forming between 70.61 and 70.72. Entry at current price 70.72. Take Profit set at 72.00 to account for 0.6% round-trip exchange fees and target a net profit. Stop Loss placed aggressively below the recent swing low of 70.41 at 70.35 to manage risk.",
      "symbol": "SOL",
      "id": "0463083e-7195-4c7a-94e7-906423215a08",
      "timestamp": "2026-02-20T02:04:38.516Z"
    },
    {
      "side": "BUY",
      "tp": 1688.5,
      "sl": 1658.5,
      "entryPrice": 1663.08,
      "confidence": 78,
      "potentialRoi": 1.52,
      "analysis": "Detected a bullish Market Structure Shift (MSS) following a liquidity sweep at 1658.82. A significant Fair Value Gap (FVG) was formed between 1660.80 and 1663.08. The current price action shows strong momentum returning to the previous high range. The Take Profit is set at 1688.50 to clear the 0.6% round-trip fee (approx 9.98 EUR) and secure a net profit towards the daily goal. Stop Loss is positioned tightly below the recent swing low to maintain a high Risk/Reward ratio.",
      "symbol": "ETH",
      "id": "443e14dc-cfe4-4434-8e74-73dce24a7d6a",
      "timestamp": "2026-02-20T02:04:28.617Z"
    },
    {
      "side": "BUY",
      "tp": 57650,
      "sl": 57150,
      "entryPrice": 57250.52,
      "confidence": 75,
      "potentialRoi": 0.7,
      "analysis": "Bullish Market Structure Shift (MSS) detected as price broke the 57248 resistance level with high momentum. A significant Fair Value Gap (FVG) exists between 57203 and 57247, indicating strong institutional buying. The Take Profit is set at 57650 to account for the 0.6% round-trip exchange fees (approx 343.50 EUR) and secure the 50 EUR daily profit goal. Stop Loss is placed below the recent swing low to maintain a calculated risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "88a81375-f56c-4305-a7b1-8e5f5210b338",
      "timestamp": "2026-02-20T02:04:15.442Z"
    },
    {
      "side": "BUY",
      "tp": 0.1425,
      "sl": 0.1388,
      "entryPrice": 0.1401,
      "confidence": 75,
      "potentialRoi": 1.71,
      "analysis": "Detected Market Structure Shift (MSS) at 0.1396 with strong displacement to 0.1401. A bullish Fair Value Gap (FVG) has formed between 0.1393 and 0.1401. Aggressive entry on momentum to capture the trend continuation. TP set at 0.1425 to cover 0.6% round-trip fees and secure a net profit. SL placed below the recent structural low at 0.1388 to manage risk.",
      "symbol": "FET",
      "id": "b5f7c4bc-4089-4c38-b0f1-42433df28495",
      "timestamp": "2026-02-20T02:04:02.855Z"
    },
    {
      "side": "BUY",
      "tp": 0.8765,
      "sl": 0.8585,
      "entryPrice": 0.8612,
      "confidence": 78,
      "potentialRoi": 1.77,
      "analysis": "Market shows a clear bullish Market Structure Shift (MSS) with a break above the 0.8603 resistance level. A Fair Value Gap (FVG) is present between 0.8592 and 0.8612, indicating strong buying pressure. The entry at 0.8612 targets the next liquidity zone at 0.8765. The TP is set to cover the 0.6% round-trip exchange fees (approx 0.0052 EUR) while securing a net profit. SL is placed tightly below the recent swing low at 0.8585 to maintain a high risk-reward ratio.",
      "symbol": "NEAR",
      "id": "8641cdb3-3022-4d8f-b188-f88a48311b6e",
      "timestamp": "2026-02-20T02:03:51.198Z"
    },
    {
      "side": "BUY",
      "tp": 7.76,
      "sl": 7.57,
      "entryPrice": 7.605,
      "confidence": 75,
      "potentialRoi": 1.43,
      "analysis": "Market Structure Shift (MSS) confirmed as price broke the 7.598 resistance level with a strong bullish candle closing at 7.605. A Fair Value Gap (FVG) has been created in the 7.595-7.605 range. The TP is set at 7.76 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. SL is placed at 7.57, just below the recent consolidation base, maintaining a calculated risk-to-reward ratio for this aggressive scalp.",
      "symbol": "AVAX",
      "id": "07562069-a8c3-4281-868f-50d1f5d57e95",
      "timestamp": "2026-02-20T02:03:41.417Z"
    },
    {
      "side": "NEUTRAL",
      "tp": 57195.23,
      "sl": 57195.23,
      "entryPrice": 57195.23,
      "confidence": 15,
      "potentialRoi": 0,
      "analysis": "VOLATILITY CRUSHED. SMC SCAN REVEALS MINOR BULLISH MSS AT 57180 BUT EXCHANGE FEES (0.6%) EXCEED THE 30M TRADING RANGE. CALCULATED RISK PREVENTS ENTRY AS TP WOULD REQUIRE A BREAKOUT BEYOND 57588 TO COVER FEES AND REACH DAILY GOAL. STANDING BY FOR EXPANSION.",
      "symbol": "BTC",
      "id": "4381b73d-c50d-4776-a846-614a936e1767",
      "timestamp": "2026-02-20T02:03:27.716Z"
    },
    {
      "side": "BUY",
      "tp": 71.65,
      "sl": 70.48,
      "entryPrice": 70.64,
      "confidence": 75,
      "potentialRoi": 1.43,
      "analysis": "Bullish momentum confirmed as price broke the 70.60 resistance level. Market structure shift (MSS) observed after the recovery from 70.41. A Fair Value Gap (FVG) exists in the 70.48-70.54 range, providing support. The TP of 71.65 accounts for the 0.6% round-trip exchange fees (approx 0.42 EUR) while targeting a net profit to contribute to the 50 EUR daily goal. SL is tight at 70.48 to manage risk effectively.",
      "symbol": "SOL",
      "id": "24e643b7-633a-43ad-abfc-2b4aea50e419",
      "timestamp": "2026-02-20T02:03:26.662Z"
    },
    {
      "side": "SELL",
      "tp": 1642.5,
      "sl": 1669.2,
      "entryPrice": 1661.01,
      "confidence": 78,
      "potentialRoi": 1.11,
      "analysis": "Price action shows a clear bearish displacement from the 1665.04 peak, leaving a bearish Fair Value Gap (FVG) between 1663.26 and 1660.89. The current price is retesting the lower boundary of this FVG. Market structure has shifted bearish on the 30M timeframe. The TP is set at 1642.50 to account for the 0.6% round-trip exchange fees while targeting liquidity below the recent swing low of 1658.82 to reach the daily profit goal.",
      "symbol": "ETH",
      "id": "404b8029-c54c-42a5-a27b-3b874dd6c5ab",
      "timestamp": "2026-02-20T02:03:17.570Z"
    },
    {
      "side": "BUY",
      "tp": 0.1424,
      "sl": 0.1388,
      "entryPrice": 0.1396,
      "confidence": 75,
      "potentialRoi": 2.01,
      "analysis": "FET has exhibited a bullish Market Structure Shift (MSS) by breaking above the 0.1394 resistance level on the 30m timeframe. The recent candle close at 0.1396 confirms upward momentum. A Fair Value Gap (FVG) is identified between 0.1393 and 0.1396. The Take Profit is set at 0.1424 to ensure a net gain after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed at 0.1388, just below the recent swing low and consolidation cluster, providing a calculated risk-to-reward ratio.",
      "symbol": "FET",
      "id": "5d0d627f-47f1-4098-a3a0-22c1e287e068",
      "timestamp": "2026-02-20T02:02:51.799Z"
    },
    {
      "side": "BUY",
      "tp": 0.8725,
      "sl": 0.8583,
      "entryPrice": 0.8596,
      "confidence": 75,
      "potentialRoi": 0.9,
      "analysis": "Detected Market Structure Shift (MSS) after price broke 0.8604. Current retracement to 0.8596 sits above a bullish Fair Value Gap (FVG) created during the move from 0.8560. The TP is set at 0.8725 to clear the 0.6% exchange fee threshold and target upper liquidity levels, while the SL is placed tightly below the 0.8583 swing low to maintain a high risk-reward ratio.",
      "symbol": "NEAR",
      "id": "83d53ebc-2ffb-4ea7-b34f-6a7932e6fd60",
      "timestamp": "2026-02-20T02:02:39.335Z"
    },
    {
      "side": "BUY",
      "tp": 7.68,
      "sl": 7.55,
      "entryPrice": 7.59,
      "confidence": 70,
      "potentialRoi": 1.18,
      "analysis": "Detected a bullish Market Structure Shift (MSS) on the 30m timeframe following a bounce from 7.583. Price is currently mitigating a Fair Value Gap (FVG) between 7.585 and 7.596. The entry at 7.59 targets the next liquidity pool at 7.68, which provides a sufficient margin to cover the 0.6% round-trip exchange fees while contributing to the 50 EUR daily profit goal. Stop loss is placed below the recent swing low to maintain a tight risk-to-reward ratio.",
      "symbol": "AVAX",
      "id": "3d72a623-ceae-4d01-972a-7a80652312bd",
      "timestamp": "2026-02-20T02:02:30.796Z"
    },
    {
      "side": "BUY",
      "tp": 71.45,
      "sl": 70.25,
      "entryPrice": 70.58,
      "confidence": 65,
      "potentialRoi": 1.23,
      "analysis": "Price action shows a recovery from the 70.41 liquidity sweep with a Market Structure Shift (MSS) occurring as we reclaim the 70.55 level. A Fair Value Gap (FVG) was identified and filled in the 70.48-70.54 range, now acting as support. The Take Profit is set at 71.45 to ensure the 0.6% round-trip exchange fees (approx 0.42 EUR) are covered while securing a net profit toward the daily goal. Stop Loss is positioned tightly below the recent swing low to maintain a disciplined risk-reward profile.",
      "symbol": "SOL",
      "id": "2bfbd392-3d19-408c-add0-4c7a7fb07fd8",
      "timestamp": "2026-02-20T02:02:19.369Z"
    },
    {
      "side": "SELL",
      "tp": 1645,
      "sl": 1666,
      "entryPrice": 1660.46,
      "confidence": 75,
      "potentialRoi": 0.93,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after breaking 1663.26. Price is currently consolidating below a bearish Fair Value Gap (FVG) identified between 1661.96 and 1663.65. The downward momentum suggests a move toward lower liquidity zones. TP is set at 1645.00 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. SL is placed tightly above the recent swing high of 1665.04 to maintain a disciplined risk-to-reward ratio.",
      "symbol": "ETH",
      "id": "e375fce5-3a90-4052-bb9b-f41dd84e9a4c",
      "timestamp": "2026-02-20T02:02:03.813Z"
    },
    {
      "side": "SELL",
      "tp": 56500,
      "sl": 57265,
      "entryPrice": 57194.19,
      "confidence": 75,
      "potentialRoi": 0.61,
      "analysis": "Price has retraced into a bearish Fair Value Gap (FVG) between 57189 and 57214 after a Market Structure Shift (MSS) confirmed by a break below 57165. The current price of 57194.19 provides an optimal entry for a short position. The Take Profit is set at 56500 to account for the 0.6% round-trip exchange fees and target the liquidity below the recent swing low, aiming for the daily profit goal. Stop Loss is placed tightly above the recent local high at 57265 to maintain a high risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "63991109-e25e-4ddb-9780-51067a41a224",
      "timestamp": "2026-02-20T02:01:56.184Z"
    },
    {
      "side": "BUY",
      "tp": 0.1418,
      "sl": 0.1385,
      "entryPrice": 0.1393,
      "confidence": 65,
      "potentialRoi": 1.2,
      "analysis": "FET is consolidating with higher lows. Detected a minor FVG between 0.1393 and 0.1396. MSS confirmed on lower timeframes as price holds above 0.1390. Setting TP at 0.1418 to clear the 0.6% round-trip fee and capture a 1.2% net move. SL placed below the 0.1388 support cluster.",
      "symbol": "FET",
      "id": "3587a9d3-01cd-4f52-ad7f-47f592d51fa8",
      "timestamp": "2026-02-20T02:01:39.432Z"
    },
    {
      "side": "BUY",
      "tp": 0.8765,
      "sl": 0.8565,
      "entryPrice": 0.8601,
      "confidence": 75,
      "potentialRoi": 1.9,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 0.8595 resistance level. Price is currently consolidating above the 0.8590 support zone with a clear upward momentum. A Fair Value Gap (FVG) was identified in the 0.8590-0.8603 range. The Take Profit is set at 0.8765 to ensure a net profit after accounting for the 0.6% round-trip exchange fees, aligning with the 50 EUR daily target. Stop Loss is positioned tightly below the recent swing low at 0.8565 to maintain a disciplined risk-to-reward ratio.",
      "symbol": "NEAR",
      "id": "72a6b1d6-62e4-4dda-87e4-4ba17fd64df7",
      "timestamp": "2026-02-20T02:01:27.861Z"
    },
    {
      "side": "BUY",
      "tp": 7.715,
      "sl": 7.565,
      "entryPrice": 7.597,
      "confidence": 75,
      "potentialRoi": 0.95,
      "analysis": "Detected bullish Market Structure Shift (MSS) after a liquidity sweep at the 7.583 level. Price action shows a strong recovery with a Fair Value Gap (FVG) formed between 7.585 and 7.596. The current momentum suggests a continuation towards the next liquidity pool. Take Profit is set at 7.715 to account for the 0.6% round-trip exchange fees and secure a net profit of approximately 0.95%. Stop Loss is placed strictly below the recent swing low to manage risk aggressively.",
      "symbol": "AVAX",
      "id": "cf0f4c24-04fd-4d72-ba71-fd68a501ec86",
      "timestamp": "2026-02-20T02:01:15.245Z"
    },
    {
      "side": "BUY",
      "tp": 71.45,
      "sl": 70.38,
      "entryPrice": 70.56,
      "confidence": 75,
      "potentialRoi": 1.26,
      "analysis": "SOL has demonstrated a strong recovery from the 70.41 liquidity grab, indicating a bullish Market Structure Shift (MSS) on the short-term timeframe. The price has filled the bearish FVG created during the drop and is now pushing towards the previous high of 70.66. The TP is set at 71.45 to account for the 0.6% round-trip exchange fees and secure a net profit toward the 50 EUR daily goal. SL is positioned tightly below the recent swing low at 70.38 to maintain a high risk-reward ratio.",
      "symbol": "SOL",
      "id": "da356dda-99aa-4f23-88d6-10c113ed42e4",
      "timestamp": "2026-02-20T02:01:03.977Z"
    },
    {
      "side": "SELL",
      "tp": 1642.5,
      "sl": 1667.5,
      "entryPrice": 1660.87,
      "confidence": 82,
      "potentialRoi": 1.1,
      "analysis": "Detected Market Structure Shift (MSS) after breaking 1661.65 support. A bearish Fair Value Gap (FVG) exists between 1661.96 and 1663.26. Current price action shows a weak retracement into a bear flag. Entry at 1660.87 with a TP at 1642.50 to account for 0.6% exchange fees and secure net profit. SL placed above the FVG to manage risk.",
      "symbol": "ETH",
      "id": "0b4e2597-94d2-459e-a6a4-3738cf2171c9",
      "timestamp": "2026-02-20T02:00:55.980Z"
    },
    {
      "side": "BUY",
      "tp": 57650,
      "sl": 57100,
      "entryPrice": 57203.06,
      "confidence": 65,
      "potentialRoi": 0.78,
      "analysis": "Detected a Market Structure Shift (MSS) following a liquidity sweep at 57132.75. The price successfully reclaimed the 57189.26 level, indicating bullish intent. The Take Profit is set at 57650 to overcome the 0.6% round-trip fee hurdle (approx 343 EUR) and achieve the 50 EUR daily profit target. Stop Loss is positioned tightly below the recent swing low to maintain a disciplined risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "a3b56195-6740-4fe1-a10d-90707c2a5bbe",
      "timestamp": "2026-02-20T02:00:44.332Z"
    },
    {
      "side": "BUY",
      "tp": 0.1415,
      "sl": 0.1387,
      "entryPrice": 0.1393,
      "confidence": 75,
      "potentialRoi": 0.98,
      "analysis": "FET exhibits a bullish market structure on the 30M timeframe with consistent higher lows. A Market Structure Shift (MSS) occurred as price cleared the 0.1391 level. A small Fair Value Gap (FVG) exists between 0.1391 and 0.1393, providing a solid entry zone. The Take Profit is set at 0.1415 to account for the 0.6% round-trip exchange fees while targeting a net profit. Stop Loss is placed tightly at 0.1387, just below the recent swing low to maintain a high risk-reward ratio.",
      "symbol": "FET",
      "id": "8eecec45-da40-4dce-ba66-7c8d3a97f5a1",
      "timestamp": "2026-02-20T02:00:26.379Z"
    }
  ],
  "executionLogs": [
    {
      "id": "da9235c8-980e-4f52-85df-cffc52da57af",
      "symbol": "SOL",
      "action": "BUY",
      "price": 70.82,
      "status": "SUCCESS",
      "details": "AUTO_SMC_HIT_85%",
      "timestamp": "2026-02-20T02:07:03.903Z"
    }
  ],
  "activePositions": [
    {
      "symbol": "BTC",
      "entryPrice": 58144.28,
      "amount": 10,
      "tp": 59888.61,
      "sl": 56981.39,
      "pnlPercent": -1.5419917488014327,
      "pnl": null,
      "currentPrice": 57247.7
    },
    {
      "symbol": "SOL",
      "entryPrice": 70.82,
      "currentPrice": 70.72,
      "amount": 10,
      "quantity": 0.1412030499858797,
      "tp": 71.8,
      "sl": 70.55,
      "confidence": 85,
      "potentialRoi": 1.38,
      "pnl": -0.014120304998587168,
      "pnlPercent": -0.1412030499858717,
      "isPaper": true,
      "timestamp": "2026-02-20T02:07:03.903Z"
    }
  ],
  "liquidity": {
    "eur": 19.9696595458604,
    "usdc": 8.764328e-7
  },
  "dailyStats": {
    "trades": 7,
    "profit": 0,
    "fees": 0,
    "dailyGoal": 50
  },
  "currentStatus": "SNIPING_BTC",
  "scanIndex": 1627,
  "diag": "PREDATOR_X_ONLINE",
  "lastScans": [],
  "lastSync": null,
  "cooldownUntil": 0,
  "managedAssets": {}
}