{
  "isEngineActive": true,
  "autoPilot": true,
  "isPaperMode": false,
  "settings": {
    "confidenceThreshold": 80,
    "defaultTradeSize": 10
  },
  "thoughts": [
    {
      "side": "BUY",
      "tp": 1682,
      "sl": 1658,
      "entryPrice": 1662.01,
      "confidence": 75,
      "potentialRoi": 1.2,
      "analysis": "Detected a bullish Market Structure Shift (MSS) after a sweep of the 1657.10 liquidity zone. Price has reclaimed the 1660 level with strong momentum, leaving a Fair Value Gap (FVG) between 1658.92 and 1660.82. Current price action suggests a continuation towards the next liquidity pool at 1682. TP is set to cover the 0.6% round-trip fee and secure a net profit towards the daily goal.",
      "symbol": "ETH",
      "id": "655040f1-725f-4387-9931-639157900050",
      "timestamp": "2026-02-20T02:42:00.870Z"
    },
    {
      "side": "BUY",
      "tp": 57750,
      "sl": 57050,
      "entryPrice": 57231.57,
      "confidence": 75,
      "potentialRoi": 0.9,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price breaks above the 57230 level following a recovery from 57131. A Fair Value Gap (FVG) exists between 57161 and 57183, providing a liquidity cushion. The Take Profit is set aggressively at 57750 to account for the 0.6% round-trip exchange fees (approx 343 EUR) and to capture the 50 EUR daily profit goal. Stop Loss is placed below the recent consolidation zone to manage risk.",
      "symbol": "BTC",
      "id": "0df8f50a-ef2a-45a5-8355-2abb83bc3d90",
      "timestamp": "2026-02-20T02:41:49.403Z"
    },
    {
      "side": "SELL",
      "tp": 0.1375,
      "sl": 0.1403,
      "entryPrice": 0.1395,
      "confidence": 72,
      "potentialRoi": 1.43,
      "analysis": "Bearish displacement from 0.1401 to 0.1394 indicates a Market Structure Shift (MSS). Price is currently consolidating in a bearish flag pattern. Targeting lower liquidity zones below the 0.1394 support. TP is calculated to cover the 0.6% round-trip exchange fees while maintaining a net profit margin to reach the daily goal.",
      "symbol": "FET",
      "id": "28785b1c-0a85-45e6-9703-7e1a471ef273",
      "timestamp": "2026-02-20T02:41:40.106Z"
    },
    {
      "side": "SELL",
      "tp": 7.53,
      "sl": 7.615,
      "entryPrice": 7.595,
      "confidence": 55,
      "potentialRoi": 0.85,
      "analysis": "Bearish FVG identified at 7.60. Price failed to sustain MSS above 7.601. Aggressive sell entry at 7.595 targeting sell-side liquidity at 7.53. SL placed above swing high to maintain tight risk. TP accounts for 0.6% round-trip fees.",
      "symbol": "AVAX",
      "id": "12d8bb9b-3bea-4a28-9998-02f1f8fd08e9",
      "timestamp": "2026-02-20T02:41:28.892Z"
    },
    {
      "side": "BUY",
      "tp": 0.875,
      "sl": 0.856,
      "entryPrice": 0.8613,
      "confidence": 75,
      "potentialRoi": 0.99,
      "analysis": "Detected bullish recovery after a sweep of the 0.8587 liquidity. Price is filling the FVG created during the previous drop. MSS confirmed on lower timeframe. TP set to clear 0.6% fees and target the 0.875 resistance zone.",
      "symbol": "NEAR",
      "id": "e43ca6eb-9dee-4f3c-ac60-a5dfaa197589",
      "timestamp": "2026-02-20T02:41:23.443Z"
    },
    {
      "side": "BUY",
      "tp": 71.85,
      "sl": 70.42,
      "entryPrice": 70.63,
      "confidence": 75,
      "potentialRoi": 1.72,
      "analysis": "Detected a bullish Market Structure Shift (MSS) after price bounced from 70.43. Price cleared local resistance at 70.62. Setting TP at 71.85 to account for 0.6% round-trip fees and capture the extension of the current upward momentum. SL placed tightly below the recent swing low at 70.42 to maintain a high R/R ratio.",
      "symbol": "SOL",
      "id": "6d98003d-3085-4ab8-a43b-2e60096dc6a9",
      "timestamp": "2026-02-20T02:41:02.714Z"
    },
    {
      "side": "BUY",
      "tp": 1685,
      "sl": 1655,
      "entryPrice": 1661.47,
      "confidence": 75,
      "potentialRoi": 1.41,
      "analysis": "Detected Bullish Market Structure Shift (MSS) following a liquidity sweep at 1657.10. A Bullish Fair Value Gap (FVG) exists between 1658.92 and 1660.82. The current price of 1661.47 is positioned for a continuation of the recovery trend. Take Profit is set at 1685.0 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed aggressively below the recent swing low to maintain a high Risk/Reward ratio.",
      "symbol": "ETH",
      "id": "dca8eea6-c070-428b-98bc-9bd6f9ad1b41",
      "timestamp": "2026-02-20T02:40:49.879Z"
    },
    {
      "side": "BUY",
      "tp": 57680,
      "sl": 57120,
      "entryPrice": 57211.34,
      "confidence": 75,
      "potentialRoi": 0.82,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking 57190. Price is retracing into a bullish FVG zone. Target set to 57680 to account for 0.6% round-trip fees and reach the daily profit goal. SL placed below the recent swing low at 57131.",
      "symbol": "BTC",
      "id": "973f1bf0-2643-49c1-ba4b-cab77adec3c0",
      "timestamp": "2026-02-20T02:40:38.105Z"
    },
    {
      "side": "BUY",
      "tp": 0.1415,
      "sl": 0.1388,
      "entryPrice": 0.1396,
      "confidence": 65,
      "potentialRoi": 1.36,
      "analysis": "FET has established a local support floor at 0.1394 after a retracement from 0.1401. A minor bullish Market Structure Shift (MSS) is forming as price stabilizes at 0.1396. The Take Profit is set at 0.1415 to account for the 0.6% round-trip exchange fees and target liquidity above the previous consolidation zone. Stop Loss is placed tightly below the recent swing low to maintain a high risk-to-reward ratio while pursuing the daily profit goal.",
      "symbol": "FET",
      "id": "62beb25f-54c4-4869-8c5f-42f293ddee0d",
      "timestamp": "2026-02-20T02:40:24.985Z"
    },
    {
      "side": "BUY",
      "tp": 0.875,
      "sl": 0.858,
      "entryPrice": 0.8611,
      "confidence": 75,
      "potentialRoi": 1.01,
      "analysis": "Detected local Market Structure Shift (MSS) after a bounce from 0.8587. Price is reclaiming levels with a potential Fair Value Gap (FVG) fill target between 0.8625 and 0.8631. TP is set at 0.8750 to ensure a net profit of approximately 1% after accounting for the 0.6% round-trip exchange fees. SL is placed tightly below the recent swing low to maintain a calculated risk-to-reward ratio.",
      "symbol": "NEAR",
      "id": "d8db2860-dc84-4815-86df-f56a3fba912e",
      "timestamp": "2026-02-20T02:40:12.446Z"
    },
    {
      "side": "BUY",
      "tp": 7.72,
      "sl": 7.575,
      "entryPrice": 7.6,
      "confidence": 65,
      "potentialRoi": 1.57,
      "analysis": "Detected Market Structure Shift (MSS) after a dip to 7.587. Price recovered to 7.6, filling a small bullish FVG. Bullish momentum is building on the 30m timeframe. TP set at 7.72 to cover 0.6% round-trip fees and secure profit towards the 50 EUR daily goal. SL placed tightly below the recent swing low to manage risk aggressively.",
      "symbol": "AVAX",
      "id": "94c0f2c7-0fd7-40eb-8c6b-e8bdcfbda2ad",
      "timestamp": "2026-02-20T02:39:59.127Z"
    },
    {
      "side": "BUY",
      "tp": 71.65,
      "sl": 70.45,
      "entryPrice": 70.66,
      "confidence": 75,
      "potentialRoi": 1.4,
      "analysis": "Market Structure Shift (MSS) confirmed as price reclaimed the 70.65 level with increasing volume. Recent price action shows a recovery from the 70.43 low, creating a bullish bias. The Take Profit is set at 71.65 to ensure a net gain after accounting for the 0.6% round-trip exchange fees (approx 0.42 EUR). Stop Loss is placed tightly at 70.45, just below the recent consolidation zone, to maintain a calculated risk-to-reward ratio while chasing the daily 50 EUR goal.",
      "symbol": "SOL",
      "id": "d7ebf529-c57e-4123-9ea6-97644d52ecc9",
      "timestamp": "2026-02-20T02:39:50.880Z"
    },
    {
      "side": "BUY",
      "tp": 1682,
      "sl": 1655,
      "entryPrice": 1661.07,
      "confidence": 75,
      "potentialRoi": 1.26,
      "analysis": "Market Structure Shift (MSS) detected as price broke 1660.74 resistance. Bullish momentum confirmed by a Fair Value Gap (FVG) between 1658.92 and 1660.82. Entry at current price with TP set to clear 0.6% round-trip fees and target upper liquidity. SL placed below the recent swing low to maintain a calculated risk-reward ratio.",
      "symbol": "ETH",
      "id": "d65c69ea-09e0-4abb-a254-0b26c69ce6cb",
      "timestamp": "2026-02-20T02:39:37.286Z"
    },
    {
      "side": "BUY",
      "tp": 57650,
      "sl": 57120,
      "entryPrice": 57218,
      "confidence": 75,
      "potentialRoi": 0.75,
      "analysis": "Detected a Market Structure Shift (MSS) following a liquidity sweep at the 57131 level. The price has entered a bullish expansion phase with consecutive higher highs on the 30m timeframe. The Take Profit is set at 57650 to account for the 0.6% round-trip exchange fees (approx 343 EUR) and to secure a net profit exceeding the 50 EUR daily goal. Stop Loss is positioned tightly below the recent swing low to manage risk aggressively.",
      "symbol": "BTC",
      "id": "f142fcd7-5b1e-4c42-814f-9dae0bca4c63",
      "timestamp": "2026-02-20T02:39:30.329Z"
    },
    {
      "side": "BUY",
      "tp": 0.1425,
      "sl": 0.1388,
      "entryPrice": 0.1397,
      "confidence": 70,
      "potentialRoi": 1.4,
      "analysis": "Observed a liquidity sweep at 0.1394 followed by a strong bullish rejection back to 0.1397. This indicates a potential Market Structure Shift (MSS) on the micro-trend. The price is likely to move upward to fill the Fair Value Gap (FVG) left between 0.1401 and 0.1410. The Take Profit is set at 0.1425 to ensure a net profit of approximately 1.4% after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed aggressively below the recent swing low to maintain a high Risk-to-Reward ratio.",
      "symbol": "FET",
      "id": "eb0e6bc0-c4bf-4d71-863f-26c92b5d99e7",
      "timestamp": "2026-02-20T02:39:18.181Z"
    },
    {
      "side": "BUY",
      "tp": 0.878,
      "sl": 0.857,
      "entryPrice": 0.8616,
      "confidence": 75,
      "potentialRoi": 1.3,
      "analysis": "Detected Market Structure Shift (MSS) on the 30m timeframe as price recovered from the 0.8587 swing low. Recent candles show strong bullish momentum, breaking through minor resistance at 0.8611. A Fair Value Gap (FVG) exists toward the 0.8631 level, suggesting further upside. The Take Profit is set at 0.8780 to ensure the 0.6% round-trip exchange fees are covered while capturing the extension of the current trend. Stop Loss is placed tightly below the recent local support to maintain a high risk-reward ratio.",
      "symbol": "NEAR",
      "id": "581d42ad-f432-4a6e-8d9b-7b0b2e1d386c",
      "timestamp": "2026-02-20T02:39:00.559Z"
    },
    {
      "side": "SELL",
      "tp": 7.51,
      "sl": 7.63,
      "entryPrice": 7.595,
      "confidence": 65,
      "potentialRoi": 1.12,
      "analysis": "Bearish trend persists with lower highs. Market structure shift (MSS) occurred after breaking 7.592. FVG present at 7.60. Target 7.51 accounts for 0.6% fees and targets sell-side liquidity.",
      "symbol": "AVAX",
      "id": "25a45273-b664-49df-90e2-00fe3f706cbc",
      "timestamp": "2026-02-20T02:38:57.193Z"
    },
    {
      "side": "BUY",
      "tp": 71.5,
      "sl": 70.4,
      "entryPrice": 70.65,
      "confidence": 75,
      "potentialRoi": 1.2,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking 70.62. Strong bullish momentum with a clear FVG formed during the recovery from 70.43. Price is reclaiming previous value areas. TP set at 71.50 to clear the 0.6% fee threshold and capture liquidity above the 70.76 swing high. SL placed below the 70.45 support zone.",
      "symbol": "SOL",
      "id": "4d6e9993-4fab-4299-97cd-34eb3471808d",
      "timestamp": "2026-02-20T02:38:36.291Z"
    },
    {
      "side": "BUY",
      "tp": 1678.5,
      "sl": 1656.5,
      "entryPrice": 1660.12,
      "confidence": 75,
      "potentialRoi": 1.1,
      "analysis": "Detected Market Structure Shift (MSS) on the 30m timeframe as price reclaimed the 1659 level with momentum. A bullish Fair Value Gap (FVG) exists between 1658.31 and 1658.92. The aggressive recovery from the 1657.10 low suggests a short-term trend reversal. Take Profit is set at 1678.50 to ensure a net gain after accounting for the 0.6% round-trip exchange fees, targeting the next liquidity zone.",
      "symbol": "ETH",
      "id": "d45287cb-ba8d-4bca-ab84-982708f0eabc",
      "timestamp": "2026-02-20T02:38:25.752Z"
    },
    {
      "side": "SELL",
      "tp": 56700,
      "sl": 57260,
      "entryPrice": 57189.33,
      "confidence": 65,
      "potentialRoi": 0.25,
      "analysis": "Bearish market structure identified with lower highs and lower lows. Price is retracing into a bearish Fair Value Gap (FVG) near 57192. Setting a SELL order at 57189.33 with a TP at 56700 to account for 0.6% round-trip fees and target a net profit. SL placed above the recent swing high at 57260.",
      "symbol": "BTC",
      "id": "65045abe-5efd-4843-9129-57035771a75b",
      "timestamp": "2026-02-20T02:38:19.603Z"
    },
    {
      "side": "BUY",
      "tp": 0.1412,
      "sl": 0.1388,
      "entryPrice": 0.1396,
      "confidence": 70,
      "potentialRoi": 1.14,
      "analysis": "Price action shows a recent bearish Market Structure Shift (MSS) from 0.1401 down to 0.1394, leaving a Fair Value Gap (FVG) in the 0.1399-0.1401 range. Current consolidation at 0.1394-0.1396 suggests a local bottom. The trade targets a mean reversion to fill the FVG and liquidity sweep above 0.1403. TP is set at 0.1412 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. SL is tight at 0.1388 to manage risk aggressively.",
      "symbol": "FET",
      "id": "4bce0f60-1535-44cb-8f29-c06df0be7ac6",
      "timestamp": "2026-02-20T02:38:02.043Z"
    },
    {
      "side": "SELL",
      "tp": 0.8515,
      "sl": 0.8628,
      "entryPrice": 0.8607,
      "confidence": 75,
      "potentialRoi": 1.07,
      "analysis": "Market structure on the 30M timeframe is clearly bearish with a sequence of lower highs. The recent bounce to 0.8607 represents a retracement into a bearish supply zone and Fair Value Gap (FVG) identified between 0.8611 and 0.8615. A Market Structure Shift (MSS) occurred when the price broke below 0.8611. The Take Profit is set at 0.8515 to capture liquidity below the recent swing low while accounting for the 0.6% round-trip exchange fees, ensuring a net positive contribution toward the 50 EUR daily goal.",
      "symbol": "NEAR",
      "id": "9457cd79-8c84-4477-9123-8a860cf6b37d",
      "timestamp": "2026-02-20T02:37:51.222Z"
    },
    {
      "side": "BUY",
      "tp": 7.72,
      "sl": 7.56,
      "entryPrice": 7.6,
      "confidence": 65,
      "potentialRoi": 1.58,
      "analysis": "Detected Market Structure Shift (MSS) on the 30m timeframe as price reclaimed the 7.60 level after a liquidity sweep at 7.587. A bullish Fair Value Gap (FVG) is present between 7.591 and 7.598. The Take Profit is set at 7.72 to cover the 0.6% round-trip exchange fees and contribute to the 50 EUR daily goal. Stop Loss is positioned tightly below the recent swing low to maintain a calculated risk-reward ratio.",
      "symbol": "AVAX",
      "id": "9f053d1c-fbe7-4703-a3e7-254fb7904e33",
      "timestamp": "2026-02-20T02:37:34.670Z"
    },
    {
      "side": "BUY",
      "tp": 71.35,
      "sl": 70.35,
      "entryPrice": 70.55,
      "confidence": 75,
      "potentialRoi": 1.13,
      "analysis": "Detected a Market Structure Shift (MSS) after a local bottom at 70.43. Price is recovering with bullish momentum. Targeting the liquidity above 71.00 while maintaining a tight SL below the recent swing low. TP adjusted to 71.35 to ensure 0.6% fee coverage and net profit.",
      "symbol": "SOL",
      "id": "688abe7e-04c4-49ca-9d3e-cd05a70e839d",
      "timestamp": "2026-02-20T02:37:25.838Z"
    },
    {
      "side": "SELL",
      "tp": 1642,
      "sl": 1661.5,
      "entryPrice": 1658.04,
      "confidence": 65,
      "potentialRoi": 0.97,
      "analysis": "Bearish market structure shift observed on 30m timeframe. Price failed to hold the 1660 level, creating a bearish FVG between 1659.49 and 1658.06. Current consolidation at 1658 suggests a continuation of the downward move. TP at 1642 accounts for 0.6% round-trip fees and targets the next liquidity zone. SL at 1661.50 provides a tight risk-reward ratio above recent resistance.",
      "symbol": "ETH",
      "id": "3c44343e-018a-4fc0-ba38-2edbb5d364e4",
      "timestamp": "2026-02-20T02:37:19.405Z"
    },
    {
      "side": "SELL",
      "tp": 56750,
      "sl": 57265,
      "entryPrice": 57175.93,
      "confidence": 72,
      "potentialRoi": 0.74,
      "analysis": "Market structure shift (MSS) confirmed on the 30m timeframe after breaking the 57200 support level. A bearish Fair Value Gap (FVG) exists between 57208 and 57192. The current price action shows a corrective retracement into this supply zone. The trade targets the 56750 level to ensure a net profit after accounting for the 0.6% round-trip exchange fees (approx 343 EUR). Stop loss is placed above the recent swing high to maintain a strict risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "e8615acb-a951-4dc4-96d4-bd3f0dd37ba5",
      "timestamp": "2026-02-20T02:37:06.469Z"
    },
    {
      "side": "SELL",
      "tp": 0.1375,
      "sl": 0.1405,
      "entryPrice": 0.1395,
      "confidence": 72,
      "potentialRoi": 0.83,
      "analysis": "Bearish displacement observed from 0.1404 to 0.1394. Market Structure Shift (MSS) occurred at 0.1400. Price is currently retracing into a bearish FVG. Setting TP at 0.1375 to capture continuation while covering 0.6% exchange fees.",
      "symbol": "FET",
      "id": "c118e719-2fb2-4b81-bd94-6ee15cf8fc6b",
      "timestamp": "2026-02-20T02:36:53.462Z"
    },
    {
      "side": "SELL",
      "tp": 0.848,
      "sl": 0.864,
      "entryPrice": 0.8605,
      "confidence": 55,
      "potentialRoi": 0.85,
      "analysis": "Detected bearish market structure shift (MSS) after breaking 0.8611 support. Price is consolidating near local lows with a bearish bias. A Fair Value Gap (FVG) is present in the 0.8615-0.8625 region. Setting SELL order at 0.8605 with TP at 0.8480 to clear the 0.6% fee threshold and capture downside liquidity. SL placed at 0.8640 above recent swing highs to manage risk.",
      "symbol": "NEAR",
      "id": "0ae67b51-2432-4887-a66b-97579823a684",
      "timestamp": "2026-02-20T02:36:41.237Z"
    },
    {
      "side": "BUY",
      "tp": 7.66,
      "sl": 7.57,
      "entryPrice": 7.594,
      "confidence": 68,
      "potentialRoi": 0.87,
      "analysis": "Detected Market Structure Shift (MSS) after price bounced from 7.589 to 7.597. A Fair Value Gap (FVG) exists in the 7.60-7.61 range. The entry at 7.594 targets a retracement to previous resistance. Take Profit is set at 7.66 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is tight at 7.57, just below the recent local liquidity sweep.",
      "symbol": "AVAX",
      "id": "f0b37aa4-a685-4f37-9909-54b0f0a7d730",
      "timestamp": "2026-02-20T02:36:25.510Z"
    },
    {
      "side": "BUY",
      "tp": 71.65,
      "sl": 70.35,
      "entryPrice": 70.54,
      "confidence": 75,
      "potentialRoi": 1.57,
      "analysis": "Detected Market Structure Shift (MSS) on the micro-timeframe after price bottomed at 70.43. Bullish momentum is building with a series of higher highs in the most recent candles. The Take Profit is set at 71.65 to ensure coverage of the 0.6% round-trip exchange fees while targeting the next liquidity zone. Stop Loss is placed tightly below the recent swing low to maintain a high risk-reward ratio.",
      "symbol": "SOL",
      "id": "aa193ba9-b2a1-4a9f-a5b2-9a8c1a176ec2",
      "timestamp": "2026-02-20T02:36:12.455Z"
    },
    {
      "side": "SELL",
      "tp": 1645,
      "sl": 1661.5,
      "entryPrice": 1658.16,
      "confidence": 72,
      "potentialRoi": 0.19,
      "analysis": "The 30-minute chart shows a clear bearish trend with a Market Structure Shift (MSS) occurring after the break of 1659.49. A bearish Fair Value Gap (FVG) exists between 1658.06 and 1659.49. The current price of 1658.16 is a retracement into this FVG, providing a high-probability short entry. The Take Profit is set at 1645.00 to ensure the 0.6% round-trip exchange fee is covered while targeting the next liquidity zone. Stop Loss is placed at 1661.50, above the recent swing high and the FVG zone, to maintain a disciplined risk-to-reward ratio.",
      "symbol": "ETH",
      "id": "1a0936b7-b6c2-4a97-ae13-0bed66d1795b",
      "timestamp": "2026-02-20T02:36:10.951Z"
    },
    {
      "side": "BUY",
      "tp": 57650,
      "sl": 57100,
      "entryPrice": 57182.57,
      "confidence": 65,
      "potentialRoi": 0.81,
      "analysis": "Detected a Market Structure Shift (MSS) on the short-term timeframe as price reclaimed the 57165 level following a liquidity sweep at 57131. Bullish momentum is increasing. The Take Profit is set at 57650 to account for the 0.6% round-trip exchange fees (approx 343 EUR) and secure the 50 EUR daily profit goal. Stop Loss is placed tightly below the recent swing low to maintain a calculated risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "d7f730d5-cb69-4b4f-aa81-df217490c936",
      "timestamp": "2026-02-20T02:35:56.223Z"
    },
    {
      "side": "BUY",
      "tp": 0.1412,
      "sl": 0.1388,
      "entryPrice": 0.1395,
      "confidence": 65,
      "potentialRoi": 0.62,
      "analysis": "Detected a Market Structure Shift (MSS) on the 30m timeframe after a sharp decline to 0.1394. Price is currently consolidating at local support. Expecting a mean reversion to fill the bearish Fair Value Gap (FVG) near 0.1401 and extend towards 0.1412. The Take Profit is set to cover the 0.6% round-trip exchange fees and secure a net profit to reach the daily goal.",
      "symbol": "FET",
      "id": "138c31c6-10a6-4cc1-900f-c8067974c13b",
      "timestamp": "2026-02-20T02:35:36.728Z"
    },
    {
      "side": "SELL",
      "tp": 0.845,
      "sl": 0.8645,
      "entryPrice": 0.8605,
      "confidence": 82,
      "potentialRoi": 1.8,
      "analysis": "Bearish trend persists with lower highs at 0.8631 and 0.8625. Price rejected the FVG at 0.8615. Expecting a break of the 0.8587 support level to target sell-side liquidity. TP set at 0.8450 to ensure net profitability after 0.6% exchange fees.",
      "symbol": "NEAR",
      "id": "0cc102ee-5573-4b6f-baf5-6e3c401c8876",
      "timestamp": "2026-02-20T02:35:28.485Z"
    },
    {
      "side": "SELL",
      "tp": 7.505,
      "sl": 7.601,
      "entryPrice": 7.591,
      "confidence": 55,
      "potentialRoi": 0.53,
      "analysis": "Bearish MSS at 7.592. FVG identified at 7.599. Price consolidating at 7.591. SELL entry targets 7.505 to offset 0.6% fees. SL at 7.601 provides a tighter risk-reward ratio.",
      "symbol": "AVAX",
      "id": "530cf44a-a43d-4112-95c3-88ddbc3702f4",
      "timestamp": "2026-02-20T02:35:25.297Z"
    },
    {
      "side": "SELL",
      "tp": 69.65,
      "sl": 70.88,
      "entryPrice": 70.52,
      "confidence": 72,
      "potentialRoi": 1.23,
      "analysis": "Aggressive hunt for liquidity below 70.00. Market structure shifted bearish on the 30m timeframe after a sharp drop from 70.83. Entry at 70.52 targets the 69.65 level, anticipating a continuation of the downward trend. SL at 70.88 covers the recent swing high to mitigate risk. TP is calculated to cover the 0.6% round-trip fee and secure a net profit towards the 50 EUR daily goal.",
      "symbol": "SOL",
      "id": "0ef2fd05-e344-4738-9559-3653d3a03afc",
      "timestamp": "2026-02-20T02:35:07.895Z"
    },
    {
      "side": "SELL",
      "tp": 1642,
      "sl": 1662.5,
      "entryPrice": 1657.7,
      "confidence": 72,
      "potentialRoi": 0.95,
      "analysis": "The 30M trend is clearly bearish with a series of lower highs and lower lows. A Fair Value Gap (FVG) exists between 1659.49 and 1658.06, acting as a resistance zone. No Market Structure Shift (MSS) to the upside has occurred. Entry at 1657.7 targets the liquidity pool below 1650. The TP of 1642.0 is calculated to cover the 0.6% round-trip exchange fees (approx 9.95 EUR) and secure a net profit towards the 50 EUR daily goal. SL is placed tightly above the recent swing high and FVG to maintain a calculated risk-reward ratio.",
      "symbol": "ETH",
      "id": "714b2401-7dd0-4307-9a20-bc138369d7cf",
      "timestamp": "2026-02-20T02:34:53.185Z"
    },
    {
      "side": "BUY",
      "tp": 57650,
      "sl": 57100,
      "entryPrice": 57164.25,
      "confidence": 72,
      "potentialRoi": 0.85,
      "analysis": "Detected a bullish Market Structure Shift (MSS) on the micro-timeframe after a liquidity sweep at 57131.69. Price is currently recovering from the local bottom and attempting to fill the bearish Fair Value Gap (FVG) created during the previous drop. The Take Profit is set at 57650 to ensure that the 0.6% round-trip exchange fees are covered while still yielding a significant net profit to reach the daily goal of 50 EUR. Stop Loss is placed tightly below the recent swing low to maintain a high risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "f2a8983a-db31-4388-adb6-d9c4eb182016",
      "timestamp": "2026-02-20T02:34:50.697Z"
    },
    {
      "side": "SELL",
      "tp": 0.1365,
      "sl": 0.1405,
      "entryPrice": 0.1395,
      "confidence": 75,
      "potentialRoi": 2.15,
      "analysis": "Market Structure Shift (MSS) confirmed on the 30m timeframe after the break below 0.1400. A bearish Fair Value Gap (FVG) exists between 0.1399 and 0.1396. The current price of 0.1395 is a retest of the breakdown zone. Targeting sell-side liquidity at 0.1365 to ensure the 0.6% round-trip exchange fees are covered while maintaining a high risk-reward ratio. Tight stop-loss placed above the recent swing high to protect capital.",
      "symbol": "FET",
      "id": "a1f5e27d-7a23-4851-8428-05c14ca59386",
      "timestamp": "2026-02-20T02:34:33.597Z"
    },
    {
      "side": "SELL",
      "tp": 0.8535,
      "sl": 0.8645,
      "entryPrice": 0.8606,
      "confidence": 72,
      "potentialRoi": 0.82,
      "analysis": "Bearish MSS confirmed at 0.8611. Price consolidating below bearish FVG 0.8615-0.8625. Entry 0.8606 targets liquidity below 0.8587. TP 0.8535 covers 0.6% fees plus profit. SL 0.8645 above resistance.",
      "symbol": "NEAR",
      "id": "a31d29a6-ef3e-4a2c-abb4-6a32f81cc76d",
      "timestamp": "2026-02-20T02:34:22.229Z"
    },
    {
      "side": "SELL",
      "tp": 7.48,
      "sl": 7.625,
      "entryPrice": 7.589,
      "confidence": 75,
      "potentialRoi": 1.43,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed as price broke below the 7.60 support level. A Fair Value Gap (FVG) exists between 7.599 and 7.592, indicating strong downward momentum. The current price is consolidating at a local low, suggesting a continuation towards deeper liquidity. The Take Profit is set at 7.480 to ensure a net profit after accounting for the 0.6% round-trip exchange fees, while the Stop Loss is placed above the recent swing high of 7.612 to manage risk.",
      "symbol": "AVAX",
      "id": "99d988cf-8103-49d2-b4df-571e761a7575",
      "timestamp": "2026-02-20T02:33:59.679Z"
    },
    {
      "side": "BUY",
      "tp": 71.65,
      "sl": 70.25,
      "entryPrice": 70.52,
      "confidence": 65,
      "potentialRoi": 1.6,
      "analysis": "Detected a liquidity sweep at 70.43 followed by a bullish displacement towards 70.52. Market structure shift (MSS) confirmed on micro-timeframe as price reclaimed the 70.50 level. Target set at the next bearish FVG/Resistance zone around 71.65. TP accounts for 0.6% round-trip fees to ensure net profitability.",
      "symbol": "SOL",
      "id": "216f2f2c-7f53-4f36-86f2-447f1346c8ff",
      "timestamp": "2026-02-20T02:33:49.994Z"
    },
    {
      "side": "BUY",
      "tp": 1673.5,
      "sl": 1654.5,
      "entryPrice": 1658.31,
      "confidence": 72,
      "potentialRoi": 0.91,
      "analysis": "Detected a local bottom at 1657.10 followed by a Market Structure Shift (MSS) as the price reclaimed 1658.31. The downward momentum has stalled, and a bullish retracement toward the 1670 liquidity zone is expected. The Take Profit is set at 1673.5 to ensure the 0.6% round-trip exchange fees are covered while securing a net profit toward the daily goal.",
      "symbol": "ETH",
      "id": "7e8defad-3000-4c46-9f5b-b5f7e4247195",
      "timestamp": "2026-02-20T02:33:39.416Z"
    },
    {
      "side": "SELL",
      "tp": 56750,
      "sl": 57310,
      "entryPrice": 57160.33,
      "confidence": 68,
      "potentialRoi": 0.72,
      "analysis": "Bearish trend confirmed by lower highs and lower lows on the 30M chart. Price is retracing into a bearish FVG area. Expecting rejection and a move towards 56750. TP covers the 0.6% round-trip fee and targets the daily profit goal.",
      "symbol": "BTC",
      "id": "42130f71-6ef4-4947-9742-ae844d05c884",
      "timestamp": "2026-02-20T02:33:35.616Z"
    },
    {
      "side": "BUY",
      "tp": 0.1412,
      "sl": 0.1388,
      "entryPrice": 0.1396,
      "confidence": 65,
      "potentialRoi": 1.14,
      "analysis": "Price action shows a local bottom at 0.1394 after a sustained bearish move from 0.1404. A minor Market Structure Shift (MSS) is forming as price stabilizes at 0.1396. Targeting the Fair Value Gap (FVG) and liquidity zone between 0.1401 and 0.1404. The Take Profit at 0.1412 is calculated to cover the 0.6% round-trip exchange fees while securing a net profit to recover the current daily deficit. Stop Loss is placed tightly below the recent swing low to maintain a high Risk/Reward ratio.",
      "symbol": "FET",
      "id": "f83bec4a-b5b0-49a4-9cd9-d3b23c8e7a6b",
      "timestamp": "2026-02-20T02:33:17.183Z"
    },
    {
      "side": "SELL",
      "tp": 0.8485,
      "sl": 0.8665,
      "entryPrice": 0.8601,
      "confidence": 82,
      "potentialRoi": 1.35,
      "analysis": "Detected bearish MSS at 0.8625. Price rejected the 0.8611 FVG. Aggressive short entry at 0.8601 targeting liquidity pool at 0.8485. SL placed above recent swing high to maintain tight risk. TP accounts for 0.6% round-trip fees.",
      "symbol": "NEAR",
      "id": "ab22b83e-65ff-4671-8cca-3db74c650abb",
      "timestamp": "2026-02-20T02:33:09.227Z"
    },
    {
      "side": "SELL",
      "tp": 7.5,
      "sl": 7.62,
      "entryPrice": 7.59,
      "confidence": 72,
      "potentialRoi": 1.18,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after price broke below the 7.60 level. A Fair Value Gap (FVG) is present between 7.60 and 7.595, indicating strong selling pressure. The current consolidation at 7.59 suggests a brief pause before a continuation toward the 7.50 liquidity zone. The Take Profit (TP) is set to 7.50 to ensure a net profit after accounting for the 0.6% round-trip exchange fees, while the Stop Loss (SL) is tightly placed above the recent swing high at 7.62.",
      "symbol": "AVAX",
      "id": "6f416f5e-630c-49ed-b901-7f5ec462bfa5",
      "timestamp": "2026-02-20T02:32:52.933Z"
    },
    {
      "side": "SELL",
      "tp": 69.75,
      "sl": 70.85,
      "entryPrice": 70.48,
      "confidence": 75,
      "potentialRoi": 0.43,
      "analysis": "Bearish market structure confirmed by a series of lower highs and lower lows. A significant Fair Value Gap (FVG) was created during the drop from 70.68 to 70.51. Current price action shows a bear flag consolidation at the 70.48 level. Expecting a breakdown to target liquidity below 70.00. Take Profit is set at 69.75 to account for the 0.6% round-trip exchange fees while securing a net profit. Stop Loss is placed above the recent swing high at 70.85 to maintain a disciplined risk-to-reward ratio.",
      "symbol": "SOL",
      "id": "fb165965-54e1-4802-9f12-8768b93ba218",
      "timestamp": "2026-02-20T02:32:37.265Z"
    },
    {
      "side": "SELL",
      "tp": 1635,
      "sl": 1662,
      "entryPrice": 1657.44,
      "confidence": 78,
      "potentialRoi": 1.35,
      "analysis": "Bearish market structure confirmed with a Market Structure Shift (MSS) below 1660. Price is printing consistent lower highs and lower lows on the 30m timeframe. A Fair Value Gap (FVG) exists between 1662.4 and 1660.5, acting as resistance. The target of 1635.0 is set to ensure a net profit after accounting for the 0.6% round-trip exchange fees, aligning with the aggressive 50 EUR daily profit goal.",
      "symbol": "ETH",
      "id": "9956c963-3fef-43fe-8e17-90052ccfeb3a",
      "timestamp": "2026-02-20T02:32:28.980Z"
    },
    {
      "side": "SELL",
      "tp": 56700,
      "sl": 57265,
      "entryPrice": 57153.17,
      "confidence": 75,
      "potentialRoi": 0.79,
      "analysis": "Market exhibits a clear bearish trend on the 30m timeframe with a series of lower highs. A Market Structure Shift (MSS) occurred when price broke below 57200. A bearish Fair Value Gap (FVG) is present between 57192 and 57157. Entry at 57153.17 targets the next liquidity pool at 56700, providing enough margin to cover the 0.6% round-trip fees and reach the daily profit goal.",
      "symbol": "BTC",
      "id": "f8869338-65d4-4835-b78d-e626b67fb9f4",
      "timestamp": "2026-02-20T02:32:19.964Z"
    }
  ],
  "executionLogs": [
    {
      "id": "2736c30d-41bf-47c8-95cb-aac8209088f5",
      "symbol": "SOL",
      "action": "SELL",
      "price": 70.52,
      "pnl": -0.04236091499576351,
      "status": "SUCCESS",
      "timestamp": "2026-02-20T02:13:49.440Z"
    },
    {
      "id": "da9235c8-980e-4f52-85df-cffc52da57af",
      "symbol": "SOL",
      "action": "BUY",
      "price": 70.82,
      "status": "SUCCESS",
      "details": "AUTO_SMC_HIT_85%",
      "timestamp": "2026-02-20T02:07:03.903Z"
    }
  ],
  "activePositions": [
    {
      "symbol": "BTC",
      "entryPrice": 58144.28,
      "amount": 10,
      "tp": 59888.61,
      "sl": 56981.39,
      "pnlPercent": -1.5777648291456998,
      "pnl": null,
      "currentPrice": 57226.9
    }
  ],
  "liquidity": {
    "eur": 19.9696595458604,
    "usdc": 8.764328e-7
  },
  "dailyStats": {
    "trades": 7,
    "profit": -0.04236091499576351,
    "fees": 0,
    "dailyGoal": 50
  },
  "currentStatus": "SNIPING_ETH",
  "scanIndex": 1784,
  "diag": "PREDATOR_X_ONLINE",
  "lastScans": [],
  "lastSync": null,
  "cooldownUntil": 0,
  "managedAssets": {}
}