{
  "isEngineActive": true,
  "autoPilot": true,
  "isPaperMode": true,
  "settings": {
    "confidenceThreshold": 80,
    "defaultTradeSize": 10
  },
  "thoughts": [
    {
      "side": "SELL",
      "tp": 70.25,
      "sl": 70.78,
      "entryPrice": 70.59,
      "confidence": 72,
      "potentialRoi": 0.48,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed following the break of the 70.66 support level. A bearish Fair Value Gap (FVG) is identified between 70.64 and 70.73. Current price action shows a corrective consolidation below this gap, suggesting a continuation of the downward trend toward lower liquidity zones.",
      "symbol": "SOL",
      "id": "0a70a1ce-187c-4f03-bf9f-f55c99d34c3c",
      "timestamp": "2026-02-20T00:50:24.403Z"
    },
    {
      "side": "BUY",
      "tp": 1668.03,
      "sl": 1664.44,
      "entryPrice": 1665.92,
      "confidence": 72,
      "potentialRoi": 0.13,
      "analysis": "Price action shows a strong bullish impulse from 1660 to 1668, followed by a corrective phase that found support at 1663.31. A minor Market Structure Shift (MSS) is observed as the price reclaimed the 1665 level with a small bullish Fair Value Gap (FVG) between 1665.22 and 1665.86. The current trend suggests a retest of the local liquidity pool at the 1668.03 swing high.",
      "symbol": "ETH",
      "id": "c8764635-ed1d-4565-b47d-b74cd6ffe95c",
      "timestamp": "2026-02-20T00:50:14.593Z"
    },
    {
      "side": "SELL",
      "tp": 57042.45,
      "sl": 57222.01,
      "entryPrice": 57150,
      "confidence": 65,
      "potentialRoi": 0.19,
      "analysis": "Market structure shifted bearish following the break of the 57161.48 level. A bearish Fair Value Gap (FVG) is identified between the low of candle 22 (57167.49) and the high of candle 24 (57159.97). The current price action shows a corrective retracement into this supply zone. Expecting a continuation of the downward trend to target the sell-side liquidity resting at 57042.45.",
      "symbol": "BTC",
      "id": "0a8180e6-6a15-4833-b61a-892a85b22349",
      "timestamp": "2026-02-20T00:49:56.588Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1385,
      "entryPrice": 0.139,
      "confidence": 65,
      "potentialRoi": 1.44,
      "analysis": "The market structure shows a bullish bias with a series of higher highs and higher lows. A Break of Structure (BOS) occurred when price cleared 0.1383 and 0.1394. The current price of 0.139 represents a retracement into a previous consolidation zone. While a clear Fair Value Gap (FVG) is not prominent on this specific 30m slice, the support at 0.1387 remains intact. The trade targets a continuation of the bullish momentum toward the 0.141 level.",
      "symbol": "FET",
      "id": "7c589de6-d098-4a91-8bee-ef0ac1a1535e",
      "timestamp": "2026-02-20T00:49:46.730Z"
    },
    {
      "side": "SELL",
      "tp": 0.8555,
      "sl": 0.8595,
      "entryPrice": 0.8578,
      "confidence": 70,
      "potentialRoi": 0.27,
      "analysis": "Price rejected the 0.8593 resistance level with a strong bearish close at 0.8578. We anticipate a short-term retracement to fill the bullish Fair Value Gap (FVG) identified between 0.8555 and 0.8571. While the macro trend remains bullish, the immediate momentum has shifted following the failure to hold the 0.8591 liquidity level.",
      "symbol": "NEAR",
      "id": "91aaa562-0aa3-4f1b-908f-c24099c97e2c",
      "timestamp": "2026-02-20T00:49:42.525Z"
    },
    {
      "side": "BUY",
      "tp": 7.625,
      "sl": 7.588,
      "entryPrice": 7.601,
      "confidence": 75,
      "potentialRoi": 0.315,
      "analysis": "A bullish Market Structure Shift (MSS) occurred when price broke above the 7.584 level. A Fair Value Gap (FVG) was identified between 7.584 and 7.603. The recent price action shows a retracement into this liquidity void followed by a bounce at 7.590, suggesting the gap is acting as support. The current recovery to 7.601 indicates a continuation of the bullish trend toward the previous high of 7.615 and beyond.",
      "symbol": "AVAX",
      "id": "d13627b8-06cb-4485-94ea-1831380f4522",
      "timestamp": "2026-02-20T00:49:20.917Z"
    },
    {
      "side": "SELL",
      "tp": 70.2,
      "sl": 70.75,
      "entryPrice": 70.57,
      "confidence": 65,
      "potentialRoi": 0.52,
      "analysis": "Market structure shifted bearish after breaking the 70.66 support level. A bearish Fair Value Gap (FVG) is identified between 70.73 and 70.64. The current price action shows a series of lower highs and lower lows, indicating a continuation of the downward trend. Entry at current market price with a stop loss above the recent consolidation high.",
      "symbol": "SOL",
      "id": "251b23a7-3dbb-4144-8aa5-4ee20162f49d",
      "timestamp": "2026-02-20T00:49:11.691Z"
    },
    {
      "side": "BUY",
      "tp": 1672.5,
      "sl": 1662.5,
      "entryPrice": 1665.75,
      "confidence": 75,
      "potentialRoi": 0.41,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after the break above 1660.42. A significant bullish Fair Value Gap (FVG) exists between 1660.42 and 1666.55. Price is currently retracing into the premium zone of this gap. Expecting a bounce from the 1664-1665 support area to target the recent high at 1668.03 and beyond.",
      "symbol": "ETH",
      "id": "c12cad06-4e1d-440e-82f0-24ea862285c9",
      "timestamp": "2026-02-20T00:48:57.060Z"
    },
    {
      "side": "SELL",
      "tp": 57050,
      "sl": 57225,
      "entryPrice": 57138.47,
      "confidence": 65,
      "potentialRoi": 0.15,
      "analysis": "Detected a bearish Market Structure Shift (MSS) as price broke below the 57160 level. A bearish Fair Value Gap (FVG) exists between 57210 and 57174. Current momentum is downward, targeting the liquidity pool near 57042.",
      "symbol": "BTC",
      "id": "ef88ef8f-5be0-4ae2-93cd-dea5487a1628",
      "timestamp": "2026-02-20T00:48:44.488Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1382,
      "entryPrice": 0.1391,
      "confidence": 75,
      "potentialRoi": 1.36,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed following the break of the 0.1390 resistance level. A Fair Value Gap (FVG) was identified between 0.1387 and 0.1394. The current price of 0.1391 represents a retracement into this bullish discount zone, providing a high-probability entry for a continuation toward the next liquidity target at 0.1410.",
      "symbol": "FET",
      "id": "ac632b6c-49c9-4587-82ab-7dcfe9ecbb46",
      "timestamp": "2026-02-20T00:48:33.687Z"
    },
    {
      "side": "SELL",
      "tp": 0.8525,
      "sl": 0.8605,
      "entryPrice": 0.8567,
      "confidence": 75,
      "potentialRoi": 0.49,
      "analysis": "A bearish Market Structure Shift (MSS) is observed as the price broke below the recent swing low of 0.8571. The final candle shows a sharp decline from the 0.859 resistance zone, creating a bearish Fair Value Gap (FVG) between 0.859 and 0.857. Short-term momentum has shifted downward, targeting the liquidity pool near the 0.8525-0.8534 support cluster.",
      "symbol": "NEAR",
      "id": "ff26a1b5-5208-48d9-8467-38c2b8d4ce45",
      "timestamp": "2026-02-20T00:48:22.042Z"
    },
    {
      "side": "SELL",
      "tp": 7.584,
      "sl": 7.61,
      "entryPrice": 7.599,
      "confidence": 70,
      "potentialRoi": 0.2,
      "analysis": "Market structure shifted bearish after failing to hold above 7.610. Price is currently retracing into a bearish Fair Value Gap (FVG) between 7.600 and 7.604. Expecting a rejection from this zone to target the liquidity pool near 7.584.",
      "symbol": "AVAX",
      "id": "c2f6c7bc-ddc4-4409-b089-3a320b4727b5",
      "timestamp": "2026-02-20T00:48:15.369Z"
    },
    {
      "side": "SELL",
      "tp": 70.35,
      "sl": 70.75,
      "entryPrice": 70.58,
      "confidence": 75,
      "potentialRoi": 0.32,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after breaking below the 70.63 level. A bearish Fair Value Gap (FVG) was identified between 70.73 and 70.64. The price is currently consolidating at local lows, indicating a high probability of further downside movement as it seeks liquidity below the 70.54 support zone.",
      "symbol": "SOL",
      "id": "2f8a73b9-b9d1-4b74-9469-b7b4debc7584",
      "timestamp": "2026-02-20T00:48:01.300Z"
    },
    {
      "side": "BUY",
      "tp": 1672,
      "sl": 1659.5,
      "entryPrice": 1664.72,
      "confidence": 75,
      "potentialRoi": 0.44,
      "analysis": "A significant bullish displacement occurred at candle 9, creating a Market Structure Shift (MSS) above the 1661 level. This move left a large Fair Value Gap (FVG) between 1660.42 and 1666.55. The current price of 1664.72 represents a retracement into this bullish FVG, which typically acts as a support zone for continuation. The stop loss is placed below the displacement origin, while the take profit targets the recent swing high and liquidity above 1668.",
      "symbol": "ETH",
      "id": "239857c2-9da2-43b5-846b-ece7cb4254b8",
      "timestamp": "2026-02-20T00:47:48.268Z"
    },
    {
      "side": "SELL",
      "tp": 57042.45,
      "sl": 57222.52,
      "entryPrice": 57137.86,
      "confidence": 75,
      "potentialRoi": 0.17,
      "analysis": "The market structure has shifted bearish on the 30-minute timeframe, characterized by a sequence of lower highs and lower lows. A significant bearish Fair Value Gap (FVG) was identified between 57212.23 and 57174.28. The recent break below the 57150 level confirms a Market Structure Shift (MSS), indicating a high probability of continued downward momentum toward the next liquidity zone at 57042.45.",
      "symbol": "BTC",
      "id": "f5fbb07c-930c-4d71-ab80-72704a495e43",
      "timestamp": "2026-02-20T00:47:33.550Z"
    },
    {
      "side": "BUY",
      "tp": 0.1405,
      "sl": 0.1386,
      "entryPrice": 0.1391,
      "confidence": 75,
      "potentialRoi": 1.01,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 0.1390 resistance level. The price reached a local high of 0.1396 and is currently in a healthy retracement phase. A minor Fair Value Gap (FVG) is identified between 0.1387 and 0.1390. The entry at 0.1391 aligns with the retest of the breakout zone, targeting a continuation toward 0.1405 while maintaining a stop loss below the recent consolidation at 0.1386.",
      "symbol": "FET",
      "id": "08c330f0-7aa0-4407-9420-414cedf20c2a",
      "timestamp": "2026-02-20T00:47:21.613Z"
    },
    {
      "side": "SELL",
      "tp": 0.8535,
      "sl": 0.8595,
      "entryPrice": 0.8572,
      "confidence": 72,
      "potentialRoi": 0.43,
      "analysis": "A Market Structure Shift (MSS) is identified following a failure to maintain the 0.8591-0.8593 resistance zone. The most recent candle shows a sharp bearish displacement, closing at the low of 0.8572 and breaking the immediate support level. This price action suggests a reversal toward the internal range liquidity and the bullish Fair Value Gap (FVG) located between 0.8555 and 0.8571. Short-term momentum has shifted bearish after a period of distribution at the highs.",
      "symbol": "NEAR",
      "id": "46ae55b2-d26d-4971-98a7-0b20dd4a4a4d",
      "timestamp": "2026-02-20T00:47:14.095Z"
    },
    {
      "side": "BUY",
      "tp": 7.612,
      "sl": 7.588,
      "entryPrice": 7.598,
      "confidence": 65,
      "potentialRoi": 0.18,
      "analysis": "Price rejected the 7.590 level after a retracement from the 7.615 peak. A minor Market Structure Shift (MSS) is identified as the latest candle closed above the previous three candles' highs, suggesting a reversal of the short-term bearish correction. The target is set near the recent swing high, with a stop loss placed below the recent liquidity grab at 7.590.",
      "symbol": "AVAX",
      "id": "419ee47e-2104-47ea-9b91-80823d336621",
      "timestamp": "2026-02-20T00:47:00.121Z"
    },
    {
      "side": "SELL",
      "tp": 70.35,
      "sl": 70.75,
      "entryPrice": 70.58,
      "confidence": 65,
      "potentialRoi": 0.32,
      "analysis": "Market structure shift observed after price failed to sustain levels above 70.80. A bearish FVG was identified between 70.73 and 70.64. Current price action shows a breakdown of internal support levels, suggesting a continuation towards the 70.35 liquidity zone.",
      "symbol": "SOL",
      "id": "721bd5c6-7a3a-4c70-bc01-868cf13e4ca4",
      "timestamp": "2026-02-20T00:46:48.973Z"
    },
    {
      "side": "BUY",
      "tp": 1672,
      "sl": 1662.5,
      "entryPrice": 1665.49,
      "confidence": 75,
      "potentialRoi": 0.39,
      "analysis": "A bullish Market Structure Shift (MSS) occurred at candle 10, breaking the previous resistance at 1661.75. A significant bullish Fair Value Gap (FVG) was created between 1660.42 and 1666.55. The current price of 1665.49 represents a retracement into the premium/equilibrium zone of that impulse leg. Support is expected near the 1663.31 swing low, with a target set at the recent liquidity pool above 1668.03.",
      "symbol": "ETH",
      "id": "08bbc12c-8c26-47cd-bd36-b9319200e1c3",
      "timestamp": "2026-02-20T00:46:32.986Z"
    },
    {
      "side": "BUY",
      "tp": 57320,
      "sl": 57040,
      "entryPrice": 57152.07,
      "confidence": 75,
      "potentialRoi": 0.29,
      "analysis": "Price has retraced into a significant bullish Fair Value Gap (FVG) created during the impulse move to 57323.74. A Market Structure Shift (MSS) occurred when the previous swing high was breached. Current price action shows a mitigation of the discount zone, providing a high-probability entry for a continuation of the bullish structure towards the recent swing high.",
      "symbol": "BTC",
      "id": "5081d5fb-370c-497e-a1f3-437610fecf8e",
      "timestamp": "2026-02-20T00:46:20.339Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1383,
      "entryPrice": 0.139,
      "confidence": 75,
      "potentialRoi": 1.44,
      "analysis": "Market structure shifted bullish following the break of the 0.1383 resistance level. A bullish Fair Value Gap (FVG) was identified between 0.1387 and 0.1394 on the 30M timeframe. The current price of 0.1390 represents a retracement into this liquidity void, providing a high-probability entry for continuation. Stop loss is placed below the previous consolidation base at 0.1383.",
      "symbol": "FET",
      "id": "7269aaa8-527b-4ca6-acb4-b795866cd457",
      "timestamp": "2026-02-20T00:46:10.418Z"
    },
    {
      "side": "SELL",
      "tp": 0.8535,
      "sl": 0.8595,
      "entryPrice": 0.8565,
      "confidence": 78,
      "potentialRoi": 0.35,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed as price breaks below the 0.8571 level following a rejection at the 0.8591 resistance. A sharp displacement candle indicates strong selling pressure. The target is set at the 0.8535 liquidity pool and previous bullish Fair Value Gap (FVG) zone.",
      "symbol": "NEAR",
      "id": "3b0e18c4-4126-41be-b36d-a155f25ce335",
      "timestamp": "2026-02-20T00:46:06.781Z"
    },
    {
      "side": "SELL",
      "tp": 7.58,
      "sl": 7.615,
      "entryPrice": 7.594,
      "confidence": 70,
      "potentialRoi": 0.18,
      "analysis": "A bearish Market Structure Shift (MSS) occurred after the price peaked at 7.615 and broke below the 7.604 level. A bearish Fair Value Gap (FVG) is present between 7.604 and 7.610. The current price action indicates a continuation of the downward momentum as it seeks liquidity at the 7.580 level, which served as the base for the previous bullish expansion.",
      "symbol": "AVAX",
      "id": "e6dccaee-629a-4e1e-a4b3-f25d4e0585c4",
      "timestamp": "2026-02-20T00:45:53.135Z"
    },
    {
      "side": "SELL",
      "tp": 70.3,
      "sl": 70.8,
      "entryPrice": 70.58,
      "confidence": 75,
      "potentialRoi": 0.4,
      "analysis": "Market structure shifted bearish following a break below the 70.63 support level. A bearish Fair Value Gap (FVG) is present between 70.64 and 70.73, indicating sell-side imbalance. Current price action shows a series of lower highs and lower lows, suggesting continued downward momentum toward the 70.30 liquidity zone.",
      "symbol": "SOL",
      "id": "c12eadea-78d0-4b31-8003-acb9e13ab2e2",
      "timestamp": "2026-02-20T00:45:34.518Z"
    },
    {
      "side": "BUY",
      "tp": 1675,
      "sl": 1659.5,
      "entryPrice": 1665.18,
      "confidence": 75,
      "potentialRoi": 0.59,
      "analysis": "Market structure shifted bullish after breaking 1661.75. A significant bullish Fair Value Gap (FVG) was created between 1660.42 and 1666.55. Price is currently retracing into this FVG, providing a high-probability long entry. Target is set at the recent swing high with a stop loss below the impulsive move origin.",
      "symbol": "ETH",
      "id": "382a6864-36c5-480c-a148-c4852e1d8f96",
      "timestamp": "2026-02-20T00:45:21.722Z"
    },
    {
      "side": "BUY",
      "tp": 57320,
      "sl": 57080,
      "entryPrice": 57165.38,
      "confidence": 75,
      "potentialRoi": 0.27,
      "analysis": "Price exhibited a bullish Market Structure Shift (MSS) by breaking above 57137.91 to reach 57323.74. A significant bullish Fair Value Gap (FVG) was created between 57116.31 and 57231.75. The current price has retraced into this FVG zone, providing a high-probability entry for a long position targeting the recent swing high.",
      "symbol": "BTC",
      "id": "d3db4af4-c41f-4517-9634-7a0b1440cc2b",
      "timestamp": "2026-02-20T00:45:07.853Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1385,
      "entryPrice": 0.1391,
      "confidence": 75,
      "potentialRoi": 1.36,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 0.1390 resistance level. The price is currently in a minor retracement phase from the 0.1396 high. While no significant Fair Value Gap (FVG) is present in the immediate 30M history, the trend remains strongly bullish with consistent higher highs and higher lows. The entry at 0.1391 targets a continuation of the trend towards 0.1410, with a stop loss placed below the previous structural breakout point at 0.1387.",
      "symbol": "FET",
      "id": "b4028d36-3d74-4e7f-8066-3232bb512415",
      "timestamp": "2026-02-20T00:44:59.534Z"
    },
    {
      "side": "BUY",
      "tp": 0.865,
      "sl": 0.8545,
      "entryPrice": 0.858,
      "confidence": 75,
      "potentialRoi": 0.82,
      "analysis": "Market structure shifted bullish after breaking the 0.854 resistance level. Price is currently consolidating near local highs of 0.859. The entry at 0.858 anticipates a continuation of the upward momentum following the recent displacement. Support is identified around the 0.855 demand zone, where previous wicks filled minor liquidity gaps.",
      "symbol": "NEAR",
      "id": "51c2ccbf-930c-437f-af90-495c1a896924",
      "timestamp": "2026-02-20T00:44:51.945Z"
    },
    {
      "side": "BUY",
      "tp": 7.615,
      "sl": 7.58,
      "entryPrice": 7.592,
      "confidence": 65,
      "potentialRoi": 0.3,
      "analysis": "Price action shows a clear bullish Market Structure Shift (MSS) after breaking 7.584. A significant Fair Value Gap (FVG) was created between 7.584 and 7.603. The current price of 7.592 represents a retracement into this discount zone. Expecting a reversal as the gap is filled and liquidity is grabbed.",
      "symbol": "AVAX",
      "id": "dc1186fb-88f7-40ae-9fa5-284ed5c05ed3",
      "timestamp": "2026-02-20T00:44:34.258Z"
    },
    {
      "side": "SELL",
      "tp": 70.35,
      "sl": 70.75,
      "entryPrice": 70.57,
      "confidence": 75,
      "potentialRoi": 0.31,
      "analysis": "Market structure shift to the downside observed after breaking 70.66 support. A bearish Fair Value Gap (FVG) is identified between 70.64 and 70.73. Price is currently in a distribution phase following a failure to hold the 70.80 level, targeting the sell-side liquidity pool at the 70.35 swing low.",
      "symbol": "SOL",
      "id": "359630a1-f478-4f2f-91a7-452591ecda06",
      "timestamp": "2026-02-20T00:44:22.525Z"
    },
    {
      "side": "BUY",
      "tp": 1668.03,
      "sl": 1663.3,
      "entryPrice": 1664.94,
      "confidence": 75,
      "potentialRoi": 0.18,
      "analysis": "Detected a bullish impulse from 1660.41 to 1668.03 with a remaining Fair Value Gap (FVG) between 1660.42 and 1666.55. Price is currently retracing into this zone, finding support near the 50% equilibrium level. Market structure remains bullish on the 30m timeframe despite the short-term correction. Target set at the recent swing high.",
      "symbol": "ETH",
      "id": "5b1b8e8e-9199-489f-9814-94bf80faf272",
      "timestamp": "2026-02-20T00:44:20.292Z"
    },
    {
      "side": "SELL",
      "tp": 57050,
      "sl": 57235,
      "entryPrice": 57157.9,
      "confidence": 75,
      "potentialRoi": 0.19,
      "analysis": "Bearish Market Structure Shift (MSS) identified after price failed to sustain levels above 57300. Recent price action shows a series of lower highs and lower lows, indicating strong sell-side pressure. A bearish Fair Value Gap (FVG) was formed during the descent from 57222 to 57171. Target is the liquidity pool near the 57050 support level.",
      "symbol": "BTC",
      "id": "7a839f7c-b7fc-41d3-a58c-80f59e38fda4",
      "timestamp": "2026-02-20T00:44:02.299Z"
    },
    {
      "side": "BUY",
      "tp": 0.1405,
      "sl": 0.1383,
      "entryPrice": 0.1391,
      "confidence": 75,
      "potentialRoi": 1.01,
      "analysis": "The asset exhibits a bullish Market Structure Shift (MSS) following a breakout above the 0.1390 resistance level. A Fair Value Gap (FVG) was identified between 0.1387 and 0.1394. The current price of 0.1391 represents a retracement into this discount zone, providing a high-probability entry for a continuation toward the recent swing high and psychological resistance at 0.1405.",
      "symbol": "FET",
      "id": "f809a4ac-68c0-4920-b4f1-2ba45d27fe71",
      "timestamp": "2026-02-20T00:43:44.561Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "NEAR",
      "id": "4aa6cd34-1a18-40cb-8ea7-3e4729980b1f",
      "timestamp": "2026-02-17T20:54:02.930Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "AVAX",
      "id": "f19c3040-5413-4d1e-91ee-ed0d19e1d7d1",
      "timestamp": "2026-02-17T20:53:53.041Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "SOL",
      "id": "032a0b1c-42fd-4456-8563-686fa21a5337",
      "timestamp": "2026-02-17T20:53:42.963Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "ETH",
      "id": "74e58bb4-9979-4ddb-98b6-72496e5e5a20",
      "timestamp": "2026-02-17T20:53:32.914Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "FET",
      "id": "6dadf63b-65b7-4759-b6b2-27153f0b33bf",
      "timestamp": "2026-02-17T20:53:12.975Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "NEAR",
      "id": "37f479dc-1f61-4b2b-a7c1-3aea7fdfc9df",
      "timestamp": "2026-02-17T20:53:02.935Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "AVAX",
      "id": "fb04d134-ea0b-4f44-aeec-1da7bb56f78b",
      "timestamp": "2026-02-17T20:52:52.916Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "SOL",
      "id": "8d2461c0-d97f-4483-a509-96f2a2a122f4",
      "timestamp": "2026-02-17T20:52:42.914Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "ETH",
      "id": "e518ff78-b202-4b8b-97a1-dc98a0d12798",
      "timestamp": "2026-02-17T20:52:32.947Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "FET",
      "id": "917dd407-0c5b-4e38-a86e-cf4fd334673d",
      "timestamp": "2026-02-17T20:52:13.183Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "NEAR",
      "id": "6da1a62c-7bad-4edf-a639-c4dbff4be247",
      "timestamp": "2026-02-17T20:52:04.404Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "AVAX",
      "id": "26a48ed8-1e7a-4038-ae50-a28409c50ece",
      "timestamp": "2026-02-17T20:51:52.969Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "SOL",
      "id": "eee13d42-251d-4755-a6a1-7778caefe376",
      "timestamp": "2026-02-17T20:51:42.926Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "ETH",
      "id": "27dc4fb3-0cc4-4e58-9235-ced7d6784907",
      "timestamp": "2026-02-17T20:51:33.834Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "BTC",
      "id": "8c7861cb-99f3-414c-8c4f-b234bd16ce7b",
      "timestamp": "2026-02-17T20:51:23.200Z"
    },
    {
      "side": "NEUTRAL",
      "confidence": 0,
      "analysis": "Missing API Key",
      "symbol": "FET",
      "id": "3976bfe6-ea1b-4287-ab78-b3d544d26052",
      "timestamp": "2026-02-17T20:51:12.916Z"
    }
  ],
  "executionLogs": [],
  "activePositions": [
    {
      "symbol": "BTC",
      "entryPrice": 58144.28,
      "amount": 10,
      "tp": 59888.61,
      "sl": 56981.39,
      "pnlPercent": -1.7429057510042287,
      "pnl": null,
      "currentPrice": 57130.88
    }
  ],
  "liquidity": {
    "eur": 1000,
    "usdc": 20.3458948764328
  },
  "dailyStats": {
    "trades": 6,
    "profit": 0,
    "fees": 0,
    "dailyGoal": 50
  },
  "currentStatus": "SNIPING_AVAX",
  "scanIndex": 1246,
  "diag": "PREDATOR_X_ONLINE",
  "lastScans": [],
  "lastSync": null,
  "cooldownUntil": 0,
  "managedAssets": {}
}