{
  "isEngineActive": true,
  "autoPilot": true,
  "isPaperMode": true,
  "settings": {
    "confidenceThreshold": 80,
    "defaultTradeSize": 10
  },
  "thoughts": [
    {
      "side": "BUY",
      "tp": 57210,
      "sl": 57070,
      "entryPrice": 57160.16,
      "confidence": 75,
      "potentialRoi": 0.087,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price reclaimed the 57160.72 level. A significant Fair Value Gap (FVG) is identified between 57123.38 and 57160.16. Current price action suggests a reversal from the local bottom at 57077.06, targeting the liquidity pool near the previous high of 57209.92.",
      "symbol": "BTC",
      "id": "0b80af4e-b1bc-458a-8622-6bbfe2abb1e5",
      "timestamp": "2026-02-20T01:33:26.383Z"
    },
    {
      "side": "SELL",
      "tp": 0.1383,
      "sl": 0.1393,
      "entryPrice": 0.1388,
      "confidence": 62,
      "potentialRoi": 0.36,
      "analysis": "The market exhibited a bearish structure shift after failing to maintain levels above 0.1390. A liquidity sweep occurred at 0.1383, followed by a retracement to the 0.1388 pivot zone. This area now acts as resistance. The absence of a significant bullish Fair Value Gap (FVG) during the bounce suggests the move is a corrective retest of the broken support, favoring a continuation toward the recent lows.",
      "symbol": "FET",
      "id": "69392028-014e-43ae-b0f8-60e9fe33363e",
      "timestamp": "2026-02-20T01:33:07.307Z"
    },
    {
      "side": "BUY",
      "tp": 0.8595,
      "sl": 0.854,
      "entryPrice": 0.8568,
      "confidence": 65,
      "potentialRoi": 0.315,
      "analysis": "Price action shows a liquidity sweep of the 0.8544 level followed by a quick recovery, indicating a potential Market Structure Shift (MSS) to the upside. A bullish Fair Value Gap (FVG) is identified between 0.8558 and 0.8568. The current price is consolidating near the top of the range, suggesting a continuation towards the 0.8595 resistance level.",
      "symbol": "NEAR",
      "id": "03757a15-fd42-4430-a297-2a7a0f6a8545",
      "timestamp": "2026-02-20T01:32:51.180Z"
    },
    {
      "side": "SELL",
      "tp": 7.55,
      "sl": 7.605,
      "entryPrice": 7.586,
      "confidence": 72,
      "potentialRoi": 0.47,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after breaking 7.592. Price is currently consolidating below a bearish Fair Value Gap (FVG) identified between 7.597 and 7.592. Expecting continuation towards liquidity below the 7.581 level.",
      "symbol": "AVAX",
      "id": "6e0a68f3-7c2b-4328-aeb7-1e223a6b1fc3",
      "timestamp": "2026-02-20T01:32:45.596Z"
    },
    {
      "side": "BUY",
      "tp": 70.56,
      "sl": 70.38,
      "entryPrice": 70.45,
      "confidence": 72,
      "potentialRoi": 0.16,
      "analysis": "Price action shows a recovery from the 70.30 liquidity sweep. A bullish Market Structure Shift (MSS) occurred as price reclaimed the 70.40 level with displacement. We expect a continuation toward the bearish Fair Value Gap (FVG) and supply zone located around 70.56.",
      "symbol": "SOL",
      "id": "f553e636-fad7-47c5-b53c-5ebd79daabb2",
      "timestamp": "2026-02-20T01:32:37.190Z"
    },
    {
      "side": "BUY",
      "tp": 1664.5,
      "sl": 1660.5,
      "entryPrice": 1662.12,
      "confidence": 65,
      "potentialRoi": 0.14,
      "analysis": "Detected a local bottom at 1660.6 followed by a minor Market Structure Shift (MSS) on the 30m timeframe as price reclaimed 1662.12. A bearish Fair Value Gap (FVG) exists between 1663.51 and 1664.7, acting as a magnet for a short-term relief rally. The trade targets the lower boundary of this FVG with a stop loss placed below the recent swing low.",
      "symbol": "ETH",
      "id": "133d66e3-8b87-4b08-93ed-0f7eee48e8df",
      "timestamp": "2026-02-20T01:32:17.027Z"
    },
    {
      "side": "BUY",
      "tp": 57200,
      "sl": 57075,
      "entryPrice": 57119.75,
      "confidence": 65,
      "potentialRoi": 0.14,
      "analysis": "Bullish Market Structure Shift (MSS) identified after price hit a local low of 57077.06. A Bullish Fair Value Gap (FVG) was formed between 57093.76 and 57105.58. Current momentum suggests a move towards the previous liquidity zone near 57200.",
      "symbol": "BTC",
      "id": "e75a6a18-8ab5-4eb6-830c-5132b043d4cc",
      "timestamp": "2026-02-20T01:32:07.093Z"
    },
    {
      "side": "BUY",
      "tp": 0.1392,
      "sl": 0.1383,
      "entryPrice": 0.1387,
      "confidence": 68,
      "potentialRoi": 0.36,
      "analysis": "Price action shows a recovery from a local swing low at 0.1383. A minor bullish market structure shift (MSS) is identified as price reclaimed the 0.1386 level with steady volume. The current price of 0.1387 is filling a small bearish FVG, but the sequence of higher lows suggests a move toward the buy-side liquidity resting at 0.1392.",
      "symbol": "FET",
      "id": "feba8450-54c9-4e44-9c5f-5cd9678c3133",
      "timestamp": "2026-02-20T01:32:00.620Z"
    },
    {
      "side": "BUY",
      "tp": 7.598,
      "sl": 7.58,
      "entryPrice": 7.587,
      "confidence": 65,
      "potentialRoi": 0.145,
      "analysis": "Price action shows a rejection of the 7.581 support level after a sustained downtrend from 7.604. A bearish Fair Value Gap (FVG) is identified between 7.587 and 7.595. The current consolidation at the 7.587 level suggests a short-term mean reversion to fill the liquidity gap and test the previous breakdown structure near 7.598.",
      "symbol": "AVAX",
      "id": "828ed77c-faef-4ac2-9f5e-7e35e059f6ea",
      "timestamp": "2026-02-20T01:31:35.502Z"
    },
    {
      "side": "SELL",
      "tp": 69.95,
      "sl": 70.62,
      "entryPrice": 70.39,
      "confidence": 68,
      "potentialRoi": 0.62,
      "analysis": "Market exhibited a bearish Market Structure Shift (MSS) after failing to hold above 70.60. A bearish Fair Value Gap (FVG) was created between 70.46 and 70.34. Price is currently consolidating within this FVG, suggesting a continuation of the bearish trend toward lower liquidity levels.",
      "symbol": "SOL",
      "id": "02bbf841-5f21-434c-ac82-ac264502879e",
      "timestamp": "2026-02-20T01:31:22.567Z"
    },
    {
      "side": "SELL",
      "tp": 1655,
      "sl": 1664.5,
      "entryPrice": 1661.71,
      "confidence": 75,
      "potentialRoi": 0.4,
      "analysis": "Market structure shifted bearish after breaking the 1663.29 level. A bearish Fair Value Gap (FVG) is present between 1662.41 and 1663.57. The current price action shows a weak retracement into the breakdown zone, suggesting a continuation of the downward trend toward lower liquidity pools.",
      "symbol": "ETH",
      "id": "d4698bbb-4073-420b-b676-acb1c8778d40",
      "timestamp": "2026-02-20T01:31:06.581Z"
    },
    {
      "side": "SELL",
      "tp": 57060,
      "sl": 57135,
      "entryPrice": 57109.13,
      "confidence": 65,
      "potentialRoi": 0.086,
      "analysis": "Market structure shifted bearish following the break of the 57111 level. A bearish Fair Value Gap (FVG) was identified between 57091 and 57111. Current price action shows a retracement into this FVG zone, suggesting a potential rejection and continuation of the downward trend toward the recent liquidity low at 57077 and the target of 57060.",
      "symbol": "BTC",
      "id": "3347a291-17dc-434b-b6f8-b2fc5d075b8a",
      "timestamp": "2026-02-20T01:30:54.153Z"
    },
    {
      "side": "SELL",
      "tp": 0.1376,
      "sl": 0.1391,
      "entryPrice": 0.1386,
      "confidence": 65,
      "potentialRoi": 0.72,
      "analysis": "Bearish Market Structure Shift (MSS) detected after price broke below the 0.1387 level. A small bearish Fair Value Gap (FVG) exists between 0.1387 and 0.1388. Current price action shows a weak retracement, suggesting a continuation of the downward move toward lower liquidity pools.",
      "symbol": "FET",
      "id": "d2813691-d4ed-4bd6-adab-1a4eda369a48",
      "timestamp": "2026-02-20T01:30:44.967Z"
    },
    {
      "side": "SELL",
      "tp": 0.8545,
      "sl": 0.8573,
      "entryPrice": 0.8559,
      "confidence": 62,
      "potentialRoi": 0.16,
      "analysis": "Price action shows a repeated rejection of the 0.8568-0.8571 resistance zone. The most recent candle indicates a bearish displacement from the 0.8568 high, suggesting a shift in short-term momentum. A lack of bullish Fair Value Gaps (FVG) and a failure to break the previous swing high at 0.8573 points toward a liquidity hunt at the recent lows near 0.8545.",
      "symbol": "NEAR",
      "id": "2ee426cd-7d14-41fd-8499-8102b5e92b3e",
      "timestamp": "2026-02-20T01:30:32.506Z"
    },
    {
      "side": "SELL",
      "tp": 7.568,
      "sl": 7.598,
      "entryPrice": 7.587,
      "confidence": 72,
      "potentialRoi": 0.25,
      "analysis": "Market structure shift (MSS) confirmed after breaking 7.590 support level. Bearish momentum persists with a Fair Value Gap (FVG) identified between 7.595 and 7.588. Price is currently retracing into the supply zone of the recent leg down, providing a sell entry opportunity targeting lower liquidity pools at 7.568.",
      "symbol": "AVAX",
      "id": "b0e6a9fa-eb1d-45a5-a3e1-851d24a0aeec",
      "timestamp": "2026-02-20T01:30:18.134Z"
    },
    {
      "side": "SELL",
      "tp": 70.15,
      "sl": 70.55,
      "entryPrice": 70.39,
      "confidence": 65,
      "potentialRoi": 0.34,
      "analysis": "Market structure shifted bearish after breaking the 70.38 support level. A bearish Fair Value Gap (FVG) is present between 70.46 and 70.34. Current price action shows a retracement into this FVG, offering a high-probability entry for a continuation of the downward move toward the 70.15 liquidity zone.",
      "symbol": "SOL",
      "id": "bb5b2337-4b56-43a6-bde1-e3280a660e02",
      "timestamp": "2026-02-20T01:30:03.392Z"
    },
    {
      "side": "SELL",
      "tp": 1658,
      "sl": 1664,
      "entryPrice": 1661.96,
      "confidence": 75,
      "potentialRoi": 0.24,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after breaking the 1664.70 swing low. A bearish Fair Value Gap (FVG) is identified between 1663.57 and 1662.41. The current price action shows a corrective retracement into the lower boundary of this FVG, suggesting a continuation of the downward trend toward sell-side liquidity.",
      "symbol": "ETH",
      "id": "3aa7b1bc-f996-4036-93a5-bab6ab11824a",
      "timestamp": "2026-02-20T01:29:55.173Z"
    },
    {
      "side": "SELL",
      "tp": 57025.5,
      "sl": 57165.75,
      "entryPrice": 57110.48,
      "confidence": 68,
      "potentialRoi": 0.15,
      "analysis": "Market structure shifted bearish after the break of the 57120 level. A significant bearish Fair Value Gap (FVG) was created between 57159.84 and 57121.65. The current price action shows a weak retracement into the breakdown zone, suggesting a continuation of the downward trend toward the recent liquidity pool near 57077 and lower psychological levels.",
      "symbol": "BTC",
      "id": "45267e5c-f5eb-4d4a-89b9-cac40b064422",
      "timestamp": "2026-02-20T01:29:41.333Z"
    },
    {
      "side": "SELL",
      "tp": 0.1381,
      "sl": 0.1391,
      "entryPrice": 0.1386,
      "confidence": 65,
      "potentialRoi": 0.36,
      "analysis": "Market structure shifted bearish after failing to hold the 0.1392 level. A break of the 0.1387 support level indicates a shift in momentum. Price is currently consolidating near a minor bearish Fair Value Gap (FVG) created during the drop to 0.1383. Expecting a continuation toward lower liquidity pools.",
      "symbol": "FET",
      "id": "dd506499-abfa-4f46-80d3-c2206eaf2592",
      "timestamp": "2026-02-20T01:29:30.849Z"
    },
    {
      "side": "SELL",
      "tp": 0.8535,
      "sl": 0.8575,
      "entryPrice": 0.855,
      "confidence": 68,
      "potentialRoi": 0.18,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after price broke below the 0.8546 support level. A bearish Fair Value Gap (FVG) was partially filled at 0.8568, and the subsequent rejection suggests a continuation of the downward trend. Short-term momentum is targeting sell-side liquidity below 0.8542.",
      "symbol": "NEAR",
      "id": "840e8faa-d853-4f92-8ebc-83e2f856f513",
      "timestamp": "2026-02-20T01:29:21.917Z"
    },
    {
      "side": "SELL",
      "tp": 7.56,
      "sl": 7.598,
      "entryPrice": 7.583,
      "confidence": 75,
      "potentialRoi": 0.3,
      "analysis": "Market structure shifted bearish after breaking the 7.590 support level. A bearish Fair Value Gap (FVG) is identified between 7.595 and 7.587. The price is currently consolidating near the recent lows, suggesting a continuation of the downward momentum towards liquidity pools below 7.580.",
      "symbol": "AVAX",
      "id": "17a34ed5-537b-479b-a3e4-de810aa20498",
      "timestamp": "2026-02-20T01:29:03.552Z"
    },
    {
      "side": "SELL",
      "tp": 70.15,
      "sl": 70.55,
      "entryPrice": 70.39,
      "confidence": 65,
      "potentialRoi": 0.34,
      "analysis": "Detected a bearish Market Structure Shift (MSS) following a break below the 70.38 level. A bearish Fair Value Gap (FVG) was identified between 70.34 and 70.46. The current price action shows a retracement into this FVG, offering a high-probability entry for a short position targeting lower liquidity levels.",
      "symbol": "SOL",
      "id": "ca6a31d3-0b12-413a-ac38-a2c0f978d3b7",
      "timestamp": "2026-02-20T01:28:51.362Z"
    },
    {
      "side": "SELL",
      "tp": 1658.5,
      "sl": 1664.2,
      "entryPrice": 1661.64,
      "confidence": 72,
      "potentialRoi": 0.19,
      "analysis": "Market structure shift (MSS) confirmed following the peak at 1666.05. The price broke through the 1663.29 swing low with displacement, creating a bearish Fair Value Gap (FVG) between 1663.57 and 1662.41. Current price action is consolidating below the breakdown point, suggesting a continuation of the bearish trend toward lower liquidity pools.",
      "symbol": "ETH",
      "id": "a034c21d-b61d-4a7f-8eb8-9cfea69beab1",
      "timestamp": "2026-02-20T01:28:42.373Z"
    },
    {
      "side": "SELL",
      "tp": 57020.5,
      "sl": 57175.25,
      "entryPrice": 57115,
      "confidence": 68,
      "potentialRoi": 0.17,
      "analysis": "The market exhibited a bearish Market Structure Shift (MSS) after peaking at 57209.92. A significant bearish Fair Value Gap (FVG) was identified between the low of 57159.84 and the high of 57121.65. Current price action shows a minor corrective bounce from the 57077.06 low, providing a high-probability entry for a short position as the trend remains bearish on the short-term timeframe.",
      "symbol": "BTC",
      "id": "3788e089-1133-48ce-bfb4-f3910b658cd0",
      "timestamp": "2026-02-20T01:28:27.012Z"
    },
    {
      "side": "SELL",
      "tp": 0.138,
      "sl": 0.1391,
      "entryPrice": 0.1386,
      "confidence": 68,
      "potentialRoi": 0.43,
      "analysis": "The 30M timeframe shows a clear Market Structure Shift (MSS) to the downside after failing to hold the 0.1392 level. A bearish Fair Value Gap (FVG) was created between 0.1386 and 0.1384 during the impulsive move down to 0.1383. The current price of 0.1386 represents a retest of the upper boundary of this FVG and the previous broken support, now acting as resistance. Expecting a continuation toward the 0.1380 liquidity pool.",
      "symbol": "FET",
      "id": "cf4308e3-4171-4466-bb33-685e814dfb9d",
      "timestamp": "2026-02-20T01:28:20.625Z"
    },
    {
      "side": "SELL",
      "tp": 0.852,
      "sl": 0.8575,
      "entryPrice": 0.8545,
      "confidence": 65,
      "potentialRoi": 0.29,
      "analysis": "Market structure shifted bearish after breaking the 0.8557 level. A sharp decline in the final candles indicates strong selling pressure. A bearish Fair Value Gap (FVG) is present between 0.8568 and 0.8546. The price is currently testing the 0.8542 support; a break below this confirms further downside towards 0.8520.",
      "symbol": "NEAR",
      "id": "f7510c28-04e8-4534-9fb4-89cbea0f1ad6",
      "timestamp": "2026-02-20T01:28:05.278Z"
    },
    {
      "side": "SELL",
      "tp": 7.555,
      "sl": 7.595,
      "entryPrice": 7.579,
      "confidence": 72,
      "potentialRoi": 0.32,
      "analysis": "Market structure shifted bearish after breaking the 7.590 level. A clear downward trend is established with consecutive lower highs and lower lows. A bearish Fair Value Gap (FVG) was identified in the 7.588-7.592 zone. Current price action suggests continued downside momentum as the asset seeks liquidity at lower levels, with a target near the 7.555 support area.",
      "symbol": "AVAX",
      "id": "c1830dd8-2434-4037-9787-71d346245a39",
      "timestamp": "2026-02-20T01:27:51.381Z"
    },
    {
      "side": "SELL",
      "tp": 70.1,
      "sl": 70.48,
      "entryPrice": 70.3,
      "confidence": 78,
      "potentialRoi": 0.28,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after breaking the 70.38 support level. A bearish Fair Value Gap (FVG) is identified between 70.46 and 70.34. Current price action suggests a continuation of the downward trend towards the 70.10 liquidity zone.",
      "symbol": "SOL",
      "id": "0a2bc5d3-7110-4dbd-987b-f467217a63df",
      "timestamp": "2026-02-20T01:27:47.363Z"
    },
    {
      "side": "SELL",
      "tp": 1655.5,
      "sl": 1665.2,
      "entryPrice": 1661.31,
      "confidence": 72,
      "potentialRoi": 0.35,
      "analysis": "The market has exhibited a bearish Market Structure Shift (MSS) following the break below the 1663.00 level. A bearish Fair Value Gap (FVG) is identified between 1662.41 and 1663.57, suggesting that any retracement into this zone will likely face resistance. Current price action shows a minor bounce from 1660.60, but the overall trend remains downward with target liquidity residing near the 1655.50 support zone.",
      "symbol": "ETH",
      "id": "c9dd8f0a-6593-46e5-bf0f-269c8e799389",
      "timestamp": "2026-02-20T01:27:27.432Z"
    },
    {
      "side": "SELL",
      "tp": 57000,
      "sl": 57130,
      "entryPrice": 57083.94,
      "confidence": 75,
      "potentialRoi": 0.15,
      "analysis": "Bearish Market Structure Shift (MSS) detected following a break of the 57111.56 level. A bearish Fair Value Gap (FVG) exists between 57111.57 and 57091.34. Current price action shows sustained downward pressure with targets set at the 57000 liquidity zone.",
      "symbol": "BTC",
      "id": "507e4bd2-514a-42ee-9a3c-1929878364cf",
      "timestamp": "2026-02-20T01:27:16.928Z"
    },
    {
      "side": "SELL",
      "tp": 0.1375,
      "sl": 0.1391,
      "entryPrice": 0.1385,
      "confidence": 68,
      "potentialRoi": 0.72,
      "analysis": "The market has exhibited a bearish Market Structure Shift (MSS) after breaking the 0.1386 support level. A bearish Fair Value Gap (FVG) was identified between 0.1386 and 0.1384 following the sharp decline in candle 28. Current price action shows a weak retracement into the FVG zone, suggesting a continuation of the downward trend toward the next liquidity pool at 0.1375.",
      "symbol": "FET",
      "id": "b2f1eefd-30e5-4d08-ada3-08d9c5e8ff71",
      "timestamp": "2026-02-20T01:27:02.719Z"
    },
    {
      "side": "SELL",
      "tp": 0.8512,
      "sl": 0.8578,
      "entryPrice": 0.8548,
      "confidence": 68,
      "potentialRoi": 0.42,
      "analysis": "The price action shows a bearish Market Structure Shift (MSS) after breaking the 0.8555 support level with significant displacement. A bearish Fair Value Gap (FVG) has formed between 0.8568 and 0.8555. The current price is testing the 0.8542-0.8548 liquidity zone, and a continuation toward lower liquidity pools is expected if the retracement to the FVG fails to break above 0.8571.",
      "symbol": "NEAR",
      "id": "573892b7-cebd-4f9f-82cd-135a07d6c4a7",
      "timestamp": "2026-02-20T01:26:53.183Z"
    },
    {
      "side": "SELL",
      "tp": 7.521,
      "sl": 7.605,
      "entryPrice": 7.577,
      "confidence": 75,
      "potentialRoi": 0.74,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after breaking the 7.586 support level. A Fair Value Gap (FVG) is identified between 7.595 and 7.587, indicating strong downward momentum. The price is currently in an expansion phase following the break of internal liquidity. Target is set at the next projected liquidity level with a stop loss placed above the recent swing high to maintain a valid risk-to-reward ratio.",
      "symbol": "AVAX",
      "id": "4aac8b1b-76ca-4966-ad76-d21b582e201a",
      "timestamp": "2026-02-20T01:26:40.288Z"
    },
    {
      "side": "SELL",
      "tp": 70.05,
      "sl": 70.53,
      "entryPrice": 70.34,
      "confidence": 68,
      "potentialRoi": 0.41,
      "analysis": "Detected a bearish Market Structure Shift (MSS) following a sharp break below the 70.38 support level. The price action shows strong displacement to the downside with a series of lower highs and lower lows. Although wicks overlap, the rapid descent from 70.61 to 70.34 indicates high selling pressure. The trade targets a continuation toward the 70.00 psychological level, with a stop loss placed above the recent swing high of the breakdown candle.",
      "symbol": "SOL",
      "id": "5d1c8330-9781-46f6-b03f-43c356a68a77",
      "timestamp": "2026-02-20T01:26:31.888Z"
    },
    {
      "side": "SELL",
      "tp": 1655.5,
      "sl": 1664.5,
      "entryPrice": 1661.29,
      "confidence": 72,
      "potentialRoi": 0.35,
      "analysis": "Market structure shifted bearish after failing to hold the 1666.05 peak. A clear Market Structure Shift (MSS) occurred as price broke below the 1663.00 support level. A bearish Fair Value Gap (FVG) is visible between the 1663.63 and 1662.41 range. The current price action indicates a continuation of the downward momentum targeting lower liquidity pools.",
      "symbol": "ETH",
      "id": "394c5db5-dbed-4fb1-993b-03adea7c1c3c",
      "timestamp": "2026-02-20T01:26:15.849Z"
    },
    {
      "side": "SELL",
      "tp": 56950,
      "sl": 57165,
      "entryPrice": 57086.46,
      "confidence": 75,
      "potentialRoi": 0.24,
      "analysis": "Market structure shift (MSS) confirmed after breaking 57111.56. A significant bearish Fair Value Gap (FVG) exists between 57159.84 and 57121.65. Price is currently in a strong downward expansion phase. Short-term target set at 56950 based on bearish momentum.",
      "symbol": "BTC",
      "id": "949f8505-c401-4900-aab0-23e9e8b94e2d",
      "timestamp": "2026-02-20T01:26:02.737Z"
    },
    {
      "side": "SELL",
      "tp": 0.1375,
      "sl": 0.1391,
      "entryPrice": 0.1384,
      "confidence": 78,
      "potentialRoi": 0.65,
      "analysis": "A bearish Market Structure Shift (MSS) occurred as price broke below the 0.1386 support level. A bearish Fair Value Gap (FVG) is present between 0.1387 and 0.1388. The recent price action shows a clear displacement to the downside, suggesting a continuation of the bearish trend toward the next liquidity pool.",
      "symbol": "FET",
      "id": "8a0af432-9cd6-4213-af5a-3ea373e65c1f",
      "timestamp": "2026-02-20T01:25:52.823Z"
    },
    {
      "side": "SELL",
      "tp": 0.848,
      "sl": 0.8575,
      "entryPrice": 0.8541,
      "confidence": 65,
      "potentialRoi": 0.71,
      "analysis": "Market structure shift detected as price broke below the 0.8542 support level. A bearish displacement is visible in the final candle, creating a potential sell-side imbalance. Short-term momentum favors further downside towards the 0.8480 liquidity pool.",
      "symbol": "NEAR",
      "id": "c02b6bca-3bf9-4dd7-b0ee-b34b226e06fa",
      "timestamp": "2026-02-20T01:25:39.150Z"
    },
    {
      "side": "SELL",
      "tp": 7.562,
      "sl": 7.596,
      "entryPrice": 7.584,
      "confidence": 78,
      "potentialRoi": 0.29,
      "analysis": "A bearish Market Structure Shift (MSS) occurred as price broke below the 7.590 support level. A bearish Fair Value Gap (FVG) is identified between 7.595 and 7.587. The current price action shows a failure to reclaim the 7.600 handle, followed by an aggressive expansion lower. Short-term targets are set at the next liquidity draw, while the stop loss is placed above the recent swing high and FVG origin.",
      "symbol": "AVAX",
      "id": "225888d3-8359-4bb5-b0bc-a9c6664f488e",
      "timestamp": "2026-02-20T01:25:30.416Z"
    },
    {
      "side": "SELL",
      "tp": 70.05,
      "sl": 70.61,
      "entryPrice": 70.34,
      "confidence": 75,
      "potentialRoi": 0.41,
      "analysis": "Detected a bearish Market Structure Shift (MSS) as price broke below the 70.38 support level. A significant bearish Fair Value Gap (FVG) exists between 70.46 and 70.53. Current price action shows strong selling pressure with a target at the 70.05 liquidity pool.",
      "symbol": "SOL",
      "id": "43439da1-eb7d-4586-9d0f-8888639f5401",
      "timestamp": "2026-02-20T01:25:15.965Z"
    },
    {
      "side": "SELL",
      "tp": 1656.5,
      "sl": 1664.2,
      "entryPrice": 1661.37,
      "confidence": 78,
      "potentialRoi": 0.29,
      "analysis": "Market structure shift (MSS) confirmed following the break of the 1663.50 support level. A bearish Fair Value Gap (FVG) is present between 1662.00 and 1663.57, created during the recent impulsive move down from the 1666.05 local high. Current price action shows sustained bearish pressure with lower highs and lower lows, suggesting a continuation toward the next liquidity pool.",
      "symbol": "ETH",
      "id": "5a965f67-e142-467c-adf2-73965f2b7eb6",
      "timestamp": "2026-02-20T01:25:04.370Z"
    },
    {
      "side": "SELL",
      "tp": 57020,
      "sl": 57175,
      "entryPrice": 57112.52,
      "confidence": 72,
      "potentialRoi": 0.16,
      "analysis": "Market structure shift observed after price failed to sustain levels above 57200. A bearish Fair Value Gap (FVG) was created between 57159.84 and 57114.10. Current price action shows strong bearish momentum following a break of local support. Expecting a continuation towards the 57020 level.",
      "symbol": "BTC",
      "id": "478fd259-6922-460f-9179-590fc21e3b71",
      "timestamp": "2026-02-20T01:24:53.885Z"
    },
    {
      "side": "SELL",
      "tp": 0.138,
      "sl": 0.1391,
      "entryPrice": 0.1386,
      "confidence": 65,
      "potentialRoi": 0.43,
      "analysis": "Market structure shifted bearish after a failure to sustain levels above 0.1392. A bearish Fair Value Gap (FVG) is identified between 0.1388 and 0.1387. The recent price action shows a series of lower highs and lower lows, indicating a short-term downward trend toward the 0.1380 support zone.",
      "symbol": "FET",
      "id": "0362869c-ef3e-4ef1-904c-360da9d33cab",
      "timestamp": "2026-02-20T01:24:42.931Z"
    },
    {
      "side": "SELL",
      "tp": 0.8485,
      "sl": 0.8575,
      "entryPrice": 0.8548,
      "confidence": 62,
      "potentialRoi": 0.74,
      "analysis": "The price action shows a bearish close at the session low of 0.8548, indicating immediate downward momentum. A Market Structure Shift (MSS) is identified as the price breaks below the 0.8555 consolidation zone. A bearish Fair Value Gap (FVG) is present between the high of the previous candle (0.8568) and the current liquidity sweep, suggesting a continuation of the bearish trend toward the next support level near 0.8485.",
      "symbol": "NEAR",
      "id": "7c5a4ce8-46b3-4c2c-9225-b5f5b649823b",
      "timestamp": "2026-02-20T01:24:28.985Z"
    },
    {
      "side": "SELL",
      "tp": 7.565,
      "sl": 7.602,
      "entryPrice": 7.588,
      "confidence": 72,
      "potentialRoi": 0.3,
      "analysis": "Market structure shift confirmed after breaking the 7.590 support level. Bearish momentum is dominant with a series of lower highs and lower lows. A bearish Fair Value Gap (FVG) is present in the 7.595-7.588 range. The current price action suggests a continuation of the downward trend toward the next liquidity zone.",
      "symbol": "AVAX",
      "id": "91867318-cac1-4ff8-8685-fdcf2adc5285",
      "timestamp": "2026-02-20T01:24:19.110Z"
    },
    {
      "side": "BUY",
      "tp": 70.65,
      "sl": 70.35,
      "entryPrice": 70.46,
      "confidence": 65,
      "potentialRoi": 0.27,
      "analysis": "Detected a bullish Market Structure Shift (MSS) after price broke 70.57 to reach 70.61. A significant Fair Value Gap (FVG) exists between 70.40 and 70.56. Current price at 70.46 is retracing into this FVG zone, providing a high-probability entry for a continuation of the bullish trend.",
      "symbol": "SOL",
      "id": "7e49235e-a58d-4513-a144-1563f4cd009d",
      "timestamp": "2026-02-20T01:24:03.807Z"
    },
    {
      "side": "SELL",
      "tp": 1655,
      "sl": 1666.5,
      "entryPrice": 1662.35,
      "confidence": 75,
      "potentialRoi": 0.44,
      "analysis": "A bearish Market Structure Shift (MSS) was confirmed when price broke below the 1664.32 level. A bearish Fair Value Gap (FVG) exists between 1663.51 and 1664.70. The current price is trending lower after failing to sustain the 1666.05 peak, indicating a shift in order flow toward sell-side liquidity.",
      "symbol": "ETH",
      "id": "0b486d42-5cd1-4f73-90cc-751cf0771454",
      "timestamp": "2026-02-20T01:23:51.563Z"
    },
    {
      "side": "SELL",
      "tp": 57099.28,
      "sl": 57209.92,
      "entryPrice": 57141.65,
      "confidence": 75,
      "potentialRoi": 0.07,
      "analysis": "The market structure shifted bearish after the price failed to hold the 57200 level, creating a significant bearish Fair Value Gap (FVG) between 57184.89 and 57148.86. The recent price action shows a displacement lower, breaking previous minor support levels. The trade targets the sell-side liquidity resting at the 57099.28 low, with a stop loss placed above the recent swing high to mitigate risk.",
      "symbol": "BTC",
      "id": "648e9fe2-a8f5-4d14-83b6-186701b5a6c0",
      "timestamp": "2026-02-20T01:23:40.916Z"
    },
    {
      "side": "SELL",
      "tp": 0.138,
      "sl": 0.1393,
      "entryPrice": 0.1388,
      "confidence": 65,
      "potentialRoi": 0.58,
      "analysis": "The market exhibited a bearish Market Structure Shift (MSS) after peaking at 0.1392. A bearish Fair Value Gap (FVG) was identified between 0.1388 and 0.1387 following the breakdown at candle 25. The current price of 0.1388 represents a retest of this broken structure and the FVG zone, suggesting a continuation toward lower liquidity levels.",
      "symbol": "FET",
      "id": "bc59bed6-e464-4ac3-9896-82a100524810",
      "timestamp": "2026-02-20T01:23:29.441Z"
    },
    {
      "side": "BUY",
      "tp": 0.859,
      "sl": 0.854,
      "entryPrice": 0.8562,
      "confidence": 65,
      "potentialRoi": 0.33,
      "analysis": "The price is currently consolidating above a key support level at 0.8550. A minor Market Structure Shift (MSS) is identified as the price has successfully formed higher lows in the most recent candles. A small bullish Fair Value Gap (FVG) is noted between 0.8555 and 0.8557, suggesting a potential liquidity draw toward the previous local high of 0.8590. Short-term momentum is neutral-bullish.",
      "symbol": "NEAR",
      "id": "dec751d9-705c-4676-9025-24611c67477d",
      "timestamp": "2026-02-20T01:23:18.677Z"
    }
  ],
  "executionLogs": [],
  "activePositions": [
    {
      "symbol": "BTC",
      "entryPrice": 58144.28,
      "amount": 10,
      "tp": 59888.61,
      "sl": 56981.39,
      "pnlPercent": -1.6925482609811238,
      "pnl": null,
      "currentPrice": 57160.16
    }
  ],
  "liquidity": {
    "eur": 1000,
    "usdc": 20.3458948764328
  },
  "dailyStats": {
    "trades": 6,
    "profit": 0,
    "fees": 0,
    "dailyGoal": 50
  },
  "currentStatus": "SNIPING_ETH",
  "scanIndex": 1448,
  "diag": "PREDATOR_X_ONLINE",
  "lastScans": [],
  "lastSync": null,
  "cooldownUntil": 0,
  "managedAssets": {}
}