{
  "isEngineActive": true,
  "autoPilot": true,
  "isPaperMode": false,
  "settings": {
    "confidenceThreshold": 75,
    "defaultTradeSize": 10
  },
  "thoughts": [
    {
      "side": "BUY",
      "tp": 57750,
      "sl": 57150,
      "entryPrice": 57246.48,
      "confidence": 82,
      "potentialRoi": 0.88,
      "analysis": "Market shows strong bullish momentum with a series of higher highs and higher lows on the 30m timeframe. Price recently broke the 57236 resistance level, indicating a Market Structure Shift (MSS) towards further upside. The entry at 57246.48 targets the next liquidity pool near 57750. The Take Profit is set to 57750 to ensure the 0.6% exchange fees (approx 343 EUR) are covered while securing the 50 EUR daily profit goal. Stop Loss is placed at 57150, just below the recent consolidation zone, maintaining a calculated risk-to-reward ratio.",
      "symbol": "BTC",
      "id": "b5d8e02e-04f8-4a72-8b3a-d778612323e4",
      "timestamp": "2026-02-20T02:50:48.665Z"
    },
    {
      "side": "BUY",
      "tp": 0.1415,
      "sl": 0.139,
      "entryPrice": 0.1396,
      "confidence": 78,
      "potentialRoi": 1.36,
      "analysis": "Price has stabilized at the 0.1394 support level after a minor liquidity grab. A Market Structure Shift (MSS) is forming on the 30m timeframe as price holds 0.1396. The Take Profit is set at 0.1415 to clear the previous high and account for the 0.6% round-trip exchange fees, ensuring a net positive contribution toward the 50 EUR daily goal. Stop Loss is tight below the recent consolidation floor.",
      "symbol": "FET",
      "id": "2a4476ab-4b9a-4607-876d-5a99e8ef11bb",
      "timestamp": "2026-02-20T02:50:39.221Z"
    },
    {
      "side": "BUY",
      "tp": 0.878,
      "sl": 0.858,
      "entryPrice": 0.862,
      "confidence": 78,
      "potentialRoi": 1.2,
      "analysis": "Detected bullish Market Structure Shift (MSS) after price recovered from the 0.8587 low. A Fair Value Gap (FVG) exists in the 0.8605-0.8615 zone, providing support. Price is currently testing the 0.8625 local resistance; a successful breakout targets the 0.878 level. The Take Profit is set to ensure a net profit of approximately 1.2% after accounting for the 0.6% round-trip exchange fees.",
      "symbol": "NEAR",
      "id": "b1fb2e34-59ae-4146-914c-6a04530d3a68",
      "timestamp": "2026-02-20T02:50:27.432Z"
    },
    {
      "side": "BUY",
      "tp": 7.75,
      "sl": 7.595,
      "entryPrice": 7.608,
      "confidence": 82,
      "potentialRoi": 1.86,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke and sustained above the 7.60 level. A Fair Value Gap (FVG) was identified between 7.60 and 7.606, indicating strong buying pressure. The entry at 7.608 is positioned to capitalize on the upward momentum. The Take Profit is set at 7.75 to ensure a net profit after accounting for the 0.6% round-trip exchange fees, while the Stop Loss is tightly placed at 7.595, just below the recent structure break, to maintain a high risk-to-reward ratio.",
      "symbol": "AVAX",
      "id": "b57309b4-fd6f-4a34-8236-e2ca61044096",
      "timestamp": "2026-02-20T02:50:12.924Z"
    },
    {
      "side": "BUY",
      "tp": 71.55,
      "sl": 70.42,
      "entryPrice": 70.66,
      "confidence": 78,
      "potentialRoi": 1.26,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking 70.58 resistance. Price is currently retracing into a bullish Fair Value Gaps (FVG) zone. Aggressive entry at 70.66 with a TP set at 71.55 to account for the 0.6% round-trip exchange fees and secure a net profit. SL placed below the recent swing low of 70.43 to manage risk.",
      "symbol": "SOL",
      "id": "b74862d7-db9e-4b67-9c41-4c81737faeec",
      "timestamp": "2026-02-20T02:50:01.288Z"
    },
    {
      "side": "BUY",
      "tp": 1678.5,
      "sl": 1656.5,
      "entryPrice": 1661.44,
      "confidence": 82,
      "potentialRoi": 1.02,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking 1660.84. Price is currently consolidating above the breakout zone. Fair Value Gap (FVG) identified between 1658.92 and 1660.82. Entry at current market price with a target set to 1678.50 to account for the 0.6% round-trip fee and secure a net profit towards the 50 EUR daily goal. SL placed below the recent swing low for risk mitigation.",
      "symbol": "ETH",
      "id": "383d7517-247d-477f-acec-abfd4c880246",
      "timestamp": "2026-02-20T02:49:49.341Z"
    },
    {
      "side": "SELL",
      "tp": 0.1378,
      "sl": 0.1403,
      "entryPrice": 0.1396,
      "confidence": 85,
      "potentialRoi": 1.28,
      "analysis": "Bearish structure confirmed after break of 0.1400. Price is currently stagnating at 0.1394, forming a clear sell-side liquidity level. A breakdown is imminent as the market seeks lower liquidity zones. TP is set at 0.1378 to ensure net profitability after accounting for 0.6% round-trip transaction fees.",
      "symbol": "FET",
      "id": "e726d7cd-cc4b-40bb-aea3-b1c7dd023116",
      "timestamp": "2026-02-20T02:49:43.440Z"
    },
    {
      "side": "BUY",
      "tp": 57850,
      "sl": 57180,
      "entryPrice": 57246.8,
      "confidence": 82,
      "potentialRoi": 1.05,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed on the 30m timeframe following a break of the 57236 resistance level. A clear bullish Fair Value Gap (FVG) exists between 57190 and 57208, providing a liquidity cushion. The current momentum is strongly upward. The Take Profit is set at 57850 to ensure the 0.6% round-trip exchange fees (approx 343 EUR) are covered while securing a net profit exceeding the 50 EUR daily goal. Stop Loss is placed tightly below the recent swing low and FVG to maintain a high Risk/Reward ratio.",
      "symbol": "BTC",
      "id": "55444a98-b752-4590-8dae-5f712dcfe052",
      "timestamp": "2026-02-20T02:49:38.101Z"
    },
    {
      "side": "BUY",
      "tp": 0.878,
      "sl": 0.858,
      "entryPrice": 0.862,
      "confidence": 78,
      "potentialRoi": 1.2,
      "analysis": "Detected Market Structure Shift (MSS) on the 30m timeframe as price reclaimed the 0.8615 level. A bullish Fair Value Gap (FVG) is present between 0.8609 and 0.8617. Price is currently testing the 0.8624 resistance; a break above targets 0.878. TP is calculated to cover 0.6% round-trip fees and secure a net profit. SL is placed tightly below the recent swing low of 0.8587 to maintain a high R:R ratio.",
      "symbol": "NEAR",
      "id": "4f86d8de-d8ad-4879-a173-9e2405f5b495",
      "timestamp": "2026-02-20T02:49:11.460Z"
    },
    {
      "side": "BUY",
      "tp": 7.73,
      "sl": 7.58,
      "entryPrice": 7.608,
      "confidence": 82,
      "potentialRoi": 1.6,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking 7.600 resistance. Price is trending upwards with higher highs and higher lows. FVG identified at 7.598-7.601. Entry at 7.608 with TP at 7.73 to account for 0.6% fees and target a net profit. SL set below the recent consolidation base at 7.580.",
      "symbol": "AVAX",
      "id": "19a90f67-68cb-441a-9cfc-2698d67ee86a",
      "timestamp": "2026-02-20T02:48:58.845Z"
    },
    {
      "side": "BUY",
      "tp": 71.65,
      "sl": 70.4,
      "entryPrice": 70.66,
      "confidence": 82,
      "potentialRoi": 1.4,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking 70.69. Price is currently retracing into a bullish impulse leg. Entry at 70.66 with a tight SL below the recent swing low of 70.43. TP is set at 71.65 to ensure the 0.6% round-trip exchange fees are covered while maintaining a healthy profit margin to reach the 50 EUR daily goal.",
      "symbol": "SOL",
      "id": "696588ab-3722-4688-832d-6bff9bccb509",
      "timestamp": "2026-02-20T02:48:51.618Z"
    },
    {
      "side": "BUY",
      "tp": 1686.36,
      "sl": 1658.5,
      "entryPrice": 1661.44,
      "confidence": 82,
      "potentialRoi": 1.5,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after price broke the 1660.84 swing high. A bullish Fair Value Gap (FVG) exists between 1658.92 and 1660.82. The current price is retracing toward this liquidity zone. TP is set at 1686.36 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. SL is placed tightly at 1658.50, just below the FVG, to maintain a high risk-reward ratio.",
      "symbol": "ETH",
      "id": "33215573-2f7b-4fa2-90f9-f2f974215224",
      "timestamp": "2026-02-20T02:48:38.125Z"
    },
    {
      "side": "BUY",
      "tp": 57685.45,
      "sl": 57175.25,
      "entryPrice": 57238.19,
      "confidence": 82,
      "potentialRoi": 0.78,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke above the 57190.73 resistance level. The 30-minute trend shows consistent higher highs and higher lows. A tight Stop Loss is placed just below the recent swing low of 57199.39 to manage risk. The Take Profit is strategically set at 57685.45 to account for the 0.6% round-trip exchange fees (approximately 343.43 EUR) and to secure the 50 EUR daily profit target.",
      "symbol": "BTC",
      "id": "2eb46fc1-923b-4e68-a38e-e5a3535864d7",
      "timestamp": "2026-02-20T02:48:27.387Z"
    },
    {
      "side": "BUY",
      "tp": 0.1415,
      "sl": 0.1385,
      "entryPrice": 0.1396,
      "confidence": 78,
      "potentialRoi": 0.76,
      "analysis": "Detected liquidity sweep at 0.1394 followed by a minor MSS. Price is consolidating above local support. FVG exists up to 0.1401. Target set at 0.1415 to capture buy-side liquidity above recent highs while accounting for 0.6% exchange fees.",
      "symbol": "FET",
      "id": "3b9fd115-50b4-4ea6-882b-48de472cdcf5",
      "timestamp": "2026-02-20T02:48:12.215Z"
    },
    {
      "side": "BUY",
      "tp": 0.885,
      "sl": 0.855,
      "entryPrice": 0.8619,
      "confidence": 78,
      "potentialRoi": 2.08,
      "analysis": "Price is showing a recovery phase from the 0.8587 support level. Bullish momentum is building as price approaches the 0.8625 resistance. A Market Structure Shift (MSS) is anticipated upon a breakout above 0.8625. The Take Profit is set at 0.8850 to ensure the 0.6% round-trip exchange fees are covered while maintaining a healthy profit margin. Stop Loss is positioned below the recent swing low to manage risk aggressively.",
      "symbol": "NEAR",
      "id": "a29b3992-df2e-4920-b995-aea1f77d7ac8",
      "timestamp": "2026-02-20T02:48:02.106Z"
    },
    {
      "side": "BUY",
      "tp": 7.72,
      "sl": 7.58,
      "entryPrice": 7.61,
      "confidence": 82,
      "potentialRoi": 1.44,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 7.60 resistance level. Price action shows a steady upward trend from 7.587. A Fair Value Gap (FVG) is present in the 7.59-7.60 range. The TP is set at 7.72 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. SL is placed tightly below the recent consolidation base at 7.58 to maintain a disciplined risk-to-reward ratio.",
      "symbol": "AVAX",
      "id": "6e927f8a-5c6a-4edd-b50f-8e953e046f58",
      "timestamp": "2026-02-20T02:47:47.709Z"
    },
    {
      "side": "BUY",
      "tp": 71.95,
      "sl": 70.55,
      "entryPrice": 70.68,
      "confidence": 82,
      "potentialRoi": 1.2,
      "analysis": "Bullish MSS confirmed after break of 70.69. Price retraced into the bullish FVG (70.58-70.65). Entry at 70.68 with SL below FVG. TP set at 71.95 to account for 0.6% round-trip fees and target liquidity above recent highs.",
      "symbol": "SOL",
      "id": "e55576ab-b443-4b3a-a49b-45dfb02728b6",
      "timestamp": "2026-02-20T02:47:42.294Z"
    },
    {
      "side": "BUY",
      "tp": 1682.5,
      "sl": 1654.5,
      "entryPrice": 1661.91,
      "confidence": 82,
      "potentialRoi": 1.24,
      "analysis": "Detected Market Structure Shift (MSS) at 1660.84 followed by a bullish Fair Value Gap (FVG) between 1658.92 and 1660.82. Price is currently consolidating above the break. Aggressive buy entry to capture continuation towards 1682.50. Stop Loss is placed below the recent swing low of 1657.12 to manage risk. Take Profit is set to ensure a net gain after accounting for the 0.6% round-trip exchange fees.",
      "symbol": "ETH",
      "id": "858a4db2-527d-41a1-b92b-61687c26bbf8",
      "timestamp": "2026-02-20T02:47:24.893Z"
    },
    {
      "side": "BUY",
      "tp": 57880,
      "sl": 57080,
      "entryPrice": 57240.9,
      "confidence": 82,
      "potentialRoi": 1.12,
      "analysis": "Bullish momentum confirmed following a sweep of 57131 liquidity. Market Structure Shift (MSS) occurred at 57236. Price is currently pushing through local resistance with strong volume. Take Profit (TP) is set at 57880 to account for 0.6% exchange fees and secure a net profit towards the 50 EUR daily goal. Stop Loss (SL) is placed below the recent consolidation base at 57080 for strict risk management.",
      "symbol": "BTC",
      "id": "0b3ec6a5-b62e-4a55-b00d-4e53d921a07b",
      "timestamp": "2026-02-20T02:47:14.435Z"
    },
    {
      "side": "SELL",
      "tp": 0.1375,
      "sl": 0.1405,
      "entryPrice": 0.1398,
      "confidence": 85,
      "potentialRoi": 1.64,
      "analysis": "Detected bearish rejection at the 0.1398 supply zone following a Market Structure Shift (MSS) below 0.1395. The price is currently retracing into a bearish Fair Value Gap (FVG) before an anticipated continuation downward. The Take Profit is set at 0.1375 to target liquidity pools below recent lows, ensuring a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is tightly positioned above the 0.1405 resistance level to maintain a high risk-reward ratio.",
      "symbol": "FET",
      "id": "d3e857c0-ba0e-4299-a7f5-2156fb8c9519",
      "timestamp": "2026-02-20T02:47:09.462Z"
    },
    {
      "side": "BUY",
      "tp": 0.88,
      "sl": 0.8595,
      "entryPrice": 0.8623,
      "confidence": 82,
      "potentialRoi": 2.05,
      "analysis": "Detected bullish Market Structure Shift (MSS) on the 30m timeframe as price cleared the 0.8618 local resistance. A Fair Value Gap (FVG) exists in the 0.8615-0.8618 zone, providing a base for the current move. Entry at 0.8623 targets 0.8800 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is positioned aggressively below the 0.8600 psychological level to maintain a high risk-reward ratio while chasing the 50 EUR daily goal.",
      "symbol": "NEAR",
      "id": "27d7a4eb-5710-454f-90cb-72f9880217a1",
      "timestamp": "2026-02-20T02:46:48.387Z"
    },
    {
      "side": "BUY",
      "tp": 7.725,
      "sl": 7.585,
      "entryPrice": 7.608,
      "confidence": 82,
      "potentialRoi": 1.53,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke 7.601 and 7.607 resistance levels. Strong upward momentum from 7.589 base. FVG identified in the 7.598-7.601 range. Entry at 7.608 targeting 7.725 to account for 0.6% exchange fees and secure net profit. SL placed below recent swing low at 7.585.",
      "symbol": "AVAX",
      "id": "14aca327-f4a3-4197-bb61-183b5403dbd5",
      "timestamp": "2026-02-20T02:46:35.731Z"
    },
    {
      "side": "BUY",
      "tp": 71.5,
      "sl": 70.55,
      "entryPrice": 70.68,
      "confidence": 82,
      "potentialRoi": 1.16,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 70.69 resistance level to reach a high of 70.72. A Fair Value Gap (FVG) exists in the 70.58-70.65 range. Current price of 70.68 represents a retest of the breakout zone. TP is set at 71.50 to account for the 0.6% round-trip exchange fees (approx 0.42 EUR) and secure a net profit toward the 50 EUR daily goal. SL is tight at 70.55, just below the recent consolidation and FVG base.",
      "symbol": "SOL",
      "id": "10f96dc5-1adc-4218-ac64-77f9ea1f6e6b",
      "timestamp": "2026-02-20T02:46:26.415Z"
    },
    {
      "side": "BUY",
      "tp": 1685,
      "sl": 1656.5,
      "entryPrice": 1662.08,
      "confidence": 82,
      "potentialRoi": 1.38,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking 1660.84. Bullish momentum is strong with a significant Fair Value Gap (FVG) created between 1658.36 and 1660.82. Entry at 1662.08 targets 1685.00 to ensure net profit after 0.6% exchange fees. SL placed below the breakout zone for risk management.",
      "symbol": "ETH",
      "id": "7f7984c0-4594-4538-ae6e-667235e7407a",
      "timestamp": "2026-02-20T02:46:13.467Z"
    },
    {
      "side": "BUY",
      "tp": 57850,
      "sl": 57100,
      "entryPrice": 57223.88,
      "confidence": 82,
      "potentialRoi": 1.09,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after recovery from 57136. Price is holding above the 57200 level. Fair Value Gap (FVG) identified in the 57190-57210 range acting as support. Aggressive long entry to capture momentum towards 57850, accounting for 0.6% exchange fees to ensure net profitability.",
      "symbol": "BTC",
      "id": "8c6046d1-b1cd-4dd8-a610-3a5491eb234e",
      "timestamp": "2026-02-20T02:46:01.314Z"
    },
    {
      "side": "BUY",
      "tp": 0.1422,
      "sl": 0.1384,
      "entryPrice": 0.1395,
      "confidence": 78,
      "potentialRoi": 1.33,
      "analysis": "FET is currently consolidating near a local support level of 0.1393-0.1394. A Market Structure Shift (MSS) is anticipated as the price stabilizes after the recent drop from 0.1402. There is a Fair Value Gap (FVG) between 0.1396 and 0.1401 that acts as a magnet for a short-term reversal. The Take Profit is set at 0.1422 to ensure a net profit after accounting for the 0.6% round-trip exchange fees, targeting the liquidity above the previous high.",
      "symbol": "FET",
      "id": "7ac39a1a-d977-428a-a70c-5769a6fe67fa",
      "timestamp": "2026-02-20T02:45:36.499Z"
    },
    {
      "side": "BUY",
      "tp": 0.8785,
      "sl": 0.8605,
      "entryPrice": 0.8625,
      "confidence": 82,
      "potentialRoi": 1.85,
      "analysis": "Price action shows a clear Market Structure Shift (MSS) to the upside, breaking the 0.8618 resistance level. Bullish momentum is confirmed by consecutive higher highs in the 30M history. A Fair Value Gap (FVG) exists between 0.8609 and 0.8617, providing a support base. The TP is set at 0.8785 to account for the 0.6% round-trip exchange fees while targeting a net profit to recover the daily deficit and move toward the 50 EUR goal. SL is placed tightly below the recent consolidation base at 0.8605.",
      "symbol": "NEAR",
      "id": "9a493a84-8947-4a60-93fa-e31e5b0558ba",
      "timestamp": "2026-02-20T02:45:25.858Z"
    },
    {
      "side": "BUY",
      "tp": 7.78,
      "sl": 7.55,
      "entryPrice": 7.61,
      "confidence": 82,
      "potentialRoi": 1.6,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke the 7.60 resistance level with strong momentum. A Fair Value Gap (FVG) is present in the 7.597-7.601 range, providing a liquidity cushion. The Take Profit is set at 7.78 to ensure the 0.6% round-trip exchange fees are covered while securing a net profit towards the 50 EUR daily goal. Stop Loss is placed aggressively below the recent swing low at 7.55.",
      "symbol": "AVAX",
      "id": "d0200c26-7f6f-42a9-a32a-45856c9a66b9",
      "timestamp": "2026-02-20T02:45:10.082Z"
    },
    {
      "side": "BUY",
      "tp": 72.2,
      "sl": 70.45,
      "entryPrice": 70.7,
      "confidence": 82,
      "potentialRoi": 2.12,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 70.69 resistance level. Price action shows a clear series of higher highs and higher lows on the 30m timeframe. A Fair Value Gap (FVG) exists in the 70.58-70.65 zone, providing a support base. The Take Profit is set at 72.2 to ensure the 0.6% round-trip exchange fees are covered while securing a net profit towards the 50 EUR daily goal. Stop Loss is placed tightly below the recent swing low at 70.45 to maintain a disciplined risk-to-reward ratio.",
      "symbol": "SOL",
      "id": "177bf446-c4aa-442e-b3ac-c8c352c63e22",
      "timestamp": "2026-02-20T02:45:00.993Z"
    },
    {
      "side": "BUY",
      "tp": 1685,
      "sl": 1658.5,
      "entryPrice": 1662.19,
      "confidence": 82,
      "potentialRoi": 1.37,
      "analysis": "Detected bullish Market Structure Shift (MSS) with a clear Fair Value Gap (FVG) between 1658.92 and 1660.82. Strong upward momentum in the last 10 periods suggests continuation. Entry at current price with SL placed below the FVG to mitigate downside risk. TP is set at 1685.00 to cover the 0.6% round-trip exchange fees and secure a net profit contributing to the 50 EUR daily target.",
      "symbol": "ETH",
      "id": "b4098094-93a4-494a-ba72-31e513bca3fd",
      "timestamp": "2026-02-20T02:44:47.892Z"
    },
    {
      "side": "BUY",
      "tp": 57780,
      "sl": 57120,
      "entryPrice": 57225.13,
      "confidence": 80,
      "potentialRoi": 0.97,
      "analysis": "Bullish Market Structure Shift (MSS) identified after recovery from 57131. Price created a bullish Fair Value Gap (FVG) between 57190 and 57208. Momentum is upward. TP set to cover 0.6% exchange fees and target daily profit goal.",
      "symbol": "BTC",
      "id": "b6993ae8-efae-46db-94e8-5f302b91afc1",
      "timestamp": "2026-02-20T02:44:36.989Z"
    },
    {
      "side": "NEUTRAL",
      "tp": 0.1396,
      "sl": 0.1396,
      "entryPrice": 0.1396,
      "confidence": 90,
      "potentialRoi": 0,
      "analysis": "Market is currently consolidating in a tight range between 0.1394 and 0.1401. This 0.5% volatility is insufficient to cover the 0.6% round-trip exchange fees. No clear Fair Value Gap (FVG) or Market Structure Shift (MSS) with sufficient displacement has formed. Aggressive scanning confirms that any entry at this level would result in a net loss due to fee friction. Standing aside to preserve capital for a high-probability expansion.",
      "symbol": "FET",
      "id": "7304ffd8-126f-4538-96df-89c976001805",
      "timestamp": "2026-02-20T02:44:33.673Z"
    },
    {
      "side": "BUY",
      "tp": 0.875,
      "sl": 0.8585,
      "entryPrice": 0.8622,
      "confidence": 78,
      "potentialRoi": 1.48,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking 0.8618 resistance. Price is recovering from 0.8587 low with a small Fair Value Gap (FVG) support zone between 0.8613 and 0.8615. Take Profit is set at 0.8750 to account for 0.6% round-trip exchange fees and target a 1:3.4 risk-reward ratio, aiming to recover the daily loss and move toward the 50 EUR goal.",
      "symbol": "NEAR",
      "id": "cf529bab-7a73-4fbb-b202-c88822a316a2",
      "timestamp": "2026-02-20T02:44:12.124Z"
    },
    {
      "side": "BUY",
      "tp": 7.72,
      "sl": 7.57,
      "entryPrice": 7.609,
      "confidence": 82,
      "potentialRoi": 0.85,
      "analysis": "Bullish Market Structure Shift (MSS) identified after breaking the 7.600 resistance level with strong momentum. A Fair Value Gap (FVG) exists between 7.597 and 7.606, suggesting a continuation of the upward trend. The Take Profit is set at 7.72 to ensure a net profit of approximately 0.85% after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed tightly below the recent consolidation base at 7.57 to maintain a favorable risk-to-reward ratio.",
      "symbol": "AVAX",
      "id": "5922ff99-2642-4ff3-8a2b-fad7db188b8e",
      "timestamp": "2026-02-20T02:43:58.920Z"
    },
    {
      "side": "BUY",
      "tp": 71.85,
      "sl": 70.35,
      "entryPrice": 70.71,
      "confidence": 82,
      "potentialRoi": 1.61,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke the previous 70.69 resistance level. Strong momentum is evident with a series of higher lows starting from 70.43. A Fair Value Gap (FVG) exists in the 70.60-70.65 range, providing support. The Take Profit is set at 71.85 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed aggressively below the recent consolidation zone at 70.35.",
      "symbol": "SOL",
      "id": "77706bf8-ced2-4de2-94b1-2a9d2d8edc14",
      "timestamp": "2026-02-20T02:43:48.241Z"
    },
    {
      "side": "BUY",
      "tp": 1682.5,
      "sl": 1654.5,
      "entryPrice": 1662.12,
      "confidence": 82,
      "potentialRoi": 1.22,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 1660.84 resistance level. A clear Fair Value Gap (FVG) exists between 1658.92 and 1660.82, providing a base for the current upward expansion. The trend shows strong bullish momentum in the 30M timeframe. Take Profit is set at 1682.50 to ensure the 0.6% exchange fees are covered while securing a net profit towards the daily goal. Stop Loss is positioned below the recent consolidation zone to maintain a calculated risk-to-reward ratio.",
      "symbol": "ETH",
      "id": "bb541c28-b5e9-47f9-b2f7-ff38042ea746",
      "timestamp": "2026-02-20T02:43:36.348Z"
    },
    {
      "side": "BUY",
      "tp": 57850,
      "sl": 57120,
      "entryPrice": 57233.43,
      "confidence": 82,
      "potentialRoi": 1.07,
      "analysis": "Bullish market structure shift detected after price cleared 57227. Bullish FVG present in the 57190-57208 range. TP accounts for 0.6% round-trip fees plus a net profit margin to reach daily goal.",
      "symbol": "BTC",
      "id": "3651e4e3-43df-4b3e-a6ea-05fa1f49bd78",
      "timestamp": "2026-02-20T02:43:26.806Z"
    },
    {
      "side": "BUY",
      "tp": 0.1418,
      "sl": 0.1388,
      "entryPrice": 0.1396,
      "confidence": 78,
      "potentialRoi": 1.57,
      "analysis": "Price has stabilized at the 0.1394 support level after a sharp decline from 0.1401. A minor Market Structure Shift (MSS) is observed as price holds 0.1396. There is a clear Fair Value Gap (FVG) and liquidity pool near 0.1401. The TP is set at 0.1418 to ensure a net profit after accounting for the 0.6% round-trip exchange fees, targeting the recovery of the previous range.",
      "symbol": "FET",
      "id": "8c46a85e-236e-44ef-83ef-f81fb2ad81a0",
      "timestamp": "2026-02-20T02:43:12.671Z"
    },
    {
      "side": "BUY",
      "tp": 0.882,
      "sl": 0.8575,
      "entryPrice": 0.8624,
      "confidence": 78,
      "potentialRoi": 2.27,
      "analysis": "Detected Market Structure Shift (MSS) on the 30m timeframe as price broke above the 0.8618 resistance level with strong momentum. A Fair Value Gap (FVG) exists between 0.8609 and 0.8624, suggesting a continuation of the upward move. The Take Profit is set at 0.8820 to account for the 0.6% round-trip exchange fees and secure a net profit towards the daily goal. Stop Loss is placed aggressively below the recent swing low of 0.8587 to maintain a high risk-reward ratio.",
      "symbol": "NEAR",
      "id": "e8847191-1bd2-4e79-abca-f9ad2e762428",
      "timestamp": "2026-02-20T02:43:00.385Z"
    },
    {
      "side": "BUY",
      "tp": 7.78,
      "sl": 7.55,
      "entryPrice": 7.607,
      "confidence": 82,
      "potentialRoi": 1.6,
      "analysis": "Detected Market Structure Shift (MSS) above the 7.60 level with strong bullish momentum in the latest candle. Price has broken out of a tight consolidation range (7.589-7.60). A Fair Value Gap (FVG) is present in the 7.59-7.60 zone. The TP is set at 7.78 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. SL is placed below the recent consolidation floor to maintain a calculated risk-reward ratio.",
      "symbol": "AVAX",
      "id": "8a6adde3-87da-4419-a8f7-26166d03edcc",
      "timestamp": "2026-02-20T02:42:47.696Z"
    },
    {
      "side": "BUY",
      "tp": 71.85,
      "sl": 70.42,
      "entryPrice": 70.71,
      "confidence": 82,
      "potentialRoi": 1.61,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke the 70.69 resistance level. Strong momentum observed in the last 30 minutes with a Fair Value Gap (FVG) identified between 70.58 and 70.65. Entry at 70.71 targets 71.85 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is set tightly at 70.42, just below the recent swing low, maintaining a favorable risk-to-reward ratio.",
      "symbol": "SOL",
      "id": "1a2e6165-c324-4df7-920d-7ecf409973ac",
      "timestamp": "2026-02-20T02:42:36.253Z"
    },
    {
      "side": "BUY",
      "tp": 1682,
      "sl": 1658,
      "entryPrice": 1662.01,
      "confidence": 75,
      "potentialRoi": 1.2,
      "analysis": "Detected a bullish Market Structure Shift (MSS) after a sweep of the 1657.10 liquidity zone. Price has reclaimed the 1660 level with strong momentum, leaving a Fair Value Gap (FVG) between 1658.92 and 1660.82. Current price action suggests a continuation towards the next liquidity pool at 1682. TP is set to cover the 0.6% round-trip fee and secure a net profit towards the daily goal.",
      "symbol": "ETH",
      "id": "655040f1-725f-4387-9931-639157900050",
      "timestamp": "2026-02-20T02:42:00.870Z"
    },
    {
      "side": "BUY",
      "tp": 57750,
      "sl": 57050,
      "entryPrice": 57231.57,
      "confidence": 75,
      "potentialRoi": 0.9,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price breaks above the 57230 level following a recovery from 57131. A Fair Value Gap (FVG) exists between 57161 and 57183, providing a liquidity cushion. The Take Profit is set aggressively at 57750 to account for the 0.6% round-trip exchange fees (approx 343 EUR) and to capture the 50 EUR daily profit goal. Stop Loss is placed below the recent consolidation zone to manage risk.",
      "symbol": "BTC",
      "id": "0df8f50a-ef2a-45a5-8355-2abb83bc3d90",
      "timestamp": "2026-02-20T02:41:49.403Z"
    },
    {
      "side": "SELL",
      "tp": 0.1375,
      "sl": 0.1403,
      "entryPrice": 0.1395,
      "confidence": 72,
      "potentialRoi": 1.43,
      "analysis": "Bearish displacement from 0.1401 to 0.1394 indicates a Market Structure Shift (MSS). Price is currently consolidating in a bearish flag pattern. Targeting lower liquidity zones below the 0.1394 support. TP is calculated to cover the 0.6% round-trip exchange fees while maintaining a net profit margin to reach the daily goal.",
      "symbol": "FET",
      "id": "28785b1c-0a85-45e6-9703-7e1a471ef273",
      "timestamp": "2026-02-20T02:41:40.106Z"
    },
    {
      "side": "SELL",
      "tp": 7.53,
      "sl": 7.615,
      "entryPrice": 7.595,
      "confidence": 55,
      "potentialRoi": 0.85,
      "analysis": "Bearish FVG identified at 7.60. Price failed to sustain MSS above 7.601. Aggressive sell entry at 7.595 targeting sell-side liquidity at 7.53. SL placed above swing high to maintain tight risk. TP accounts for 0.6% round-trip fees.",
      "symbol": "AVAX",
      "id": "12d8bb9b-3bea-4a28-9998-02f1f8fd08e9",
      "timestamp": "2026-02-20T02:41:28.892Z"
    },
    {
      "side": "BUY",
      "tp": 0.875,
      "sl": 0.856,
      "entryPrice": 0.8613,
      "confidence": 75,
      "potentialRoi": 0.99,
      "analysis": "Detected bullish recovery after a sweep of the 0.8587 liquidity. Price is filling the FVG created during the previous drop. MSS confirmed on lower timeframe. TP set to clear 0.6% fees and target the 0.875 resistance zone.",
      "symbol": "NEAR",
      "id": "e43ca6eb-9dee-4f3c-ac60-a5dfaa197589",
      "timestamp": "2026-02-20T02:41:23.443Z"
    },
    {
      "side": "BUY",
      "tp": 71.85,
      "sl": 70.42,
      "entryPrice": 70.63,
      "confidence": 75,
      "potentialRoi": 1.72,
      "analysis": "Detected a bullish Market Structure Shift (MSS) after price bounced from 70.43. Price cleared local resistance at 70.62. Setting TP at 71.85 to account for 0.6% round-trip fees and capture the extension of the current upward momentum. SL placed tightly below the recent swing low at 70.42 to maintain a high R/R ratio.",
      "symbol": "SOL",
      "id": "6d98003d-3085-4ab8-a43b-2e60096dc6a9",
      "timestamp": "2026-02-20T02:41:02.714Z"
    },
    {
      "side": "BUY",
      "tp": 1685,
      "sl": 1655,
      "entryPrice": 1661.47,
      "confidence": 75,
      "potentialRoi": 1.41,
      "analysis": "Detected Bullish Market Structure Shift (MSS) following a liquidity sweep at 1657.10. A Bullish Fair Value Gap (FVG) exists between 1658.92 and 1660.82. The current price of 1661.47 is positioned for a continuation of the recovery trend. Take Profit is set at 1685.0 to ensure a net profit after accounting for the 0.6% round-trip exchange fees. Stop Loss is placed aggressively below the recent swing low to maintain a high Risk/Reward ratio.",
      "symbol": "ETH",
      "id": "dca8eea6-c070-428b-98bc-9bd6f9ad1b41",
      "timestamp": "2026-02-20T02:40:49.879Z"
    },
    {
      "side": "BUY",
      "tp": 57680,
      "sl": 57120,
      "entryPrice": 57211.34,
      "confidence": 75,
      "potentialRoi": 0.82,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking 57190. Price is retracing into a bullish FVG zone. Target set to 57680 to account for 0.6% round-trip fees and reach the daily profit goal. SL placed below the recent swing low at 57131.",
      "symbol": "BTC",
      "id": "973f1bf0-2643-49c1-ba4b-cab77adec3c0",
      "timestamp": "2026-02-20T02:40:38.105Z"
    },
    {
      "side": "BUY",
      "tp": 0.1415,
      "sl": 0.1388,
      "entryPrice": 0.1396,
      "confidence": 65,
      "potentialRoi": 1.36,
      "analysis": "FET has established a local support floor at 0.1394 after a retracement from 0.1401. A minor bullish Market Structure Shift (MSS) is forming as price stabilizes at 0.1396. The Take Profit is set at 0.1415 to account for the 0.6% round-trip exchange fees and target liquidity above the previous consolidation zone. Stop Loss is placed tightly below the recent swing low to maintain a high risk-to-reward ratio while pursuing the daily profit goal.",
      "symbol": "FET",
      "id": "62beb25f-54c4-4869-8c5f-42f293ddee0d",
      "timestamp": "2026-02-20T02:40:24.985Z"
    }
  ],
  "executionLogs": [
    {
      "id": "b07ff0d0-aad8-40ed-936f-7aee606abb72",
      "symbol": "FET",
      "action": "BUY",
      "price": 0.1396,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:50:39.221Z"
    },
    {
      "id": "1f7013eb-7bba-41eb-9123-b78d482d82c9",
      "symbol": "NEAR",
      "action": "BUY",
      "price": 0.862,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:50:27.432Z"
    },
    {
      "id": "aa589c83-9f53-46fa-9f39-3f8698b9762a",
      "symbol": "ETH",
      "action": "BUY",
      "price": 1661.44,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:49:49.341Z"
    },
    {
      "id": "6652e0a2-578d-4e50-a6ec-7d69acd3d835",
      "symbol": "NEAR",
      "action": "BUY",
      "price": 0.862,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:49:11.460Z"
    },
    {
      "id": "0126c025-f60b-4c80-9a24-22aee66b0a2a",
      "symbol": "ETH",
      "action": "BUY",
      "price": 1661.44,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:48:38.125Z"
    },
    {
      "id": "b3e00cf1-81d0-4e2a-951d-afc8ce754bf4",
      "symbol": "FET",
      "action": "BUY",
      "price": 0.1396,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:48:12.215Z"
    },
    {
      "id": "20a4d728-0130-4cbf-af78-bc0da12d90ff",
      "symbol": "NEAR",
      "action": "BUY",
      "price": 0.8619,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:48:02.106Z"
    },
    {
      "id": "c5993e3e-52b9-4b8e-8f05-76ae7e68207c",
      "symbol": "ETH",
      "action": "BUY",
      "price": 1661.91,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:47:24.893Z"
    },
    {
      "id": "499585f7-854b-4b20-bcc1-c9d4af20a58d",
      "symbol": "NEAR",
      "action": "BUY",
      "price": 0.8623,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:46:48.387Z"
    },
    {
      "id": "4037cead-88e7-4e55-a304-1c745b877010",
      "symbol": "ETH",
      "action": "BUY",
      "price": 1662.08,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:46:13.467Z"
    },
    {
      "id": "2fdb40c5-4b3c-4d3b-b461-dfc400158510",
      "symbol": "FET",
      "action": "BUY",
      "price": 0.1395,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:45:36.499Z"
    },
    {
      "id": "f974b128-fa7c-4188-88a7-2f2fa5c2a593",
      "symbol": "NEAR",
      "action": "BUY",
      "price": 0.8625,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:45:25.858Z"
    },
    {
      "id": "2d123190-d3f9-4eb4-ba9c-ba7883fb2589",
      "symbol": "ETH",
      "action": "BUY",
      "price": 1662.19,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:44:47.892Z"
    },
    {
      "id": "698d4db7-b34e-47e6-a392-c7cea2099d54",
      "symbol": "NEAR",
      "action": "BUY",
      "price": 0.8622,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:44:12.124Z"
    },
    {
      "id": "3540d419-bc80-41b6-be0f-bd81ad4cbc48",
      "symbol": "ETH",
      "action": "BUY",
      "price": 1662.12,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:43:36.348Z"
    },
    {
      "id": "a94b449d-4d47-4172-98c8-2bb77928200d",
      "symbol": "FET",
      "action": "BUY",
      "price": 0.1396,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:43:12.671Z"
    },
    {
      "id": "31fc3216-3485-488d-8735-deef8355a8cc",
      "symbol": "NEAR",
      "action": "BUY",
      "price": 0.8624,
      "status": "FAILED",
      "details": "INSUFFICIENT_EUR_BALANCE",
      "timestamp": "2026-02-20T02:43:00.385Z"
    },
    {
      "id": "efe29326-6363-4373-9fbf-7b091e7acc53",
      "symbol": "AVAX",
      "action": "BUY",
      "price": 7.607,
      "status": "SUCCESS",
      "details": "AUTO_SMC_HIT_82%",
      "timestamp": "2026-02-20T02:42:48.076Z"
    },
    {
      "id": "056fe3f8-b445-4bb8-8645-a6f8fb02de75",
      "symbol": "SOL",
      "action": "BUY",
      "price": 70.71,
      "status": "SUCCESS",
      "details": "AUTO_SMC_HIT_82%",
      "timestamp": "2026-02-20T02:42:36.616Z"
    },
    {
      "id": "2736c30d-41bf-47c8-95cb-aac8209088f5",
      "symbol": "SOL",
      "action": "SELL",
      "price": 70.52,
      "pnl": -0.04236091499576351,
      "status": "SUCCESS",
      "timestamp": "2026-02-20T02:13:49.440Z"
    },
    {
      "id": "da9235c8-980e-4f52-85df-cffc52da57af",
      "symbol": "SOL",
      "action": "BUY",
      "price": 70.82,
      "status": "SUCCESS",
      "details": "AUTO_SMC_HIT_85%",
      "timestamp": "2026-02-20T02:07:03.903Z"
    }
  ],
  "activePositions": [
    {
      "symbol": "BTC",
      "entryPrice": 58144.28,
      "amount": 10,
      "tp": 59888.61,
      "sl": 56981.39,
      "pnlPercent": -1.5441759705339864,
      "pnl": null,
      "currentPrice": 57246.43
    },
    {
      "symbol": "SOL",
      "entryPrice": 70.71,
      "currentPrice": 70.63,
      "amount": 10,
      "quantity": 0.14142271248762553,
      "tp": 71.85,
      "sl": 70.42,
      "confidence": 82,
      "potentialRoi": 1.61,
      "pnl": -0.011313816999009801,
      "pnlPercent": -0.11313816999009801,
      "isPaper": false,
      "timestamp": "2026-02-20T02:42:36.616Z"
    },
    {
      "symbol": "AVAX",
      "entryPrice": 7.607,
      "currentPrice": 7.606,
      "amount": 10,
      "quantity": 1.3145786775338504,
      "tp": 7.78,
      "sl": 7.55,
      "confidence": 82,
      "potentialRoi": 1.6,
      "pnl": -0.0013145786775342894,
      "pnlPercent": -0.013145786775342892,
      "isPaper": false,
      "timestamp": "2026-02-20T02:42:48.076Z"
    }
  ],
  "liquidity": {
    "eur": 0.0275923458604,
    "usdc": 8.764328e-7
  },
  "dailyStats": {
    "trades": 9,
    "profit": -0.04236091499576351,
    "fees": 0,
    "dailyGoal": 50
  },
  "currentStatus": "SNIPING_BTC",
  "scanIndex": 1825,
  "diag": "PREDATOR_X_ONLINE",
  "lastScans": [],
  "lastSync": null,
  "cooldownUntil": 0,
  "managedAssets": {}
}