{
  "isEngineActive": true,
  "autoPilot": true,
  "isPaperMode": true,
  "settings": {
    "confidenceThreshold": 80,
    "defaultTradeSize": 10
  },
  "thoughts": [
    {
      "side": "SELL",
      "tp": 70.3,
      "sl": 70.68,
      "entryPrice": 70.48,
      "confidence": 75,
      "potentialRoi": 0.25,
      "analysis": "A bearish Market Structure Shift (MSS) occurred after the price failed to sustain levels above 70.66, breaking below the 70.55 support. A bearish Fair Value Gap (FVG) is present between 70.57 and 70.48. The current price is at the lower edge of this imbalance, suggesting a continuation toward the liquidity pool near 70.30.",
      "symbol": "SOL",
      "id": "f27c2730-2c76-4781-a065-5360af66c1f3",
      "timestamp": "2026-02-20T01:48:26.324Z"
    },
    {
      "side": "SELL",
      "tp": 1660.6,
      "sl": 1664,
      "entryPrice": 1662.8,
      "confidence": 75,
      "potentialRoi": 0.13,
      "analysis": "Bearish Market Structure Shift (MSS) confirmed after breaking 1663.26. A bearish Fair Value Gap (FVG) is present between 1663.26 and 1662.06. Price is expected to retrace into the FVG for a sell entry targeting the previous liquidity pool at 1660.60.",
      "symbol": "ETH",
      "id": "6ad98fb9-38d2-4b0f-b909-38746c7a5ce8",
      "timestamp": "2026-02-20T01:48:20.086Z"
    },
    {
      "side": "BUY",
      "tp": 57250,
      "sl": 57145,
      "entryPrice": 57185.94,
      "confidence": 75,
      "potentialRoi": 0.11,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 57170.4 level. Price is currently retracing into a Bullish Fair Value Gap (FVG) established between 57158.12 and 57209.7. This zone acts as a demand area for a continuation towards the recent high of 57254.41.",
      "symbol": "BTC",
      "id": "1590412f-e8c4-4939-a8e7-a26c3180bd44",
      "timestamp": "2026-02-20T01:48:09.450Z"
    },
    {
      "side": "BUY",
      "tp": 0.1405,
      "sl": 0.1389,
      "entryPrice": 0.1393,
      "confidence": 75,
      "potentialRoi": 0.86,
      "analysis": "Market structure shifted bullish after breaking the 0.1390 resistance level. Price is currently forming higher highs and higher lows. A minor consolidation is observed at 0.1393-0.1394, suggesting a continuation of the upward trend towards 0.1405. Support is established at the 0.1389-0.1390 breakout zone.",
      "symbol": "FET",
      "id": "c10debb3-c1d1-4b1a-8e3a-0479d685c0e9",
      "timestamp": "2026-02-20T01:47:52.728Z"
    },
    {
      "side": "BUY",
      "tp": 0.87,
      "sl": 0.8559,
      "entryPrice": 0.8594,
      "confidence": 75,
      "potentialRoi": 1.23,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke above the previous swing high of 0.8587. A significant Fair Value Gap (FVG) is identified between 0.8560 and 0.8588. The current price action shows strong upward momentum with the most recent candles closing near their highs, suggesting a continuation of the short-term trend.",
      "symbol": "NEAR",
      "id": "5f838f8c-e184-4c54-86aa-0662ac90664c",
      "timestamp": "2026-02-20T01:47:37.522Z"
    },
    {
      "side": "BUY",
      "tp": 7.61,
      "sl": 7.58,
      "entryPrice": 7.59,
      "confidence": 55,
      "potentialRoi": 0.26,
      "analysis": "Price action shows a consolidation phase following a liquidity sweep at the 7.581 level. A minor Market Structure Shift (MSS) was observed as price reclaimed the 7.59 level. A small bullish Fair Value Gap (FVG) is present between 7.586 and 7.588, providing a base for the current entry. The target is set at the recent swing high and psychological resistance near 7.61, though the overall market remains choppy.",
      "symbol": "AVAX",
      "id": "615e9aaa-822a-49c5-a824-4503f15e486c",
      "timestamp": "2026-02-20T01:47:30.647Z"
    },
    {
      "side": "BUY",
      "tp": 70.85,
      "sl": 70.3,
      "entryPrice": 70.57,
      "confidence": 75,
      "potentialRoi": 0.4,
      "analysis": "Market Structure Shift (MSS) confirmed after breaking the 70.61 resistance level. Price is currently retracing into a bullish demand zone. A small bullish Fair Value Gap (FVG) was identified in the 70.46-70.50 range during the recent impulsive move. Current price action suggests a healthy pullback before a continuation towards the next liquidity target at 70.85.",
      "symbol": "SOL",
      "id": "795c2483-4e18-4def-8889-f50a819cd06d",
      "timestamp": "2026-02-20T01:47:12.847Z"
    },
    {
      "side": "BUY",
      "tp": 1666.5,
      "sl": 1662.4,
      "entryPrice": 1663.69,
      "confidence": 75,
      "potentialRoi": 0.17,
      "analysis": "Market structure shifted bullish after a liquidity sweep at 1660.60. A clear displacement occurred between candles 18-22, creating a bullish Fair Value Gap (FVG). Current price has retraced into the 1663.37-1664.09 FVG zone, providing a high-probability entry for a continuation towards the recent high of 1665.04 and beyond.",
      "symbol": "ETH",
      "id": "e4108cf9-fe5c-4c87-85a0-6702505859b4",
      "timestamp": "2026-02-20T01:47:06.266Z"
    },
    {
      "side": "BUY",
      "tp": 57450,
      "sl": 57150,
      "entryPrice": 57231.28,
      "confidence": 75,
      "potentialRoi": 0.38,
      "analysis": "The market exhibits a bullish Market Structure Shift (MSS) following the break above the 57170 level. A significant bullish Fair Value Gap (FVG) is present between 57164.92 and 57209.70. Price is currently retracing from a local high of 57254.41, providing a potential entry point for a continuation of the upward trend toward the next liquidity pool at 57450.",
      "symbol": "BTC",
      "id": "538cd6b5-c4ca-4c7d-b424-9ea32425fab0",
      "timestamp": "2026-02-20T01:46:47.012Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1388,
      "entryPrice": 0.1394,
      "confidence": 75,
      "potentialRoi": 1.15,
      "analysis": "The asset has demonstrated a bullish Market Structure Shift (MSS) by breaking above the previous resistance at 0.1391. Price action shows a consistent series of higher lows starting from 0.1383. A minor Fair Value Gap (FVG) was formed during the impulsive move between 0.1391 and 0.1393, which now acts as a support zone. Current consolidation near the 0.1394-0.1396 range suggests a continuation of the upward trend toward the 0.1410 psychological level.",
      "symbol": "FET",
      "id": "9f08aaa3-3c37-4f60-b71f-0a0ccbf0f1a7",
      "timestamp": "2026-02-20T01:46:37.280Z"
    },
    {
      "side": "BUY",
      "tp": 0.87,
      "sl": 0.8575,
      "entryPrice": 0.8611,
      "confidence": 75,
      "potentialRoi": 1.03,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed as price broke above 0.8595. A significant Fair Value Gap (FVG) exists between 0.8560 and 0.8588. Strong upward momentum suggests continuation towards 0.8700.",
      "symbol": "NEAR",
      "id": "1b6423d8-4952-4c79-ae64-751b13f943a4",
      "timestamp": "2026-02-20T01:46:24.280Z"
    },
    {
      "side": "BUY",
      "tp": 7.645,
      "sl": 7.582,
      "entryPrice": 7.6,
      "confidence": 68,
      "potentialRoi": 0.59,
      "analysis": "Bullish Market Structure Shift (MSS) identified as price breaks above the 7.599 resistance level. A small bullish Fair Value Gap (FVG) is present between the previous consolidation and the current breakout candle at 7.6. Momentum suggests a continuation towards the next liquidity zone.",
      "symbol": "AVAX",
      "id": "31fd158a-1339-457d-8417-d402d1782524",
      "timestamp": "2026-02-20T01:46:11.687Z"
    },
    {
      "side": "BUY",
      "tp": 71.25,
      "sl": 70.45,
      "entryPrice": 70.61,
      "confidence": 78,
      "potentialRoi": 0.91,
      "analysis": "A bullish Market Structure Shift (MSS) occurred as price broke the previous swing high of 70.61. A Fair Value Gap (FVG) is present between 70.51 and 70.55, providing a liquidity zone for support. The current price action shows a retest of the breakout level with increasing volume, suggesting a continuation of the upward trend toward the next psychological resistance.",
      "symbol": "SOL",
      "id": "2364807e-32d7-46f2-9a8d-5ee123d5df67",
      "timestamp": "2026-02-20T01:46:02.651Z"
    },
    {
      "side": "BUY",
      "tp": 1667.5,
      "sl": 1662.4,
      "entryPrice": 1663.79,
      "confidence": 75,
      "potentialRoi": 0.22,
      "analysis": "Market structure shifted bullish after clearing the 1660.60 low and breaking previous swing highs. A bullish Fair Value Gap (FVG) was identified between 1663.37 and 1664.09. Price is currently retracing into this zone, providing a high-probability long entry opportunity. Target is set at the next liquidity level above recent highs.",
      "symbol": "ETH",
      "id": "d3371eb8-33ff-4212-aee8-776b9ccbd536",
      "timestamp": "2026-02-20T01:45:51.930Z"
    },
    {
      "side": "BUY",
      "tp": 57480,
      "sl": 57140,
      "entryPrice": 57226.08,
      "confidence": 78,
      "potentialRoi": 0.44,
      "analysis": "Market structure shifted bullish after breaking the 57170 resistance level. A prominent bullish Fair Value Gap (FVG) exists between 57158 and 57209. Current price action shows a healthy retracement from the 57254 peak, suggesting a buy opportunity for trend continuation towards the next liquidity zone.",
      "symbol": "BTC",
      "id": "1d8cdd1f-4ebd-4cbd-b4f3-f805e7206bc5",
      "timestamp": "2026-02-20T01:45:38.506Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1386,
      "entryPrice": 0.1392,
      "confidence": 75,
      "potentialRoi": 1.29,
      "analysis": "Market structure shift (MSS) confirmed after breaking the 0.1391 resistance level. A bullish Fair Value Gap (FVG) is identified between 0.1390 and 0.1392. The price action shows a clear transition from a local downtrend (low at 0.1383) to a bullish trend with higher highs and higher lows. Entry is positioned at the top of the FVG for a short-term continuation.",
      "symbol": "FET",
      "id": "093dc140-8b75-449b-80e1-2e6397777790",
      "timestamp": "2026-02-20T01:45:30.023Z"
    },
    {
      "side": "BUY",
      "tp": 0.8685,
      "sl": 0.8572,
      "entryPrice": 0.8605,
      "confidence": 78,
      "potentialRoi": 0.93,
      "analysis": "Market structure shift (MSS) detected as price broke above the 0.8591 resistance level. A bullish Fair Value Gap (FVG) is present between 0.8591 and 0.8605. The current price is testing the upper boundary of this imbalance zone, suggesting a continuation of the upward momentum toward the next liquidity pool.",
      "symbol": "NEAR",
      "id": "e7d97336-6cb5-45b8-8139-b6d1a63a9247",
      "timestamp": "2026-02-20T01:45:13.318Z"
    },
    {
      "side": "BUY",
      "tp": 7.62,
      "sl": 7.588,
      "entryPrice": 7.599,
      "confidence": 75,
      "potentialRoi": 0.28,
      "analysis": "Bullish Market Structure Shift (MSS) observed as price reclaimed the 7.596 level. Strong momentum towards the 7.60 resistance. FVG identified near 7.592 providing support on potential retracement.",
      "symbol": "AVAX",
      "id": "b1e3decf-4b91-4bf9-b10c-33f121dec0e5",
      "timestamp": "2026-02-20T01:45:01.960Z"
    },
    {
      "side": "BUY",
      "tp": 71.25,
      "sl": 70.35,
      "entryPrice": 70.65,
      "confidence": 78,
      "potentialRoi": 0.85,
      "analysis": "Market structure shift (MSS) detected as price breached the previous swing high of 70.61. A bullish Fair Value Gap (FVG) exists between 70.51 and 70.55. The current price action shows strong impulsive buying pressure with a series of higher lows, indicating a continuation of the short-term bullish trend toward the next liquidity zone.",
      "symbol": "SOL",
      "id": "e49d7c96-5032-49ec-9d98-834c3039843f",
      "timestamp": "2026-02-20T01:44:48.245Z"
    },
    {
      "side": "BUY",
      "tp": 1667.5,
      "sl": 1662,
      "entryPrice": 1664.1,
      "confidence": 75,
      "potentialRoi": 0.2,
      "analysis": "Bullish Market Structure Shift (MSS) detected after price broke the swing high of 1663.97. Two bullish Fair Value Gaps (FVG) were formed during the impulsive move upward, specifically between 1662.70-1663.31 and 1663.37-1664.09. The current price action shows a slight retracement towards the 1664.1 level, which aligns with the top of the most recent FVG, offering a high-probability entry for a short-term long position targeting the previous high of 1666.05 and liquidity above.",
      "symbol": "ETH",
      "id": "9e9914f6-3e62-4bb4-aade-e8b93c72517a",
      "timestamp": "2026-02-20T01:44:43.315Z"
    },
    {
      "side": "BUY",
      "tp": 57400,
      "sl": 57200,
      "entryPrice": 57251.09,
      "confidence": 75,
      "potentialRoi": 0.26,
      "analysis": "The market exhibits a clear bullish Market Structure Shift (MSS) following a recovery from the 57077.06 low. Price has consistently broken previous swing highs, most recently surpassing 57240.49. A Fair Value Gap (FVG) was created during the impulsive move between 57164 and 57222, providing a solid liquidity base. Current momentum suggests a continuation towards the 57400 level, with a stop loss placed below the recent consolidation low at 57200 to manage risk.",
      "symbol": "BTC",
      "id": "a462a0f8-8cb1-418c-836e-fe7c4582db83",
      "timestamp": "2026-02-20T01:44:23.725Z"
    },
    {
      "side": "BUY",
      "tp": 0.1412,
      "sl": 0.1386,
      "entryPrice": 0.1394,
      "confidence": 78,
      "potentialRoi": 1.29,
      "analysis": "The asset shows a clear bullish Market Structure Shift (MSS) after breaking the previous swing high of 0.1391. A bullish Fair Value Gap (FVG) was formed between 0.1390 and 0.1392 during the recent impulse move. Price is currently maintaining momentum above the 0.1392 level, suggesting a continuation toward the next psychological resistance at 0.1410-0.1412.",
      "symbol": "FET",
      "id": "189c618c-a7d9-4807-80c8-2b219e63c9eb",
      "timestamp": "2026-02-20T01:44:14.235Z"
    },
    {
      "side": "BUY",
      "tp": 0.8717,
      "sl": 0.8555,
      "entryPrice": 0.8609,
      "confidence": 75,
      "potentialRoi": 1.25,
      "analysis": "Market Structure Shift (MSS) confirmed as price broke above the 0.8587 resistance level. A bullish Fair Value Gap (FVG) is identified between 0.8560 and 0.8591. Strong upward momentum suggests a continuation towards 0.8717.",
      "symbol": "NEAR",
      "id": "8a8c19b1-fa68-425d-b218-d5c48fb5dea0",
      "timestamp": "2026-02-20T01:43:59.387Z"
    },
    {
      "side": "BUY",
      "tp": 7.625,
      "sl": 7.588,
      "entryPrice": 7.597,
      "confidence": 72,
      "potentialRoi": 0.37,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 7.596 resistance level. A small Fair Value Gap (FVG) is identified near the 7.592-7.594 zone. Short-term momentum is positive following a successful test of the 7.581 support area, indicating a recovery towards previous highs.",
      "symbol": "AVAX",
      "id": "b1a85b99-2b9a-41b2-aa8b-248ac746c2d3",
      "timestamp": "2026-02-20T01:43:53.368Z"
    },
    {
      "side": "BUY",
      "tp": 70.85,
      "sl": 70.38,
      "entryPrice": 70.58,
      "confidence": 75,
      "potentialRoi": 0.38,
      "analysis": "Market shows a bullish Market Structure Shift (MSS) after recovering from the 70.30 low. The price has successfully reclaimed the 70.50 level, turning previous resistance into support. A bullish Fair Value Gap (FVG) was formed during the impulse move between 70.46 and 70.55. Current momentum suggests a continuation toward the 70.85 liquidity pool, provided the 70.38 swing low holds.",
      "symbol": "SOL",
      "id": "56c1a758-7711-426e-b95c-807ee467f552",
      "timestamp": "2026-02-20T01:43:40.808Z"
    },
    {
      "side": "BUY",
      "tp": 1672.5,
      "sl": 1661.2,
      "entryPrice": 1664.38,
      "confidence": 72,
      "potentialRoi": 0.49,
      "analysis": "Bullish Market Structure Shift (MSS) identified after price recovered from 1660.60. A bullish Fair Value Gap (FVG) exists between 1662.70 and 1663.31. Price is currently trending upwards with higher lows, suggesting a continuation toward previous resistance levels near 1666-1670.",
      "symbol": "ETH",
      "id": "3446a478-c490-4f82-85ee-06721f5f213f",
      "timestamp": "2026-02-20T01:43:26.812Z"
    },
    {
      "side": "BUY",
      "tp": 57380,
      "sl": 57140,
      "entryPrice": 57210,
      "confidence": 75,
      "potentialRoi": 0.3,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after price broke the 57170.40 swing high. A significant Fair Value Gap (FVG) is identified between 57158.12 and 57209.70. The current price action shows consolidation near local highs, suggesting a potential retracement to the 57210 entry zone to mitigate the FVG before a continuation toward the 57380 liquidity target.",
      "symbol": "BTC",
      "id": "6cc6f494-10a7-435a-a728-417e3d398cef",
      "timestamp": "2026-02-20T01:43:12.549Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1383,
      "entryPrice": 0.1393,
      "confidence": 75,
      "potentialRoi": 1.22,
      "analysis": "Bullish Market Structure Shift (MSS) identified after price recovery from 0.1383. Higher highs and higher lows on the 30m timeframe suggest continued upward momentum. Entry at current market price with a stop loss below the recent swing low.",
      "symbol": "FET",
      "id": "2ef8ba7b-7054-4cab-a91d-a0d21d0b7d8e",
      "timestamp": "2026-02-20T01:43:00.248Z"
    },
    {
      "side": "SELL",
      "tp": 7.582,
      "sl": 7.601,
      "entryPrice": 7.592,
      "confidence": 68,
      "potentialRoi": 0.13,
      "analysis": "Price is currently retracing into a bearish Fair Value Gap (FVG) identified between 7.587 and 7.595. The overall market structure remains bearish as the price has failed to break the previous swing high of 7.599, indicating no bullish Market Structure Shift (MSS). Expecting a rejection from this FVG zone to target the liquidity at the recent lows.",
      "symbol": "AVAX",
      "id": "839f9341-d724-450f-9fd2-49a46f304f84",
      "timestamp": "2026-02-20T01:42:39.537Z"
    },
    {
      "side": "BUY",
      "tp": 71.25,
      "sl": 70.35,
      "entryPrice": 70.6,
      "confidence": 78,
      "potentialRoi": 0.92,
      "analysis": "The price action shows a bullish Market Structure Shift (MSS) following a recovery from the 70.30 low. A significant bullish Fair Value Gap (FVG) was identified between 70.39 and 70.46. Current momentum is strongly upward, breaking through previous resistance levels at 70.56. The trade targets the next liquidity zone above 71.20 while maintaining a stop loss below the recent consolidation base.",
      "symbol": "SOL",
      "id": "89a1a86d-62d1-4b1d-810f-523bb83b56b7",
      "timestamp": "2026-02-20T01:42:30.711Z"
    },
    {
      "side": "BUY",
      "tp": 1670,
      "sl": 1661.5,
      "entryPrice": 1664.72,
      "confidence": 75,
      "potentialRoi": 0.32,
      "analysis": "Market structure shifted bullish after finding support at 1660.60. A bullish Fair Value Gap (FVG) was identified between 1662.70 and 1663.31. Price is currently trending upwards, breaking local resistance levels. Short-term target set at 1670.00 based on momentum.",
      "symbol": "ETH",
      "id": "450d79c8-f995-4800-9280-1e39a933a253",
      "timestamp": "2026-02-20T01:42:12.567Z"
    },
    {
      "side": "BUY",
      "tp": 57450,
      "sl": 57140,
      "entryPrice": 57231.96,
      "confidence": 75,
      "potentialRoi": 0.38,
      "analysis": "Market exhibited a bullish Market Structure Shift (MSS) by breaking the 57209.92 resistance level. A significant bullish Fair Value Gap (FVG) was identified between 57158.12 and 57209.70. The price recovered strongly from the 57077.06 low, indicating a short-term trend reversal to the upside.",
      "symbol": "BTC",
      "id": "5d5d75f6-b00e-4951-adde-2bddccb204a2",
      "timestamp": "2026-02-20T01:42:01.731Z"
    },
    {
      "side": "BUY",
      "tp": 0.141,
      "sl": 0.1385,
      "entryPrice": 0.1393,
      "confidence": 75,
      "potentialRoi": 1.22,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking 0.1392 resistance. Price action shows a steady recovery from the 0.1383 low with a Fair Value Gap (FVG) supporting the move between 0.1389 and 0.1391. Short-term momentum favors continuation towards 0.1410.",
      "symbol": "FET",
      "id": "a5e4b3dc-3d01-4523-8a2b-e362dac0ce9d",
      "timestamp": "2026-02-20T01:41:50.981Z"
    },
    {
      "side": "BUY",
      "tp": 7.615,
      "sl": 7.585,
      "entryPrice": 7.598,
      "confidence": 70,
      "potentialRoi": 0.22,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after price reclaimed the 7.596 level. Recent price action shows a recovery from the 7.581 low with higher highs and higher lows. A bullish Fair Value Gap (FVG) is present in the 7.590-7.594 zone, providing support for a continuation towards the 7.615 target.",
      "symbol": "AVAX",
      "id": "1e11ac94-c3ee-4aba-81ff-bf373ba000bf",
      "timestamp": "2026-02-20T01:41:30.114Z"
    },
    {
      "side": "BUY",
      "tp": 70.85,
      "sl": 70.44,
      "entryPrice": 70.58,
      "confidence": 72,
      "potentialRoi": 0.38,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after breaking the 70.51 resistance level. Price recovered strongly from the 70.30 liquidity sweep. Current momentum suggests a test of the 70.61 high with a potential extension to 70.85. Support is well-defined at the 70.45-70.49 zone.",
      "symbol": "SOL",
      "id": "bdf31845-ad26-42a6-8b77-83641d3f78bb",
      "timestamp": "2026-02-20T01:41:19.508Z"
    },
    {
      "side": "BUY",
      "tp": 1666.05,
      "sl": 1663.2,
      "entryPrice": 1664.6,
      "confidence": 70,
      "potentialRoi": 0.09,
      "analysis": "Detected a bullish Market Structure Shift (MSS) as price reclaimed levels above 1664.0. A bullish Fair Value Gap (FVG) is noted between 1662.70 and 1663.31. Short-term momentum is positive, targeting the local swing high at 1666.05.",
      "symbol": "ETH",
      "id": "45209954-2031-4024-8c9e-31dd61f92458",
      "timestamp": "2026-02-20T01:41:10.496Z"
    },
    {
      "side": "BUY",
      "tp": 57450,
      "sl": 57140,
      "entryPrice": 57229.48,
      "confidence": 75,
      "potentialRoi": 0.38,
      "analysis": "The market has exhibited a bullish Market Structure Shift (MSS) by breaking through previous resistance levels at 57170. A prominent bullish Fair Value Gap (FVG) is identified between 57158.12 and 57209.70, indicating strong buying pressure. The current price is consolidating near the recent highs, suggesting a continuation of the trend. The target is set at 57450 based on recent momentum, with a stop loss placed below the FVG zone to protect against a structure reversal.",
      "symbol": "BTC",
      "id": "5c7f37c1-1821-4915-a7dd-970d11499849",
      "timestamp": "2026-02-20T01:40:47.699Z"
    },
    {
      "side": "BUY",
      "tp": 0.1405,
      "sl": 0.1386,
      "entryPrice": 0.1392,
      "confidence": 75,
      "potentialRoi": 0.93,
      "analysis": "Market structure has shifted bullish following a recovery from the 0.1383 low. A bullish Fair Value Gap (FVG) was identified between 0.1390 and 0.1392. The price has successfully broken previous resistance levels, confirming a short-term upward trend. Target is set at the next psychological resistance with a stop loss placed below the recent swing low to manage risk.",
      "symbol": "FET",
      "id": "e934955a-47ec-4eab-829f-a4be766994a8",
      "timestamp": "2026-02-20T01:40:40.571Z"
    },
    {
      "side": "BUY",
      "tp": 0.865,
      "sl": 0.855,
      "entryPrice": 0.8585,
      "confidence": 75,
      "potentialRoi": 0.75,
      "analysis": "Bullish Market Structure Shift (MSS) identified after price breached the 0.8573 resistance level. A clear Fair Value Gap (FVG) was created during the impulsive move from 0.8560 to 0.8587. The recent dip to 0.8560 acted as a liquidity sweep before the current recovery, suggesting strong buy-side pressure for a short-term continuation.",
      "symbol": "NEAR",
      "id": "2c0ef1dc-7cff-47aa-9a25-692804fb88dd",
      "timestamp": "2026-02-20T01:40:25.101Z"
    },
    {
      "side": "BUY",
      "tp": 7.61,
      "sl": 7.584,
      "entryPrice": 7.592,
      "confidence": 65,
      "potentialRoi": 0.24,
      "analysis": "A bullish Market Structure Shift (MSS) was observed as price reclaimed the 7.591 level after finding support at 7.581. The recovery shows short-term bullish momentum aiming for the liquidity pool near 7.610. A small bullish Fair Value Gap (FVG) supports the entry at current levels, with a stop loss positioned below the recent swing low.",
      "symbol": "AVAX",
      "id": "d3891931-889e-4045-8841-57669ab6cebb",
      "timestamp": "2026-02-20T01:40:13.534Z"
    },
    {
      "side": "BUY",
      "tp": 70.85,
      "sl": 70.44,
      "entryPrice": 70.58,
      "confidence": 75,
      "potentialRoi": 0.38,
      "analysis": "Price action indicates a bullish recovery following a local bottom at 70.30. A Market Structure Shift (MSS) occurred as price reclaimed the 70.55 level with strong momentum. A bullish Fair Value Gap (FVG) is visible in the 70.40-70.47 range from the recent impulse. The current trend suggests a continuation toward the previous resistance at 70.61 and an extension to 70.85. Stop loss is positioned below the recent consolidation low at 70.44 to mitigate risk.",
      "symbol": "SOL",
      "id": "36c88a20-0041-4f82-bda4-e45caeb66670",
      "timestamp": "2026-02-20T01:40:06.543Z"
    },
    {
      "side": "BUY",
      "tp": 1666.05,
      "sl": 1662.44,
      "entryPrice": 1664.14,
      "confidence": 75,
      "potentialRoi": 0.11,
      "analysis": "A bullish Market Structure Shift (MSS) occurred as price broke above the 1663.97 swing high. A Fair Value Gap (FVG) is visible between 1662.70 and 1663.31. The price has recovered from a local bottom of 1660.60 and is currently showing upward momentum towards the previous resistance level at 1666.05.",
      "symbol": "ETH",
      "id": "c6a71b24-4b70-4679-87d1-41b5186f05bb",
      "timestamp": "2026-02-20T01:39:55.673Z"
    },
    {
      "side": "BUY",
      "tp": 57350,
      "sl": 57150,
      "entryPrice": 57215,
      "confidence": 75,
      "potentialRoi": 0.24,
      "analysis": "Market structure shifted bullish after breaking the 57170 resistance level. A bullish Fair Value Gap (FVG) is identified between 57158.12 and 57209.70 following a strong impulse move. The current price action shows a minor retracement into this gap, providing a high-probability entry for a short-term continuation towards the 57350 liquidity zone.",
      "symbol": "BTC",
      "id": "1b49aa7e-0a7a-4ea3-b391-b6857505dfc9",
      "timestamp": "2026-02-20T01:39:36.486Z"
    },
    {
      "side": "BUY",
      "tp": 0.1405,
      "sl": 0.1385,
      "entryPrice": 0.1392,
      "confidence": 75,
      "potentialRoi": 0.93,
      "analysis": "The asset has demonstrated a bullish Market Structure Shift (MSS) following a recovery from the 0.1383 local low. Current price action is consolidating at the 0.1392 resistance level, forming a series of higher lows. A sustained break above 0.1392 targets the next liquidity pool at 0.1405. The short-term trend is upward, though the range remains relatively tight.",
      "symbol": "FET",
      "id": "44778da3-6b98-401c-8399-4ec99edc1741",
      "timestamp": "2026-02-20T01:39:29.313Z"
    },
    {
      "side": "BUY",
      "tp": 0.861,
      "sl": 0.8555,
      "entryPrice": 0.8574,
      "confidence": 75,
      "potentialRoi": 0.42,
      "analysis": "Bullish Market Structure Shift (MSS) confirmed after price broke the 0.8573 resistance level. A bullish Fair Value Gap (FVG) is identified between 0.8570 and 0.8574. The current price action shows a retracement into this gap, providing a high-probability entry point for a continuation of the upward trend toward the 0.8610 liquidity target.",
      "symbol": "NEAR",
      "id": "865e3d7f-1b24-45ec-b9b6-db23495bdb51",
      "timestamp": "2026-02-20T01:39:11.860Z"
    },
    {
      "side": "BUY",
      "tp": 7.602,
      "sl": 7.58,
      "entryPrice": 7.593,
      "confidence": 65,
      "potentialRoi": 0.12,
      "analysis": "A bullish Market Structure Shift (MSS) occurred after the price established a local bottom at 7.581. The subsequent recovery has broken through minor resistance at 7.590, indicating a shift in short-term momentum. The trade targets the liquidity pool near the previous high of 7.602, with a stop loss placed below the recent consolidation base to manage risk.",
      "symbol": "AVAX",
      "id": "f3ff032d-cc92-4971-8848-8186ad46dedc",
      "timestamp": "2026-02-20T01:39:04.790Z"
    },
    {
      "side": "BUY",
      "tp": 70.85,
      "sl": 70.38,
      "entryPrice": 70.53,
      "confidence": 72,
      "potentialRoi": 0.45,
      "analysis": "Price action indicates a bullish Market Structure Shift (MSS) following a successful test of the 70.30 support zone. The recent close at 70.53 breaks above local resistance levels (70.51). A previous Fair Value Gap (FVG) created during the impulse move to 70.61 is being reclaimed, suggesting momentum is shifting back to the upside for a retest of the recent highs.",
      "symbol": "SOL",
      "id": "1936c848-3cc8-415e-b5b7-eee9e0c3d04c",
      "timestamp": "2026-02-20T01:38:52.338Z"
    },
    {
      "side": "BUY",
      "tp": 1666.05,
      "sl": 1661.5,
      "entryPrice": 1663.3,
      "confidence": 75,
      "potentialRoi": 0.16,
      "analysis": "A bullish Market Structure Shift (MSS) occurred as price broke the 1663.97 swing high. A Fair Value Gap (FVG) is identified between 1662.70 and 1663.31. The current price is retracing into this gap, offering a long entry opportunity targeting the previous peak at 1666.05.",
      "symbol": "ETH",
      "id": "d624ba46-aab0-4e93-b6a4-7c568d6e4c6a",
      "timestamp": "2026-02-20T01:38:42.256Z"
    },
    {
      "side": "BUY",
      "tp": 57350,
      "sl": 57147,
      "entryPrice": 57207.43,
      "confidence": 75,
      "potentialRoi": 0.25,
      "analysis": "The market structure shifted bullish after a recovery from the 57077 low. A prominent bullish Fair Value Gap (FVG) was created between 57158.12 and 57209.7 during the recent impulsive move. The current price is retracing into the upper boundary of this FVG, suggesting a potential bounce to continue the upward trend toward the recent high of 57232 and beyond.",
      "symbol": "BTC",
      "id": "41e70956-1841-4427-9c2c-f87aae04c8a9",
      "timestamp": "2026-02-20T01:38:26.024Z"
    },
    {
      "side": "BUY",
      "tp": 0.1405,
      "sl": 0.1386,
      "entryPrice": 0.1392,
      "confidence": 65,
      "potentialRoi": 0.93,
      "analysis": "The price action indicates a recovery from the 0.1383 low, establishing a bullish Market Structure Shift (MSS) by breaking the previous local high of 0.1391. A minor Fair Value Gap (FVG) is noted between 0.1389 and 0.1390. The current trend is bullish on the 30-minute timeframe, targeting the next liquidity level at 0.1405.",
      "symbol": "FET",
      "id": "d8bef718-6678-432c-9cff-353af6c2d1b1",
      "timestamp": "2026-02-20T01:38:15.352Z"
    }
  ],
  "executionLogs": [],
  "activePositions": [
    {
      "symbol": "BTC",
      "entryPrice": 58144.28,
      "amount": 10,
      "tp": 59888.61,
      "sl": 56981.39,
      "pnlPercent": -1.6526647161165298,
      "pnl": null,
      "currentPrice": 57183.35
    }
  ],
  "liquidity": {
    "eur": 19.9696595458604,
    "usdc": 8.764328e-7
  },
  "dailyStats": {
    "trades": 6,
    "profit": 0,
    "fees": 0,
    "dailyGoal": 50
  },
  "currentStatus": "SNIPING_AVAX",
  "scanIndex": 1522,
  "diag": "PREDATOR_X_ONLINE",
  "lastScans": [],
  "lastSync": null,
  "cooldownUntil": 0,
  "managedAssets": {}
}